{
    "Richard_Shelby": {
        "handle": "SenShelby",
        "state": "Alabama",
        "capital_city": "Montgomery",
        "latitude": "32.377716",
        "longitude": "-86.300568",
        "wiki_html": "[<p><b>Richard Craig Shelby</b> (born May 6, 1934) is an American lawyer and politician serving as the senior United States senator from Alabama. First elected to the U.S. Senate in 1986 as a Democrat who later switched to the Republican Party in 1994, he chaired the Senate Appropriations Committee from 2018 to 2021. He previously chaired the Senate Intelligence Committee, the Senate Banking Committee, and the Senate Rules Committee. He is the longest-serving U.S. senator from Alabama, surpassing John Sparkman's record in March 2019.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup>\n</p> <p>Born in Birmingham, Alabama, Shelby received his law degree from the Birmingham School of Law in 1961. He went on to serve as city prosecutor from 1963 to 1971. During this period he worked as a U.S. magistrate for the Northern District of Alabama (1966–1970) and Special Assistant Attorney General of Alabama (1969–1971). He won a seat in the Alabama Senate in 1970. In 1978, he was elected from the 7th district to the United States House of Representatives, where he was among a group of conservative Democrats known as the boll weevils.\n</p> <p>In 1986, Shelby won a tight race as a Democrat for the U.S. Senate. In 1994, the day after the Republican Revolution in which the GOP gained the majority in Congress midway through President Bill Clinton's first term, Shelby switched parties and became a Republican. He was reelected by a large margin in 1998 and has faced no significant electoral opposition since. He is the dean of Alabama's congressional delegation.\n</p> <p>In February 2021, Shelby announced that he would not seek reelection in 2022.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup>\n</p>]",
        "capital_summary": "Montgomery is the capital city of the U.S. state of Alabama and the county seat of Montgomery County. Named for Richard Montgomery, it stands beside the Alabama River, on the coastal Plain of the Gulf of Mexico. In the 2020 Census, Montgomery's population was 200,603. It is the third most populous city in Alabama, after Birmingham and Huntsville, and is the 119th most populous in the United States. The Montgomery Metropolitan Statistical Area's population in 2020 was 386,047; it is the fourth largest in the state and 142nd among United States metropolitan areas.\n",
        "full_name": "Richard Shelby",
        "img": "https://upload.wikimedia.org/wikipedia/commons/d/df/Richard_Shelby%2C_official_portrait%2C_112th_Congress.jpg"
    },
    "Tommy_Tuberville": {
        "handle": "SenTuberville",
        "state": "Alabama",
        "capital_city": "Montgomery",
        "latitude": "32.377716",
        "longitude": "-86.300568",
        "wiki_html": "[<p><b>Thomas Hawley Tuberville</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'t' in 'tie'\">t</span><span title=\"/ʌ/: 'u' in 'cut'\">ʌ</span><span title=\"'b' in 'buy'\">b</span><span title=\"/ər/: 'er' in 'letter'\">ər</span><span title=\"'v' in 'vie'\">v</span><span title=\"/ɪ/: 'i' in 'kit'\">ɪ</span><span title=\"'l' in 'lie'\">l</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">TUBB</span>-ər-vill</i>;<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> born September 18, 1954) is an American retired college football coach and politician serving as the junior United States senator from Alabama since January 3, 2021. Before entering politics, Tuberville was the head football coach at Auburn University from 1999 to 2008. He was also the head football coach at the University of Mississippi from 1995 to 1998, Texas Tech University from 2010 to 2012, and the University of Cincinnati from 2013 to 2016.\n</p> <p>Tuberville received the 2004 Walter Camp and Bear Bryant Coach of the Year awards after Auburn's 13–0 season, in which Auburn won the Southeastern Conference title and the Sugar Bowl, but was left out of the BCS National Championship Game. He earned his 100th career win in 2007. Tuberville is the only coach in Auburn football history to beat in-state rival Alabama six consecutive times. In 2015, he was the president of the American Football Coaches Association. He worked for ESPN as a color analyst for its college football coverage during 2017.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup>\n</p> <p>In his first political campaign, Tuberville won the Republican nomination for the 2020 Senate election in Alabama and defeated Democratic incumbent Doug Jones by over 20 points.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup><sup class=\"reference\" id=\"cite_ref-4\">[4]</sup><sup class=\"reference\" id=\"cite_ref-:2_5-0\">[5]</sup> Establishing himself as an ally of President Donald Trump, he was among a group of Republican senators who attempted to overturn Democratic president-elect Joe Biden's victory over Trump in the 2020 presidential election.<sup class=\"reference\" id=\"cite_ref-6\">[6]</sup><sup class=\"reference\" id=\"cite_ref-7\">[7]</sup><sup class=\"reference\" id=\"cite_ref-8\">[8]</sup>\n</p>]",
        "capital_summary": "Montgomery is the capital city of the U.S. state of Alabama and the county seat of Montgomery County. Named for Richard Montgomery, it stands beside the Alabama River, on the coastal Plain of the Gulf of Mexico. In the 2020 Census, Montgomery's population was 200,603. It is the third most populous city in Alabama, after Birmingham and Huntsville, and is the 119th most populous in the United States. The Montgomery Metropolitan Statistical Area's population in 2020 was 386,047; it is the fourth largest in the state and 142nd among United States metropolitan areas.\n",
        "full_name": "Tommy Tuberville",
        "img": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Tommy_Tuberville_117th_Congress_Portrait.jpg"
    },
    "Lisa_Murkowski": {
        "handle": "lisamurkowski",
        "state": "Alaska",
        "capital_city": "Juneau",
        "latitude": "58.301598",
        "longitude": "-134.420212",
        "wiki_html": "[<p><b>Lisa Ann Murkowski</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"'m' in 'my'\">m</span><span title=\"/ɜːr/: 'ur' in 'fur'\">ɜːr</span><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'k' in 'kind'\">k</span><span title=\"/aʊ/: 'ou' in 'mouth'\">aʊ</span><span title=\"'s' in 'sigh'\">s</span><span title=\"'k' in 'kind'\">k</span><span title=\"/iː/: 'ee' in 'fleece'\">iː</span></span>/</span></span> <i title=\"English pronunciation respelling\">mur-<span style=\"font-size:90%\">KOW</span>-skee</i>; (born May 22, 1957) is an American attorney and politician serving as the senior United States senator for Alaska, having held that seat since 2002. Murkowski is the second-most senior Republican woman in the Senate, after Susan Collins of Maine. Like Collins, Murkowski is often described as one of the most moderate Republicans in the Senate and a crucial swing vote. Murkowski became the dean of Alaska's Congressional delegation upon Representative Don Young's death.\n</p> <p>Murkowski is the daughter of former U.S. senator and governor of Alaska Frank Murkowski. Before her appointment to the Senate, she served in the Alaska House of Representatives and was elected majority leader. She was controversially appointed to the Senate by her father, who resigned his seat in December 2002 to become governor of Alaska. Murkowski completed her father's unexpired Senate term, which ended in January 2005.\n</p> <p>Murkowski ran for and won a full term in 2004. After losing the 2010 Republican primary to Tea Party candidate Joe Miller, Murkowski ran as a write-in candidate and defeated both Miller and Democrat Scott McAdams in the general election. She is the second U.S. senator (after Strom Thurmond in 1954) to be elected by write-in vote. Murkowski was elected to a third term in 2016, running as a Republican.\n</p> <p>Murkowski was vice chair of the Senate Republican Conference from 2009 to 2010. She served as chair of the Senate Energy and Natural Resources Committee from 2015 to 2021, and has served as vice chair of the Senate Indian Affairs Committee since 2021.\n</p> <p>On February 13, 2021, Murkowski was one of seven Republican senators to vote to convict Donald Trump of incitement of insurrection in his second impeachment trial. Following this vote, she was censured by the Alaska Republican Party.\n</p>]",
        "capital_summary": "The City and Borough of Juneau, more commonly known simply as Juneau ), is the capital city of the state of Alaska. Located in the Gastineau Channel and the Alaskan panhandle, it is a unified municipality and the second-largest city in the United States by area. Juneau was named the capital of Alaska in 1906, when the government of what was then the District of Alaska was moved from Sitka as dictated by the U.S. Congress in 1900. The municipality unified on July 1, 1970, when the city of Juneau merged with the city of Douglas and the surrounding Greater Juneau Borough to form the current municipality, which is larger by area than both Rhode Island and Delaware.\n",
        "full_name": "Lisa Murkowski",
        "img": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Lisa_Murkowski_official_photo.jpg"
    },
    "Dan_Sullivan_(U.S._senator)": {
        "handle": "SenDanSullivan",
        "state": "Alaska",
        "capital_city": "Juneau",
        "latitude": "58.301598",
        "longitude": "-134.420212",
        "wiki_html": "[<p><b>Daniel Scott Sullivan</b> (born November 13, 1964) is an American politician and attorney serving as the junior United States senator for Alaska since 2015. He is a member of the Republican Party.\n</p> <p>Sullivan was in active duty for the United States Marine Corps from 1993 to 1997, 2004 to 2006, and in 2009 and 2013. Between 1997 and 1999, he clerked for judges on the United States Court of Appeals for the Ninth Circuit and the Alaska Supreme Court. After working as an attorney in private practice in Anchorage, Alaska from 2000 to 2002, Sullivan moved to Maryland to work for the Bush administration; he worked with the National Economic Council and the National Security Council and later served as Assistant Secretary of State for Economic and Business Affairs. He was Alaska Attorney General from 2009 to 2010 and commissioner of the Alaska Department of Natural Resources from 2010 to 2013.\n</p> <p>Sullivan ran in the 2014 election for the U.S. Senate seat held by Democratic incumbent Mark Begich. In August 2014, he won the Republican primary, defeating Alaska Lieutenant Governor Mead Treadwell and 2010 Senate nominee Joe Miller. Sullivan defeated Begich in the general election, 47.96% to 45.83%, a margin of 6,014 votes out of 282,400 cast. He was reelected in 2020, defeating independent challenger Al Gross by about 13 percentage points.<sup class=\"reference\" id=\"cite_ref-TheHill11112020_1-0\">[1]</sup>\n</p>]",
        "capital_summary": "The City and Borough of Juneau, more commonly known simply as Juneau ), is the capital city of the state of Alaska. Located in the Gastineau Channel and the Alaskan panhandle, it is a unified municipality and the second-largest city in the United States by area. Juneau was named the capital of Alaska in 1906, when the government of what was then the District of Alaska was moved from Sitka as dictated by the U.S. Congress in 1900. The municipality unified on July 1, 1970, when the city of Juneau merged with the city of Douglas and the surrounding Greater Juneau Borough to form the current municipality, which is larger by area than both Rhode Island and Delaware.\n",
        "full_name": "Dan Sullivan (U.S. senator)",
        "img": "https://upload.wikimedia.org/wikipedia/commons/1/10/Senator_Dan_Sullivan_official.jpg"
    },
    "Kyrsten_Sinema": {
        "handle": "SenatorSinema",
        "state": "Arizona",
        "capital_city": "Phoenix",
        "latitude": "33.448143",
        "longitude": "-112.096962",
        "wiki_html": "[<p><b>Kyrsten Lea Sinema</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'k' in 'kind'\">k</span><span title=\"/ɪər/: 'ear' in 'near'\">ɪər</span><span title=\"'s' in 'sigh'\">s</span><span title=\"'t' in 'tie'\">t</span><span title=\"/ə/: 'a' in 'about'\">ə</span><span title=\"'n' in 'nigh'\">n</span></span><span class=\"wrap\"> </span><span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'s' in 'sigh'\">s</span><span title=\"/ɪ/: 'i' in 'kit'\">ɪ</span><span title=\"'n' in 'nigh'\">n</span><span title=\"/ə/: 'a' in 'about'\">ə</span><span title=\"'m' in 'my'\">m</span><span title=\"/ə/: 'a' in 'about'\">ə</span></span>/</span></span>; born July 12, 1976) is an American politician serving as the senior United States senator from Arizona since January 2019. A member of the Democratic Party, she served three terms as a state representative for the 15th legislative district from 2005 to 2011, one term as the state senator for the 15th legislative district from 2011 to 2012, and three terms as the United States representative for the <span data-sort-value=\"Arizona09 !\">9th district</span> from 2013 to 2019.\n</p> <p>Sinema began her political career in the Arizona Green Party and rose to prominence for her progressive advocacy, supporting causes such as LGBT rights and opposing the war on terror. She left the Green Party to join the Arizona Democratic Party in 2004 and was elected to a seat in the United States House of Representatives in 2012. After her election, she joined the New Democrat Coalition, the Blue Dog Coalition and the bipartisan Problem Solvers Caucus, amassing one of the most conservative voting records in the Democratic caucus.<sup class=\"reference\" id=\"cite_ref-polmiddle_1-0\">[1]</sup>\n</p> <p>She won the 2018 Senate election to replace the retiring Jeff Flake, defeating Republican nominee Martha McSally. Sinema is the first openly bisexual and the second openly LGBT woman (after Tammy Baldwin of Wisconsin) to be elected to the House of Representatives and to the Senate in 2012 and 2018, respectively.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> She also was the first woman elected to the Senate from Arizona.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup>\n</p> <p>Sinema is considered a moderate Democrat and was identified as the 47th most conservative member of the Senate in a 2019 analysis by the nonpartisan organization GovTrack.us.<sup class=\"reference\" id=\"cite_ref-delighting_4-0\">[4]</sup><sup class=\"reference\" id=\"cite_ref-totheright_5-0\">[5]</sup>\n</p>]",
        "capital_summary": "Phoenix  Walapai: Banyà:nyuwá) is the capital and most populous city in the American state of Arizona, with 1,608,139 residents as of 2020. It is the fifth-most populous city in the United States, and the only state capital with a population of more than one million residents.\n",
        "full_name": "Kyrsten Sinema",
        "img": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Kyrsten_Sinema_%28cropped%29.jpg"
    },
    "Mark_Kelly": {
        "handle": "SenMarkKelly",
        "state": "Arizona",
        "capital_city": "Phoenix",
        "latitude": "33.448143",
        "longitude": "-112.096962",
        "wiki_html": "[<p><b>Mark Edward Kelly</b> (born February 21, 1964) is an American politician, businessman, retired astronaut for NASA, and retired U.S. Navy captain serving as the junior United States senator from Arizona since 2020.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup> A member of the Democratic Party, he won the 2020 special election, defeating incumbent Republican Martha McSally. \n</p> <p>Kelly flew combat missions during the Gulf War as a naval aviator before being selected as a NASA Space Shuttle pilot in 1996. He flew his first space mission in 2001 as pilot of STS-108, piloted STS-121 in 2006, and commanded STS-124 in 2008 and STS-134 in 2011, the final mission of Space Shuttle <i>Endeavour</i>.<sup class=\"reference\" id=\"cite_ref-4\">[4]</sup> His identical twin Scott Kelly is also a retired astronaut; they are the only siblings to have both traveled in space.<sup class=\"reference\" id=\"cite_ref-5\">[5]</sup><sup class=\"reference\" id=\"cite_ref-6\">[6]</sup>\n</p> <p>Kelly's wife, then-Arizona Congresswoman Gabby Giffords, was shot and nearly killed in an assassination attempt on January 8, 2011.<sup class=\"reference\" id=\"cite_ref-Brothers_in_tragedy_7-0\">[7]</sup><sup class=\"reference\" id=\"cite_ref-NYT_choice_8-0\">[8]</sup> Six people died in the Tucson shooting. After the Sandy Hook Elementary School shooting the following year, Giffords and Kelly founded the nonprofit Americans for Responsible Solutions, later renamed Giffords, which campaigns for gun control measures like universal background checks and red flag laws.<sup class=\"reference\" id=\"cite_ref-9\">[9]</sup><sup class=\"reference\" id=\"cite_ref-10\">[10]</sup><sup class=\"reference\" id=\"cite_ref-11\">[11]</sup><sup class=\"reference\" id=\"cite_ref-12\">[12]</sup> Kelly won the 2020 United States Senate special election in Arizona and was sworn in on December 2, 2020.\n</p>]",
        "capital_summary": "Phoenix  Walapai: Banyà:nyuwá) is the capital and most populous city in the American state of Arizona, with 1,608,139 residents as of 2020. It is the fifth-most populous city in the United States, and the only state capital with a population of more than one million residents.\n",
        "full_name": "Mark Kelly",
        "img": "https://upload.wikimedia.org/wikipedia/commons/c/c5/SenatorKellyOfficialPhoto_%28cropped%29.jpg"
    },
    "John_Boozman": {
        "handle": "JohnBoozman",
        "state": "Arkansas",
        "capital_city": "Little Rock",
        "latitude": "34.746613",
        "longitude": "-92.288986",
        "wiki_html": "[<p><b>John Nichols Boozman</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'b' in 'buy'\">b</span><span title=\"/oʊ/: 'o' in 'code'\">oʊ</span><span title=\"'z' in 'zoom'\">z</span><span title=\"/./: syllable break\">.</span><span title=\"'m' in 'my'\">m</span><span title=\"/ən/: 'on' in 'button'\">ən</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">BOHZ</span>-mən</i>; born December 10, 1950) is an American politician and former optometrist serving as the senior United States senator from Arkansas, a seat he has held since 2011. A member of the Republican Party, he was the U.S. representative for <span data-sort-value=\"Arkansas03 !\">Arkansas's 3rd congressional district</span> from 2001 to 2011. He is the dean of Arkansas's congressional delegation.\n</p> <p>Boozman was born in Shreveport, Louisiana, where his father was stationed with the U.S. Air Force, but the family eventually returned to Fort Smith, Arkansas, where he was raised. He is the brother of the late state senator Fay Boozman. He attended the University of Arkansas, where he played football for the Arkansas Razorbacks, and graduated from the Southern College of Optometry. He co-founded a private optometry clinic in 1977 and worked as a volunteer optometrist for low-income families. He won a special election in 2001 to the U.S. House of Representatives, where he served as assistant majority whip and sat on the Republican Policy Committee. He was an advocate for drug policy issues and chaired the Veteran Affairs Economic Opportunity Subcommittee, where he led the passage of bills expanding services for unemployed veterans.\n</p> <p>Boozman was elected to the United States Senate in 2010, defeating Democratic incumbent Blanche Lincoln by a 21-point margin and becoming the first Republican to be elected to the seat since Reconstruction. He took office in January 2011 and is the ranking Republican on the Senate Agriculture, Nutrition, and Forestry Subcommittee on Commodities, Risk Management and Trade and the Senate Appropriations Committee Subcommittee on Military Construction and Veterans Affairs and Related Agencies. He is also a senior member of the United States Senate Committee on Veterans' Affairs. Boozman became the senior senator from Arkansas in 2015 when Mark Pryor left the Senate after his defeat. Boozman was reelected in 2016.\n</p>]",
        "capital_summary": "Little Rock is the capital and most populous city of the U.S. state of Arkansas. The city's population was 202,591 in 2020 according to the United States Census Bureau. As the county seat of Pulaski County, the city was incorporated on November 7, 1831, on the south bank of the Arkansas River close to the state's geographic center. The city derived its name from a rock formation along the river, named the \"Little Rock\"  by the French explorer Jean-Baptiste Bénard de la Harpe in 1722. The capital of the Arkansas Territory was moved to Little Rock from Arkansas Post in 1821.  The six-county Little Rock–North Little Rock–Conway, AR Metropolitan Statistical Area  is ranked 78th in terms of population in the United States with 738,344 residents according to the 2017 estimate by the United States Census Bureau.\n",
        "full_name": "John Boozman",
        "img": "https://upload.wikimedia.org/wikipedia/commons/3/30/Senator_John_Boozman_Official_Portrait_%28115th_Congress%29.jpg"
    },
    "Tom_Cotton": {
        "handle": "SenTomCotton",
        "state": "Arkansas",
        "capital_city": "Little Rock",
        "latitude": "34.746613",
        "longitude": "-92.288986",
        "wiki_html": "[<p><b>Thomas Bryant Cotton</b> (born May 13, 1977) is an American politician, attorney, and former military officer serving as the junior United States senator for Arkansas since 2015. A member of the Republican Party, he served in the U.S. House of Representatives from 2013 to 2015.\n</p> <p>After graduating from Harvard College in 1998 and Harvard Law School in 2002, Cotton worked as a federal clerk for a year and as an associate at two Washington, D.C., law firms before enlisting in the U.S. Army in January 2005. He was commissioned as an infantry officer in June and rose to the rank of captain before being honorably discharged in 2009. He served tours in Iraq, Afghanistan, and at Fort Myer (Arlington, Virginia), and was awarded the Bronze Star and the Combat Infantryman Badge.\n</p> <p>Cotton was elected as the U.S. representative for Arkansas's 4th congressional district in 2012 and to the Senate at age 37 in 2014, defeating two-term Democratic incumbent Mark Pryor.\n</p>]",
        "capital_summary": "Little Rock is the capital and most populous city of the U.S. state of Arkansas. The city's population was 202,591 in 2020 according to the United States Census Bureau. As the county seat of Pulaski County, the city was incorporated on November 7, 1831, on the south bank of the Arkansas River close to the state's geographic center. The city derived its name from a rock formation along the river, named the \"Little Rock\"  by the French explorer Jean-Baptiste Bénard de la Harpe in 1722. The capital of the Arkansas Territory was moved to Little Rock from Arkansas Post in 1821.  The six-county Little Rock–North Little Rock–Conway, AR Metropolitan Statistical Area  is ranked 78th in terms of population in the United States with 738,344 residents according to the 2017 estimate by the United States Census Bureau.\n",
        "full_name": "Tom Cotton",
        "img": "https://upload.wikimedia.org/wikipedia/commons/4/49/Tom_Cotton_official_Senate_photo.jpg"
    },
    "Dianne_Feinstein": {
        "handle": "SenFeinstein",
        "state": "California",
        "capital_city": "Sacramento",
        "latitude": "38.576668",
        "longitude": "-121.493629",
        "wiki_html": "[<p><b>Dianne Goldman Berman Feinstein</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'f' in 'find'\">f</span><span title=\"/aɪ/: 'i' in 'tide'\">aɪ</span><span title=\"'n' in 'nigh'\">n</span><span title=\"'s' in 'sigh'\">s</span><span title=\"'t' in 'tie'\">t</span><span title=\"/aɪ/: 'i' in 'tide'\">aɪ</span><span title=\"'n' in 'nigh'\">n</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">FYNE</span>-styne</i>; born <b>Dianne Emiel Goldman</b>; June 22, 1933) is an American politician who serves as the senior United States senator from California, a seat she has held since 1992. A member of the Democratic Party, she was mayor of San Francisco from 1978 to 1988.<sup class=\"reference\" id=\"cite_ref-famousfolk.com_1-0\">[1]</sup>\n</p> <p>Born in San Francisco, Feinstein graduated from Stanford University in 1955. In the 1960s, she worked in local government in San Francisco. Feinstein was elected to the San Francisco Board of Supervisors in 1969. She served as the board's first female president in 1978, during which time the assassinations of Mayor George Moscone and City Supervisor Harvey Milk by Dan White drew national attention. Feinstein succeeded Moscone as mayor and became the first woman to serve in that position. During her tenure, she led the renovation of the city's cable car system and oversaw the 1984 Democratic National Convention. Despite a failed recall attempt in 1983, Feinstein was a very popular mayor and was named the most effective mayor in the country by City &amp; State in 1987.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup><sup class=\"reference\" id=\"cite_ref-3\">[3]</sup><sup class=\"reference\" id=\"cite_ref-4\">[4]</sup>\n</p> <p>After losing a race for governor in 1990, Feinstein won a 1992 special election to the U.S. Senate.<sup class=\"reference\" id=\"cite_ref-5\">[5]</sup> The special election was triggered by the resignation of Pete Wilson, who defeated her in the 1990 gubernatorial election. Despite being elected on the same ballot as her peer Barbara Boxer, Feinstein became California's first female U.S. senator, as she was elected in a special election and sworn in before Boxer. She became California's senior senator a few weeks later in 1993 when Alan Cranston retired. Feinstein has been reelected five times and in the 2012 election received 7.86 million votes – the most popular votes in any U.S. Senate election in history.<sup class=\"reference\" id=\"cite_ref-Charles_Mahtesian_6-0\">[6]</sup><sup class=\"reference\" id=\"cite_ref-7\">[7]</sup>\n</p> <p>Feinstein authored the 1994 Federal Assault Weapons Ban, which expired in 2004. She introduced a new assault weapons bill in 2013 that failed to pass. Feinstein is the first woman to have chaired the Senate Rules Committee and the Senate Intelligence Committee, and the first woman to have presided over a U.S. presidential inauguration. She was the ranking member of the Senate Judiciary Committee from 2017 to 2021 and had chaired the International Narcotics Control Caucus from 2009 to 2015.\n</p> <p>At <span class=\"currentage\"></span>88, Feinstein is the oldest sitting U.S. senator. In March 2021, Feinstein became the longest-serving U.S. senator from California, surpassing Hiram Johnson.<sup class=\"reference\" id=\"cite_ref-San_Francisco_Media_Company_8-0\">[8]</sup> Upon the death of Don Young, she became the oldest sitting member of Congress. Upon Barbara Mikulski's retirement in January 2017, Feinstein became the longest-tenured female senator currently serving; should she serve through November 5, 2022, Feinstein will surpass Mikulski's record as the longest-tenured female senator. In January 2021, Feinstein filed the initial Federal Election Commission paperwork needed to seek reelection in 2024, when she will be 91.<sup class=\"reference\" id=\"cite_ref-auto_9-0\">[9]</sup> Feinstein's staff later clarified that this was due to election law technicalities, and did not indicate her intentions in 2024.<sup class=\"reference\" id=\"cite_ref-10\">[10]</sup>\n</p>]",
        "capital_summary": "Sacramento , Spanish for ''sacrament'') is the capital city of the U.S. state of California and the seat and largest city of Sacramento County. Located at the confluence of the Sacramento and American Rivers in Northern California's Sacramento Valley, Sacramento's 2020 population of 524,943 makes it the sixth-largest city in California and the ninth-largest capital in the United States. Sacramento is the seat of the California Legislature and the Governor of California, making it the state's political center and a hub for lobbying and think tanks. It features the California State Capitol Museum.\n",
        "full_name": "Dianne Feinstein",
        "img": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Dianne_Feinstein%2C_official_Senate_photo_2.jpg"
    },
    "Alex_Padilla": {
        "handle": "AlexPadilla4CA",
        "state": "California",
        "capital_city": "Sacramento",
        "latitude": "38.576668",
        "longitude": "-121.493629",
        "wiki_html": "[<p><b>Alejandro Padilla</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"'p' in 'pie'\">p</span><span title=\"/ə/: 'a' in 'about'\">ə</span><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'d' in 'dye'\">d</span><span title=\"/iː/: 'ee' in 'fleece'\">iː</span><span title=\"/ə/: 'a' in 'about'\">ə</span></span>/</span></span> <i title=\"English pronunciation respelling\">pə-<span style=\"font-size:90%\">DEE</span>-ə</i>; born March 22, 1973) is an American politician serving as the junior United States senator from California since 2021. A member of the Democratic Party, Padilla served as the 32nd secretary of state of California from 2015 to 2021.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup>\n</p> <p>Padilla served more than seven years on the Los Angeles City Council, representing the 7th district. First elected in 1999, he was the president of the Los Angeles City Council from 2001 to 2006. He then served in the California State Senate for the 20th district from 2006 to 2014.\n</p> <p>Governor Gavin Newsom appointed Padilla to the United States Senate after then-Senator Kamala Harris was elected Vice President of the United States; Harris, as the newly elected vice president and president of the Senate, swore Padilla in on January 20, 2021. His term ends in November 2022; in April 2021, he announced his candidacy in the 2022 election for the term from November 2022 to January 2023 and the subsequent full term.<sup class=\"reference\" id=\"cite_ref-auto1_2-0\">[2]</sup><sup class=\"reference\" id=\"cite_ref-auto_3-0\">[3]</sup> He is the first Mexican American and Hispanic senator from California, as well as the first male senator from California since Alan Cranston left office in 1993.<sup class=\"reference\" id=\"cite_ref-4\">[4]</sup><sup class=\"reference\" id=\"cite_ref-5\">[5]</sup>\n</p>]",
        "capital_summary": "Sacramento , Spanish for ''sacrament'') is the capital city of the U.S. state of California and the seat and largest city of Sacramento County. Located at the confluence of the Sacramento and American Rivers in Northern California's Sacramento Valley, Sacramento's 2020 population of 524,943 makes it the sixth-largest city in California and the ninth-largest capital in the United States. Sacramento is the seat of the California Legislature and the Governor of California, making it the state's political center and a hub for lobbying and think tanks. It features the California State Capitol Museum.\n",
        "full_name": "Alex Padilla",
        "img": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Alex_Padilla_117th_Congress_portrait.jpg"
    },
    "Michael_Bennet": {
        "handle": "SenBennetCO",
        "state": "Colorado",
        "capital_city": "Denver",
        "latitude": "39.739227",
        "longitude": "-104.984856",
        "wiki_html": "[<p><b>Michael Farrand Bennet</b> (born November 28, 1964) is an American businessman, lawyer, and politician serving as the senior United States senator from Colorado, a seat he has held since 2009. A member of the Democratic Party, he was appointed to the seat when Senator Ken Salazar became Secretary of the Interior. Bennet previously worked as a managing director for the Anschutz Investment Company, chief of staff to Denver mayor John Hickenlooper, and superintendent of Denver Public Schools.\n</p> <p>Bennet is the son of Douglas J. Bennet, a former State Department official and president of Wesleyan University. Early in his career, Bennet worked for Ohio governor Richard Celeste. He received a Juris Doctor degree from Yale Law School, worked as a law clerk, and was counsel to the U.S. Deputy Attorney General during the Bill Clinton administration.\n</p> <p>Bennet became superintendent of the Denver public school system in July 2005. In late 2008 it was speculated he would be a candidate for United States Secretary of Education under Barack Obama. He was appointed by Governor Bill Ritter to fill the U.S. Senate seat vacated by Ken Salazar when Salazar became Secretary of the Interior in January 2009. Bennet was elected in the 2010 Senate election, defeating Republican Ken Buck. He chaired the Democratic Senatorial Campaign Committee (DSCC) for the 2014 cycle<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> and was reelected to the Senate in 2016.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup>\n</p> <p>On May 2, 2019, Bennet announced his candidacy for the Democratic nomination for president of the United States.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup> He dropped out of the race on February 11, 2020 after a poor showing in the New Hampshire primary.<sup class=\"reference\" id=\"cite_ref-4\">[4]</sup>\n</p>]",
        "capital_summary": "Denver   is a consolidated city and county, the capital, and most populous city of the U.S. state of Colorado. Its population was 715,522 at the 2020 United States census, a 19.22% increase since the 2010 United States census. It is the 19th-most populous city in the United States and the fifth most populous state capital. It is the principal city of the Denver–Aurora–Lakewood, CO Metropolitan Statistical Area and the first city of the Front Range Urban Corridor.\n",
        "full_name": "Michael Bennet",
        "img": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Michael_Bennet_Official_Photo.jpg"
    },
    "John_Hickenlooper": {
        "handle": "SenCoryGardner",
        "state": "Colorado",
        "capital_city": "Denver",
        "latitude": "39.739227",
        "longitude": "-104.984856",
        "wiki_html": "[<p><b>John Wright Hickenlooper Jr.</b><sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'h' in 'hi'\">h</span><span title=\"/ɪ/: 'i' in 'kit'\">ɪ</span><span title=\"'k' in 'kind'\">k</span><span title=\"/ən/: 'on' in 'button'\">ən</span><span title=\"'l' in 'lie'\">l</span><span title=\"/uː/: 'oo' in 'goose'\">uː</span><span title=\"'p' in 'pie'\">p</span><span title=\"/ər/: 'er' in 'letter'\">ər</span></span>/</span></span>; born February 7, 1952) is an American politician, businessman, and geologist serving as the junior United States senator from Colorado since 2021. A member of the Democratic Party, Hickenlooper was mayor of Denver from 2003 to 2011 and governor of Colorado from 2011 to 2019.\n</p> <p>Born in Narberth, Pennsylvania, Hickenlooper is a graduate of Wesleyan University. After a career as a petroleum geologist, he co-founded the Wynkoop Brewing Company in Denver in 1988. Hickenlooper was elected the 43rd mayor of Denver in 2003, serving two terms. After incumbent governor Bill Ritter said that he would not seek reelection, Hickenlooper announced his intention to run for the Democratic nomination in January 2010. He won an uncontested primary and faced Constitution Party nominee Tom Tancredo and Republican Party nominee Dan Maes in the general election. Hickenlooper won with 51% of the vote and was reelected in 2014, defeating Republican Bob Beauprez.\n</p> <p>As governor, he introduced universal background checks and banned high-capacity magazines in the wake of the 2012 Aurora, Colorado shooting. He expanded Medicaid under the provisions of the Affordable Care Act, halving the rate of uninsured people in the state. Having initially opposed marijuana legalization, he has gradually come to support it.\n</p> <p>He sought the Democratic nomination for president of the United States in 2019 but dropped out before primaries were held. He subsequently ran for the U.S. Senate, winning the Democratic nomination and the general election, defeating incumbent Republican Cory Gardner.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> At 68, Hickenlooper became the oldest first-term senator to represent Colorado and the only Quaker member of Congress.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup>\n</p>]",
        "capital_summary": "Denver   is a consolidated city and county, the capital, and most populous city of the U.S. state of Colorado. Its population was 715,522 at the 2020 United States census, a 19.22% increase since the 2010 United States census. It is the 19th-most populous city in the United States and the fifth most populous state capital. It is the principal city of the Denver–Aurora–Lakewood, CO Metropolitan Statistical Area and the first city of the Front Range Urban Corridor.\n",
        "full_name": "John Hickenlooper",
        "img": "https://upload.wikimedia.org/wikipedia/commons/a/a8/John_Hickenlooper%2C_official_portrait%2C_117th_Congress.jpeg"
    },
    "Richard_Blumenthal": {
        "handle": "SenBlumenthal",
        "state": "Connecticut",
        "capital_city": "Hartford",
        "latitude": "41.764046",
        "longitude": "-72.682198",
        "wiki_html": "[<p><b>Richard Blumenthal</b><sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'b' in 'buy'\">b</span><span title=\"'l' in 'lie'\">l</span><span title=\"/uː/: 'oo' in 'goose'\">uː</span><span title=\"'m' in 'my'\">m</span><span title=\"/ə/: 'a' in 'about'\">ə</span><span title=\"'n' in 'nigh'\">n</span><span title=\"/θ/: 'th' in 'thigh'\">θ</span><span title=\"/ɔː/: 'au' in 'fraud'\">ɔː</span><span title=\"'l' in 'lie'\">l</span></span>/</span></span>; born February 13, 1946) is an American lawyer and politician who is the senior United States senator from Connecticut, a seat he has held since 2011. A member of the Democratic Party, he is one of the wealthiest members of the Senate,<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> with a net worth over $100 million.<sup class=\"reference\" id=\"cite_ref-Anand_3-0\">[3]</sup> He was Attorney General of Connecticut from 1991 to 2011.\n</p> <p>Born in Brooklyn, New York, Blumenthal attended Riverdale Country School, a private school in the Bronx. He graduated from Harvard College, where he was editor-in-chief of <i>The Harvard Crimson</i>. He studied for a year at Trinity College, Cambridge, in England before attending Yale Law School, where he was editor-in-chief of the <i>Yale Law Journal</i>. At Yale, he was a classmate of Bill and Hillary Clinton. From 1970 to 1976, Blumenthal served in the United States Marine Corps Reserve, attaining the rank of sergeant.\n</p> <p>After law school, Blumenthal passed the bar and served as administrative assistant and law clerk for several Washington, D.C. figures. From 1977 to 1981, he was United States Attorney for the District of Connecticut. In the early 1980s he worked in private law practice, including as volunteer counsel for the NAACP Legal Defense Fund.\n</p> <p>Blumenthal served one term in the Connecticut House of Representatives from 1985 to 1987; in 1986 he was elected to the Connecticut Senate and began service in 1987. He was elected Attorney General of Connecticut in 1990 and served for 20 years. During this period political observers speculated about him as a contender for governor of Connecticut, but he never pursued the office.\n</p> <p>Blumenthal announced his 2010 run for U.S. Senate after incumbent Senator Chris Dodd announced his retirement. He faced Linda McMahon, a professional wrestling magnate, in the 2010 election, winning with 55% of the vote. He was sworn in on January 5, 2011. After Joe Lieberman retired in 2013, Blumenthal became Connecticut's senior senator. He was reelected in 2016 with 63.2% of the vote, becoming the first person to receive more than a million votes in a statewide election in Connecticut.\n</p>]",
        "capital_summary": "Hartford is the capital city of the U.S. state of Connecticut. It was the seat of Hartford County until Connecticut disbanded county government in 1960. It is the core city in the Greater Hartford metropolitan area. Census estimates since the 2010 United States census have indicated that Hartford is the fourth-largest city in Connecticut with a 2020 population of 121,054, behind the coastal cities of Bridgeport, New Haven, and Stamford.\n",
        "full_name": "Richard Blumenthal",
        "img": "https://upload.wikimedia.org/wikipedia/commons/3/35/Richard_Blumenthal_Official_Portrait.jpg"
    },
    "Chris_Murphy": {
        "handle": "ChrisMurphyCT",
        "state": "Connecticut",
        "capital_city": "Hartford",
        "latitude": "41.764046",
        "longitude": "-72.682198",
        "wiki_html": "[<p><b>Christopher Scott Murphy</b> (born August 3, 1973) is an American lawyer, author, and politician serving as the junior United States senator from Connecticut since 2013. A member of the Democratic Party, he previously served in the United States House of Representatives, representing <span data-sort-value=\"Connecticut05 !\">Connecticut's 5th congressional district</span> from 2007 to 2013. Before being elected to Congress, Murphy was a member of both chambers of the Connecticut General Assembly, serving two terms each in the Connecticut House of Representatives (1999–2003) and the Connecticut Senate (2003–2007).\n</p> <p>Murphy ran for the U.S. Senate in 2012 after long-time incumbent Joe Lieberman announced in January 2011 that he would retire from politics rather than seeking a fifth term in office. He defeated former Connecticut secretary of state Susan Bysiewicz in the Democratic primary, and subsequently defeated Republican candidate Linda McMahon for the open seat in the general election. Aged 39 at the time, Murphy was the youngest senator of the 113th Congress.\n</p>]",
        "capital_summary": "Hartford is the capital city of the U.S. state of Connecticut. It was the seat of Hartford County until Connecticut disbanded county government in 1960. It is the core city in the Greater Hartford metropolitan area. Census estimates since the 2010 United States census have indicated that Hartford is the fourth-largest city in Connecticut with a 2020 population of 121,054, behind the coastal cities of Bridgeport, New Haven, and Stamford.\n",
        "full_name": "Chris Murphy",
        "img": "https://upload.wikimedia.org/wikipedia/commons/4/47/Chris_Murphy%2C_official_portrait%2C_113th_Congress_%28cropped%29.jpg"
    },
    "Tom_Carper": {
        "handle": "SenatorCarper",
        "state": "Delaware",
        "capital_city": "Dover",
        "latitude": "39.157307",
        "longitude": "-75.519722",
        "wiki_html": "[<p><img alt=\"United States Senate\" data-file-height=\"1030\" data-file-width=\"1030\" decoding=\"async\" height=\"40\" src=\"//upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Seal_of_the_United_States_Senate.svg/40px-Seal_of_the_United_States_Senate.svg.png\" srcset=\"//upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Seal_of_the_United_States_Senate.svg/60px-Seal_of_the_United_States_Senate.svg.png 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Seal_of_the_United_States_Senate.svg/80px-Seal_of_the_United_States_Senate.svg.png 2x\" width=\"40\"/>\n</p> <p><b>Thomas Richard Carper</b> (born January 23, 1947) is an American politician and former military officer serving as the senior United States senator from Delaware, having held the seat since 2001. A member of the Democratic Party, Carper served in the United States House of Representatives from 1983 to 1993 and was the 71st governor of Delaware from 1993 to 2001.\n</p> <p>A native of Beckley, West Virginia, Carper graduated from Ohio State University. Serving as a naval flight officer in the U.S. Navy from 1968 until 1973, he flew the P-3 Orion as a tactical coordinator and mission commander<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> and saw active duty in the Vietnam War. After leaving the active duty Navy, he remained in the U.S. Naval Reserve for another 18 years and eventually retired with the rank of Captain (O-6). Upon receiving his MBA from the University of Delaware in 1975, Carper went to work for the state of Delaware in its economic development office. He was elected state treasurer, serving from 1977 to 1983 and leading the development of Delaware's first cash management system.\n</p> <p>Encouraged by local politicians, Carper successfully ran for Delaware's only seat in the U.S. House of Representatives in 1982. He served five terms in the House, where he chaired the Subcommittee on Economic Stabilization. In 1992 he arranged a swap with term-limited Republican Governor Mike Castle, and the two were easily elected to each other's seats. Carper governed for two terms as a moderate, business-oriented New Democrat, following the lead of the two previous Republican governors.\n</p> <p>Carper was elected to the U.S. Senate in 2000, defeating Republican incumbent William Roth. He was reelected by landslides in 2006, 2012, and 2018. He serves as one of four deputy Democratic whips, the chairman of the Senate Environment and Public Works Committee and on the Homeland Security and Governmental Affairs Committee and the Finance Committee. Carper is the senior senator in Delaware's congressional delegation and the dean of the delegation. He is the last Vietnam War veteran to serve in the Senate.\n</p>]",
        "capital_summary": "Dover is the capital and second-largest city of the U.S. state of Delaware. It is also the county seat of Kent County and the principal city of the Dover, DE, Metropolitan Statistical Area, which encompasses all of Kent County and is part of the Philadelphia–Wilmington–Camden, Combined Statistical Area. It is located on the St. Jones River in the Delaware River coastal plain. It was named by William Penn for Dover in Kent, England (for which Kent County is named). As of 2010, the city had a population of 36,047.",
        "full_name": "Tom Carper",
        "img": "https://upload.wikimedia.org/wikipedia/commons/8/85/Tom_Carper%2C_official_portrait%2C_112th_Congress.jpg"
    },
    "Chris_Coons": {
        "handle": "ChrisCoons",
        "state": "Delaware",
        "capital_city": "Dover",
        "latitude": "39.157307",
        "longitude": "-75.519722",
        "wiki_html": "[<p><b>Christopher Andrew Coons</b> (born September 9, 1963) is an American lawyer and politician serving as the junior United States senator from Delaware since 2010. A member of the Democratic Party, Coons served as the county executive of New Castle County from 2005 to 2010.\n</p> <p>Raised in Hockessin, Delaware, Coons graduated from Amherst College in Massachusetts, where he joined Delta Kappa Epsilon Fraternity. He received graduate degrees from Yale Divinity School and Yale Law School. He went to work as a volunteer relief worker in Kenya, where he had taken classes in the University of Nairobi, later returning to the U.S. to work for the Coalition for the Homeless in New York. He spent some time as a legal clerk in New York before returning to Delaware in 1996, where he spent eight years as in-house counsel for a materials manufacturing company. In the interim he worked for several nonprofit organizations.\n</p> <p>Coons served as president of the New Castle County Council from 2001 to 2005 and county executive of New Castle County from 2005 to 2010. He balanced the county budget with a surplus in fiscal year 2010 by cutting spending and raising taxes, and the county maintained a AAA bond rating. Coons contested the 2010 Senate special election for Delaware. He defeated the Republican nominee, Christine O'Donnell, to succeed Ted Kaufman, who had been appointed to the seat when Joe Biden resigned to become Vice President of the United States. He was elected to a full term in 2014. Coons is the chair of the Senate Ethics Committee. His other committee assignments include Appropriations, Foreign Relations, Judiciary, and Small Business and Entrepreneurship. He previously served as ranking member of the Senate Foreign Relations Subcommittee on African Affairs and the Judiciary Subcommittee on Bankruptcy and the Courts.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup>\n</p> <p>Coons co-chaired the 2017 and 2019 National Prayer Breakfasts and co-chairs the weekly Senate Prayer Breakfast.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> <i>The New York Times</i> called him an \"effective\" emissary of Joe Biden to former and current Republican lawmakers in Biden's 2020 campaign for president.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup>\n</p>]",
        "capital_summary": "Dover is the capital and second-largest city of the U.S. state of Delaware. It is also the county seat of Kent County and the principal city of the Dover, DE, Metropolitan Statistical Area, which encompasses all of Kent County and is part of the Philadelphia–Wilmington–Camden, Combined Statistical Area. It is located on the St. Jones River in the Delaware River coastal plain. It was named by William Penn for Dover in Kent, England (for which Kent County is named). As of 2010, the city had a population of 36,047.",
        "full_name": "Chris Coons",
        "img": "https://upload.wikimedia.org/wikipedia/commons/5/56/Chris_Coons%2C_official_portrait%2C_112th_Congress.jpg"
    },
    "Marco_Rubio": {
        "handle": "marcorubio",
        "state": "Hawaii",
        "capital_city": "Honolulu",
        "latitude": "21.307442",
        "longitude": "-157.857376",
        "wiki_html": "[<p><b>Marco Antonio Rubio</b> (born May 28, 1971) is an American politician and lawyer serving as the senior United States senator from Florida, a seat he has held since 2011. A member of the Republican Party, he served as Speaker of the Florida House of Representatives from 2006 to 2008. Rubio unsuccessfully sought the Republican nomination for President of the United States in 2016, winning presidential primaries in Minnesota, the District of Columbia and Puerto Rico.\n</p> <p>Rubio is a Cuban American from Miami, Florida. After serving as a city commissioner for West Miami in the 1990s, he was elected to represent the 111th district in the Florida House of Representatives in 2000. Subsequently, he was elected speaker of the Florida House; he served for two years beginning in November 2006. Upon leaving the Florida Legislature in 2008 due to term limits, Rubio taught at Florida International University.\n</p> <p>Rubio was elected to the U.S. Senate in 2010. In April 2015, he decided to run for president instead of seeking reelection to the Senate. He suspended his campaign for the presidency on March 15, 2016, after losing the Florida Republican primary to the eventual winner of the presidential election, Donald Trump. He then decided to run for reelection to the Senate, winning a second term later that year. During the 2016 Republican presidential primary campaign in which Rubio and Trump were opponents, Rubio was critical of Trump. Rubio ultimately endorsed Trump before the 2016 general election and was largely supportive of Trump during his presidency. Due to his influence on U.S. policy on Latin America during the Trump Administration, he was described as a \"virtual secretary of state for Latin America.\"<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup>\n</p>]",
        "capital_summary": "Tallahassee is the capital city of the U.S. state of Florida. It is the county seat and only incorporated municipality in Leon County. Tallahassee became the capital of Florida, then the Florida Territory, in 1824. In 2020, the population was 196,169, making it the 8th-largest city in the U.S state of Florida, and the 126th-largest city in the United States. The population of the Tallahassee metropolitan area was 385,145 as of 2018. Tallahassee is the largest city in the Florida Big Bend and Florida Panhandle region, and the main center for trade and agriculture in the Florida Big Bend and Southwest Georgia regions.\n",
        "full_name": "Marco Rubio",
        "img": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Senator_Rubio_official_portrait.jpg"
    },
    "Rick_Scott": {
        "handle": "SenBillNelson",
        "state": "Hawaii",
        "capital_city": "Honolulu",
        "latitude": "21.307442",
        "longitude": "-157.857376",
        "wiki_html": "[<p><b>Richard Lynn Scott</b> (<span title=\"Name at birth\">né</span> <b>Myers</b>, born December 1, 1952) is an American politician and businessman serving as the junior United States senator from Florida since 2019.<sup class=\"reference\" id=\"cite_ref-jan8oath_5-0\">[4]</sup><sup class=\"reference\" id=\"cite_ref-swearing_in_delay_6-0\">[5]</sup> A member of the Republican Party, he was the 45th governor of Florida from 2011 to 2019.\n</p> <p>Scott is a graduate of the University of Missouri–Kansas City and the Dedman School of Law at Southern Methodist University. In 1987, after serving in the United States Navy and becoming a law firm partner, he co-founded Columbia Hospital Corporation. Columbia later merged with another corporation to form Columbia/HCA, which eventually became the nation's largest private for-profit health care company.<sup class=\"reference\" id=\"cite_ref-7\">[6]</sup> Scott was pressured to resign as chief executive of Columbia/HCA in 1997. During his tenure as chief executive, the company defrauded Medicare, Medicaid and other federal programs. The Department of Justice ultimately fined the company $1.7 billion in what was at the time the largest health care fraud settlement in U.S. history.<sup class=\"reference\" id=\"cite_ref-:20_8-0\">[7]</sup><sup class=\"reference\" id=\"cite_ref-fungus_9-0\">[8]</sup> Following his departure from Columbia/HCA, Scott became a venture capitalist and pursued other business interests. In 2009, he founded Conservatives for Patients' Rights.\n</p> <p>Scott ran for governor of Florida in 2010. He defeated Bill McCollum in a vigorously contested Republican primary election, and then narrowly defeated Democratic nominee Alex Sink in the general election.<sup class=\"reference\" id=\"cite_ref-Running_10-0\">[9]</sup> Scott was reelected in 2014, defeating former governor Charlie Crist. He was barred by term limits from running for reelection in 2018, and instead ran for the United States Senate.\n</p> <p>Scott won the 2018 US Senate election, defeating Democratic incumbent Bill Nelson. The initial election results were so close that they triggered a mandatory recount. The recount showed that Scott had won by 10,033 votes; Nelson then conceded the race. Scott took office following the expiration of his term as governor of Florida on January 8, 2019.\n</p> <p><br/></p> <p class=\"mw-empty-elt\">\n</p>]",
        "capital_summary": "Tallahassee is the capital city of the U.S. state of Florida. It is the county seat and only incorporated municipality in Leon County. Tallahassee became the capital of Florida, then the Florida Territory, in 1824. In 2020, the population was 196,169, making it the 8th-largest city in the U.S state of Florida, and the 126th-largest city in the United States. The population of the Tallahassee metropolitan area was 385,145 as of 2018. Tallahassee is the largest city in the Florida Big Bend and Florida Panhandle region, and the main center for trade and agriculture in the Florida Big Bend and Southwest Georgia regions.\n",
        "full_name": "Rick Scott",
        "img": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Official_Portrait_of_Senator_Rick_Scott_%28R-FL%29.jpg"
    },
    "Jon_Ossoff": {
        "handle": "SenDavidPerdue",
        "state": "Florida",
        "capital_city": "Tallahassee",
        "latitude": "30.438118",
        "longitude": "-84.281296",
        "wiki_html": "[<p><b>Thomas Jonathan  Ossoff</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"/ɒ/: 'o' in 'body'\">ɒ</span><span title=\"'s' in 'sigh'\">s</span><span title=\"/ɒ/: 'o' in 'body'\">ɒ</span><span title=\"'f' in 'find'\">f</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">OSS</span>-off</i>; born February 16, 1987) is an American politician serving as the senior United States senator from Georgia since 2021. A member of the Democratic Party, Ossoff was previously a documentary film producer and investigative journalist.\n</p> <p>Ossoff was the Democratic nominee in the 2017 special election for Georgia's 6th congressional district, which had long been considered a Republican stronghold. The special election proved competitive. It generated national attention, and became the most expensive House election in U.S. history. Ossoff narrowly lost the race to Karen Handel.\n</p> <p>In 2020, Ossoff won the Democratic nomination for the 2020 U.S. Senate election in Georgia to run against then-incumbent Republican senator David Perdue. Neither candidate reached the 50 percent threshold on the November 3 general election, triggering a runoff election on January 5, 2021, which Ossoff won. Ossoff serves alongside fellow Democrat Raphael Warnock, who defeated incumbent Republican Kelly Loeffler in the 2020 Senate special election runoff, also on January 5, 2021. The two races attracted significant national attention and spending, as they decided which party would control the Senate in the 117th Congress. With Warnock and Ossoff's victories, Democrats gained a majority in the Senate.\n</p> <p>With his victory, Ossoff became the youngest member of the Senate elected since Don Nickles in 1980 as well as the first Jewish member of the Senate from Georgia, the first Jewish senator from the Deep South since Benjamin F. Jonas of Louisiana, who was elected in 1878, and the first millennial United States senator. Warnock and Ossoff are the first Democrats to represent Georgia in the United States Senate since Zell Miller in 2005.\n</p>]",
        "capital_summary": "Tallahassee is the capital city of the U.S. state of Florida. It is the county seat and only incorporated municipality in Leon County. Tallahassee became the capital of Florida, then the Florida Territory, in 1824. In 2020, the population was 196,169, making it the 8th-largest city in the U.S state of Florida, and the 126th-largest city in the United States. The population of the Tallahassee metropolitan area was 385,145 as of 2018. Tallahassee is the largest city in the Florida Big Bend and Florida Panhandle region, and the main center for trade and agriculture in the Florida Big Bend and Southwest Georgia regions.",
        "full_name": "Jon Ossoff",
        "img": "https://upload.wikimedia.org/wikipedia/commons/9/97/Jon_Ossoff_Senate_Portrait_2021.jpg"
    },
    "Raphael_Warnock": {
        "handle": "SenatorIsakson",
        "state": "Florida",
        "capital_city": "Tallahassee",
        "latitude": "30.438118",
        "longitude": "-84.281296",
        "wiki_html": "[<p><b>Raphael Gamaliel Warnock</b> (born July 23, 1969) is an American pastor and politician serving as senior pastor of Ebenezer Baptist Church in Atlanta since 2005 and the junior United States senator from Georgia since 2021. A member of the Democratic Party, he assumed office on January 20, 2021.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup><sup class=\"reference\" id=\"cite_ref-when-sworn-in_2-0\">[2]</sup>\n</p> <p>Warnock was the senior pastor of Douglas Memorial Community Church until 2005, when he became senior pastor of Ebenezer Baptist Church in Atlanta. He came to prominence in Georgia politics as a leading activist in the campaign to expand Medicaid under the Affordable Care Act. Warnock defeated incumbent Kelly Loeffler in the runoff in Georgia's 2020–21 United States Senate special election on January 5, 2021. The same day, fellow Democrat Jon Ossoff won the runoff for Georgia's other Senate seat against Republican David Perdue.\n</p> <p>Warnock and Ossoff are the first Democrats elected to the U.S. Senate from Georgia since Zell Miller in 2000. Warnock is the first African American to represent Georgia in the Senate and the first black Democrat to be elected to the Senate by a former state of the Confederacy.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup>\n</p>]",
        "capital_summary": "Tallahassee is the capital city of the U.S. state of Florida. It is the county seat and only incorporated municipality in Leon County. Tallahassee became the capital of Florida, then the Florida Territory, in 1824. In 2020, the population was 196,169, making it the 8th-largest city in the U.S state of Florida, and the 126th-largest city in the United States. The population of the Tallahassee metropolitan area was 385,145 as of 2018. Tallahassee is the largest city in the Florida Big Bend and Florida Panhandle region, and the main center for trade and agriculture in the Florida Big Bend and Southwest Georgia regions.",
        "full_name": "Raphael Warnock",
        "img": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Raphael_Warnock_official_photo.jpg"
    },
    "Brian_Schatz": {
        "handle": "brianschatz",
        "state": "Georgia",
        "capital_city": "Atlanta",
        "latitude": "33.749027",
        "longitude": "-84.388229",
        "wiki_html": "[<p><b>Brian Emanuel Schatz</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ʃ/: 'sh' in 'shy'\">ʃ</span><span title=\"/ɑː/: 'a' in 'father'\">ɑː</span><span title=\"'t' in 'tie'\">t</span><span title=\"'s' in 'sigh'\">s</span></span>/</span></span>; born October 20, 1972) is an American educator and politician serving as the senior United States senator from Hawaii, a seat he has held since 2012. Governor Neil Abercrombie appointed Schatz to replace Senator Daniel Inouye after Inouye's death.\n</p> <p>Schatz served in the Hawaii House of Representatives from 1998 to 2006, representing the 25th legislative district, and was chairman of the Democratic Party of Hawaii from 2008 to 2010. He also worked as chief executive officer of Helping Hands Hawaii, an Oahu nonprofit social service agency, until he resigned to run for lieutenant governor of Hawaii in the 2010 gubernatorial election as Abercrombie's running mate.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> He served as lieutenant governor until December 26, 2012, when Abercrombie appointed him to serve the rest of Daniel Inouye's U.S. Senate term after Inouye's death.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> Schatz was the youngest U.S. senator in the 112th Congress. He won the 2014 special election to complete the remainder of Inouye's Senate term, and was reelected in 2016 to a full six-year term, defeating Republican John Carroll.\n</p>]",
        "capital_summary": "Honolulu is the capital and largest city of the U.S. state of Hawaii, which is located in the Pacific Ocean. It is an unincorporated county seat of the consolidated City and County of Honolulu, situated along the southeast coast of the island of Oʻahu, and is the westernmost and southernmost major U.S. city. Honolulu is Hawaii's main gateway to the world. It is also a major hub for international business, finance, hospitality, and military defense in both the state and Oceania. The city is characterized by a mix of various Asian, Western, and Pacific cultures, as reflected in its diverse demography, cuisine, and traditions.\n",
        "full_name": "Brian Schatz",
        "img": "https://upload.wikimedia.org/wikipedia/commons/2/27/Brian_Schatz%2C_official_portrait%2C_113th_Congress_2.jpg"
    },
    "Mazie_Hirono": {
        "handle": "maziehirono",
        "state": "Georgia",
        "capital_city": "Atlanta",
        "latitude": "33.749027",
        "longitude": "-84.388229",
        "wiki_html": "[<p><b>Mazie Keiko Hirono</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'m' in 'my'\">m</span><span title=\"/eɪ/: 'a' in 'face'\">eɪ</span><span title=\"'z' in 'zoom'\">z</span><span title=\"/i/: 'y' in 'happy'\">i</span></span><span class=\"wrap\"> </span><span style=\"border-bottom:1px dotted\"><span title=\"'h' in 'hi'\">h</span><span title=\"/i/: 'y' in 'happy'\">i</span><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'r' in 'rye'\">r</span><span title=\"/oʊ/: 'o' in 'code'\">oʊ</span><span title=\"'n' in 'nigh'\">n</span><span title=\"/oʊ/: 'o' in 'code'\">oʊ</span></span>/</span></span>; Japanese name: <span lang=\"ja\">広野 慶子</span>, <span title=\"Japanese-language text\"><i lang=\"ja-Latn\">Hirono Keiko</i></span>; born November 3, 1947) is an American lawyer and politician serving as the junior United States senator from Hawaii since 2013. She is a member of the Democratic Party. Hirono served as a member of the Hawaii House of Representatives from 1981 to 1995 and as Hawaii's ninth lieutenant governor from 1994 to 2002, under Ben Cayetano. The Democratic nominee for governor of Hawaii in 2002, Hirono was defeated by Republican Linda Lingle. From 2007 to 2013, she served as a member of the United States House of Representatives for Hawaii's 2nd congressional district.\n</p> <p>Hirono is the first elected female senator from Hawaii, the first Asian-American woman elected to the Senate, the first U.S. senator born in Japan, and the nation's first Buddhist senator. She considers herself a non-practicing Buddhist<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup><sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> and is often cited with Hank Johnson as the first Buddhist to serve in the United States Congress.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup> She is also the third woman to be elected to Congress from Hawaii (after Patsy Mink and Pat Saiki).\n</p> <p>In 2012, Hirono was the Democratic nominee for the U.S. Senate seat being vacated by the retirement of Daniel Akaka. Hirono won the election, defeating Lingle in a landslide, 63% to 37%. She was sworn in on January 3, 2013, by Vice President Joe Biden. Hirono was the only person of Asian ancestry serving in the U.S. Senate from 2013 until 2017, when senators Tammy Duckworth and Kamala Harris were sworn in, representing Illinois and California, respectively. Although Brian Schatz joined the Senate a week before Hirono, following the death of Daniel Inouye, making him Hawaii's senior senator, Hirono's three terms in the U.S. House of Representatives make her the dean, or longest-serving member overall, of Hawaii's congressional delegation.\n</p>]",
        "capital_summary": "Honolulu is the capital and largest city of the U.S. state of Hawaii, which is located in the Pacific Ocean. It is an unincorporated county seat of the consolidated City and County of Honolulu, situated along the southeast coast of the island of Oʻahu, and is the westernmost and southernmost major U.S. city. Honolulu is Hawaii's main gateway to the world. It is also a major hub for international business, finance, hospitality, and military defense in both the state and Oceania. The city is characterized by a mix of various Asian, Western, and Pacific cultures, as reflected in its diverse demography, cuisine, and traditions.\n",
        "full_name": "Mazie Hirono",
        "img": "https://upload.wikimedia.org/wikipedia/commons/2/24/Mazie_Hirono%2C_official_portrait%2C_113th_Congress.jpg"
    },
    "Mike_Crapo": {
        "handle": "MikeCrapo",
        "state": "Idaho",
        "capital_city": "Boise",
        "latitude": "43.617775",
        "longitude": "-116.199722",
        "wiki_html": "[<p><b>Michael Dean Crapo</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'k' in 'kind'\">k</span><span title=\"'r' in 'rye'\">r</span><span title=\"/eɪ/: 'a' in 'face'\">eɪ</span><span title=\"'p' in 'pie'\">p</span><span title=\"/oʊ/: 'o' in 'code'\">oʊ</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">KRAY</span>-poh</i>; born May 20, 1951) is an American lawyer and politician serving as the senior United States senator from Idaho, a seat he has held since 1999. A Republican, he was the U.S. representative for Idaho's 2nd congressional district from 1993 to 1999.\n</p> <p>Born in Idaho Falls, Crapo is a graduate of Brigham Young University and Harvard Law School. He practiced law in his home city throughout the 1980s, while also maintaining an active role in local Republican politics. His brother Terry Crapo was majority leader in the Idaho House of Representatives from 1968 to 1972 and an influential political figure until his death from leukemia in 1982. After his brother's death, Crapo was elected to the Idaho Senate in 1984. He served as Senate president pro tempore from 1988 to 1992.\n</p> <p>Crapo was elected to an open seat in Congress in 1992, representing Idaho's 2nd congressional district in the House of Representatives. After three terms in the House, he ran for the open seat in the U.S. Senate in 1998 when Dirk Kempthorne vacated it to run for Idaho governor. Crapo was elected with 70% of the vote, and became the first Mormon to represent Idaho in the Senate.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> In 2004, he defeated his only opponent, write-in Democratic candidate Scott McClure, with 99% of the vote. He was reelected in 2010 with 71% of the vote, and in 2016 with 66% of the vote.\n</p>]",
        "capital_summary": "Boise is the capital and most populous city of the U.S. state of Idaho and is the county seat of Ada County. On the Boise River in southwestern Idaho, it is 41 miles  east of the Oregon border and 110 miles  north of the Nevada border. The downtown area's elevation is 2,704 feet  above sea level. The population according to the 2020 US Census was 235,684.\n",
        "full_name": "Mike Crapo",
        "img": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Mike_Crapo_2019_%28looser_crop%29.jpg"
    },
    "Jim_Risch": {
        "handle": "SenatorRisch",
        "state": "Idaho",
        "capital_city": "Boise",
        "latitude": "43.617775",
        "longitude": "-116.199722",
        "wiki_html": "[<p><b>James Elroy Risch</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'r' in 'rye'\">r</span><span title=\"/ɪ/: 'i' in 'kit'\">ɪ</span><span title=\"/ʃ/: 'sh' in 'shy'\">ʃ</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">RISH</span></i>; born May 3, 1943) is an American lawyer and politician who has served as the junior United States senator from Idaho since 2009.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> A member of the Republican Party, he served as lieutenant governor of Idaho from 2003 to 2006 and from 2007 to 2009, and as governor of Idaho from 2006 to 2007.\n</p> <p>Prior to his career in politics, Risch was a prosecuting attorney and taught criminal law at Boise State University.\n</p>]",
        "capital_summary": "Boise is the capital and most populous city of the U.S. state of Idaho and is the county seat of Ada County. On the Boise River in southwestern Idaho, it is 41 miles  east of the Oregon border and 110 miles  north of the Nevada border. The downtown area's elevation is 2,704 feet  above sea level. The population according to the 2020 US Census was 235,684.\n",
        "full_name": "Jim Risch",
        "img": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Jim_Risch_official_portrait.jpg"
    },
    "Dick_Durbin": {
        "handle": "SenatorDurbin",
        "state": "Illinois",
        "capital_city": "Springfield",
        "latitude": "39.798363",
        "longitude": "-89.654961",
        "wiki_html": "[<p><b>Richard Joseph Durbin</b> (born November 21, 1944) is an American politician and lawyer serving as the senior United States senator from Illinois, a seat he has held since 1997. He has been Senate Democratic whip since 2005, the second-highest position in the Democratic leadership in the Senate, and Senate majority whip since 2021. He chairs the Senate Judiciary Committee.<sup class=\"reference\" id=\"cite_ref-3\">[2]</sup> Durbin led the U.S. Supreme Court confirmation hearings for Ketanji Brown Jackson.\n</p> <p>Durbin was born in East St. Louis, Illinois. He graduated from the School of Foreign Service and Georgetown University Law Center. Working in state legal counsel throughout the 1970s, he made an unsuccessful run for lieutenant governor of Illinois in 1978. Durbin was elected to the U.S. House of Representatives in 1982, representing the Springfield-based 20th congressional district. He was elected to the U.S. Senate in 1996 and reelected in 2002, 2008, 2014, and 2020. Durbin has served as the Senate Democratic whip since 2005, from 2007 to 2015, and in the 117th Congress serves as the Senate majority whip. He is the dean of Illinois's congressional delegation.\n</p> <p><br/></p> <p class=\"mw-empty-elt\">\n</p>]",
        "capital_summary": "Springfield is the capital of the U.S. state of Illinois and the county seat and largest city of Sangamon County. The city's population was 116,250 at the 2010 U.S. Census, which makes it the state's sixth most-populous city, the second largest outside of the Chicago metropolitan area , and the largest in central Illinois. As of 2019, the city's population was estimated to have decreased to 114,230, with just over 211,700 residents living in the Springfield Metropolitan Statistical Area, which includes Sangamon County and the adjacent Menard County.\n",
        "full_name": "Dick Durbin",
        "img": "https://upload.wikimedia.org/wikipedia/commons/5/50/Dick_Durbin_October_2017_%28cropped%29.jpg"
    },
    "Tammy_Duckworth": {
        "handle": "SenDuckworth",
        "state": "Illinois",
        "capital_city": "Springfield",
        "latitude": "39.798363",
        "longitude": "-89.654961",
        "wiki_html": "[<p><b>Ladda Tammy Duckworth</b><sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> (born March 12, 1968) is an American politician and retired Army National Guard lieutenant colonel serving as the junior United States senator from Illinois since 2017. A member of the Democratic Party, she represented Illinois's 8th congressional district in the United States House of Representatives from 2013 to 2017.\n</p> <p>Duckworth was educated at the University of Hawaii at Manoa and George Washington University. A combat veteran of the Iraq War, she served as a U.S. Army helicopter pilot. In 2004, when her helicopter was hit by a rocket-propelled grenade fired by Iraqi insurgents, she lost both legs and some mobility in her right arm. She was the first female double amputee from the war.<sup class=\"reference\" id=\"cite_ref-HuffPOWar_3-0\">[3]</sup> Despite her injuries, she sought and obtained a medical waiver that allowed her to continue serving in the Illinois Army National Guard until she retired as a lieutenant colonel in 2014.\n</p> <p>Duckworth ran unsuccessfully for a seat in the United States House of Representatives in 2006, then served as director of the Illinois Department of Veterans Affairs from 2006 to 2009 and as assistant secretary for public and intergovernmental affairs at the United States Department of Veterans Affairs from 2009 to 2011. In 2012, Duckworth was elected to the U.S. House of Representatives, where she served two terms. Duckworth was elected to the U.S. Senate in 2016, defeating Republican incumbent Mark Kirk.<sup class=\"reference\" id=\"cite_ref-huffpo1108_4-0\">[4]</sup> She is the first Thai American woman elected to Congress, the first person born in Thailand elected to Congress, the first woman with a disability elected to Congress, the first female double amputee in the Senate, and the first senator to give birth while in office. Duckworth is the second of three Asian American women to serve in the U.S. Senate, after Mazie Hirono, and before Kamala Harris.\n</p>]",
        "capital_summary": "Springfield is the capital of the U.S. state of Illinois and the county seat and largest city of Sangamon County. The city's population was 116,250 at the 2010 U.S. Census, which makes it the state's sixth most-populous city, the second largest outside of the Chicago metropolitan area , and the largest in central Illinois. As of 2019, the city's population was estimated to have decreased to 114,230, with just over 211,700 residents living in the Springfield Metropolitan Statistical Area, which includes Sangamon County and the adjacent Menard County.\n",
        "full_name": "Tammy Duckworth",
        "img": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Tammy_Duckworth%2C_official_portrait%2C_115th_Congress.jpg"
    },
    "Todd_Young": {
        "handle": "SenToddYoung",
        "state": "Indiana",
        "capital_city": "Indianapolis",
        "latitude": "39.768623",
        "longitude": "-86.162643",
        "wiki_html": "[<p><b>Todd Christopher Young</b> (born August 24, 1972) is an American lawyer and politician serving as the senior United States senator for Indiana, a seat he has held since 2017. From 2011 to 2017, he was the U.S. representative for <span data-sort-value=\"Indiana09 !\">Indiana's 9th congressional district</span>. Young is a member of the Republican Party. He was elected to the United States Senate in the November 8, 2016, general election, succeeding retiring Republican Dan Coats. From 2019 to 2021, he served as the chair of the National Republican Senatorial Committee.\n</p>]",
        "capital_summary": "Indianapolis, colloquially known as Indy, is the state capital and most-populous city of the U.S. state of Indiana and the seat of Marion County. According to the United States Census Bureau, the consolidated population of Indianapolis and Marion County in 2020 was 977,642. The \"balance\" population, which excludes semi-autonomous municipalities in Marion County, was 887,642. It is the 15th most populous city in the U.S., the third-most populous city in the Midwest, after Chicago, Illinois and Columbus, Ohio, and the fourth-most populous state capital after Phoenix, Arizona, Austin, Texas, and Columbus. The Indianapolis metropolitan area is the 33rd most populous metropolitan statistical area in the U.S., with 2,048,703 residents. Its combined statistical area ranks 28th, with a population of 2,431,361. Indianapolis covers 368 square miles , making it the 18th largest city by land area in the U.S.\n",
        "full_name": "Todd Young",
        "img": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Sen._Todd_Young_official_photo.jpg"
    },
    "Mike_Braun": {
        "handle": "SenDonnelly",
        "state": "Indiana",
        "capital_city": "Indianapolis",
        "latitude": "39.768623",
        "longitude": "-86.162643",
        "wiki_html": "[<p><b>Michael K. Braun</b><sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'b' in 'buy'\">b</span><span title=\"'r' in 'rye'\">r</span><span title=\"/ɔː/: 'au' in 'fraud'\">ɔː</span><span title=\"'n' in 'nigh'\">n</span></span>/</span></span>; born March 24, 1954) is an American businessman and politician serving as the junior United States senator from Indiana. Previously, he represented the 63rd district in the Indiana House of Representatives from 2014 to 2017. A member of the Republican Party, Braun was elected to the United States Senate in 2018, defeating Democratic incumbent Joe Donnelly.<sup class=\"reference\" id=\"cite_ref-auto_3-0\">[3]</sup>\n</p> <p>Braun opposes the Affordable Care Act, same-sex marriage, abortion, and a pathway to citizenship for undocumented immigrants. He describes himself as a \"conservationist\" who has called on the Republican Party to take climate change more seriously, but is ranked very poorly by environmental groups, and supported the United States' withdrawal from the Paris Climate Accords. He supported President Donald Trump's trade and tariff policies despite having previously been a free trade advocate, and was a staunch ally of Trump throughout his presidency. Braun voted to acquit Trump in the impeachment trial related to the Trump-Ukraine scandal. After Joe Biden won the 2020 presidential election and Trump refused to concede, making false claims of fraud, Braun defended Trump's efforts to overturn the election results.\n</p>]",
        "capital_summary": "Indianapolis, colloquially known as Indy, is the state capital and most-populous city of the U.S. state of Indiana and the seat of Marion County. According to the United States Census Bureau, the consolidated population of Indianapolis and Marion County in 2020 was 977,642. The \"balance\" population, which excludes semi-autonomous municipalities in Marion County, was 887,642. It is the 15th most populous city in the U.S., the third-most populous city in the Midwest, after Chicago, Illinois and Columbus, Ohio, and the fourth-most populous state capital after Phoenix, Arizona, Austin, Texas, and Columbus. The Indianapolis metropolitan area is the 33rd most populous metropolitan statistical area in the U.S., with 2,048,703 residents. Its combined statistical area ranks 28th, with a population of 2,431,361. Indianapolis covers 368 square miles , making it the 18th largest city by land area in the U.S.\n",
        "full_name": "Mike Braun",
        "img": "https://upload.wikimedia.org/wikipedia/commons/2/25/Mike_Braun%2C_Official_Portrait%2C_116th_Congress.jpg"
    },
    "Chuck_Grassley": {
        "handle": "ChuckGrassley",
        "state": "Iowa",
        "capital_city": "Des Moines",
        "latitude": "41.591087",
        "longitude": "-93.603729",
        "wiki_html": "[<p><b>Charles Ernest Grassley</b> (born September 17, 1933) is an American politician serving as the president pro tempore emeritus of the United States Senate, and the senior United States senator from Iowa, having held the seat since 1981. He is in his seventh Senate term, having first been elected in 1980.\n</p> <p>A member of the Republican Party, Grassley served eight terms in the Iowa House of Representatives (1959–1975) and three terms in the United States House of Representatives (1975–1981). He has served three stints as Senate Finance Committee chairman during periods of Republican Senate majority.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup><sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> When Orrin Hatch's Senate term ended on January 3, 2019 following his retirement, Grassley became the most senior Republican in the Senate and its president pro tempore.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup><sup class=\"reference\" id=\"cite_ref-4\">[4]</sup>\n</p> <p>During his four decades in the Senate, Grassley has chaired the Senate Finance Committee, the Senate Narcotics Committee, the Senate Judiciary Committee, and the Senate Aging Committee.\n</p>]",
        "capital_summary": "Des Moines is the capital and the most populous city in the U.S. state of Iowa. It is also the county seat of Polk County. A small part of the city extends into Warren County. It was incorporated on September 22, 1851, as Fort Des Moines, which was shortened to \"Des Moines\" in 1857. It is located on, and named after, the Des Moines River, which likely was adapted from the early French name, Rivière des Moines, meaning \"River of the Monks\". The city's population was 214,133 as of the 2020 census. The six-county metropolitan area is ranked 83rd in terms of population in the United States with 699,292 residents according to the 2019 estimate by the United States Census Bureau, and is the largest metropolitan area fully located within the state. A portion of the larger Omaha, Nebraska, metropolitan area extends into three counties of southwest Iowa.\n",
        "full_name": "Chuck Grassley",
        "img": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Chuck_Grassley_official_photo_2017.jpg"
    },
    "Joni_Ernst": {
        "handle": "joniernst",
        "state": "Iowa",
        "capital_city": "Des Moines",
        "latitude": "41.591087",
        "longitude": "-93.603729",
        "wiki_html": "[<p><b>Joni Kay Ernst</b> (née <b>Culver</b>; born July 1, 1970)<sup class=\"reference\" id=\"cite_ref-Iowa_State_University_6-0\">[6]</sup> is an American politician and former military officer serving as the junior United States senator for Iowa, a seat she has held since 2015.<sup class=\"reference\" id=\"cite_ref-7\">[7]</sup> A member of the Republican Party, she served in the Iowa State Senate from 2011 to 2014 and as auditor of Montgomery County from 2004 to 2008.\n</p> <p>After graduating from Iowa State University, Ernst joined the United States Army Reserve.<sup class=\"reference\" id=\"cite_ref-abcnews.go.com_4-1\">[4]</sup> She served in the Iowa Army National Guard from 1993 to 2015, retiring as a lieutenant colonel.<sup class=\"reference\" id=\"cite_ref-retired_5-1\">[5]</sup> During the Iraq War, she served as the commanding officer of the 185th Combat Sustainment Support Battalion at Camp Dodge, the Iowa Army National Guard's largest battalion.<sup class=\"reference\" id=\"cite_ref-20101118IR_8-0\">[8]</sup><sup class=\"reference\" id=\"cite_ref-JoniErnst_9-0\">[9]</sup><sup class=\"reference\" id=\"cite_ref-votesmart_10-0\">[10]</sup><sup class=\"reference\" id=\"cite_ref-:3_11-0\">[11]</sup><sup class=\"reference\" id=\"cite_ref-:4_12-0\">[12]</sup><sup class=\"reference\" id=\"cite_ref-:5_13-0\">[13]</sup> Ernst also holds a Master of Public Administration from Columbus State University.<sup class=\"reference\" id=\"cite_ref-PlazaOfHeroines_14-0\">[14]</sup><sup class=\"reference\" id=\"cite_ref-20101118IR_8-1\">[8]</sup>\n</p> <p>In 2004, Ernst was elected Montgomery County Auditor. She was reelected in 2008.<sup class=\"reference\" id=\"cite_ref-20101118IR_8-2\">[8]</sup><sup class=\"reference\" id=\"cite_ref-:6_15-0\">[15]</sup> In 2011, Ernst was elected to the Iowa State Senate in a special election and reelected in 2012. She represented District 12, in southwestern Iowa.<sup class=\"reference\" id=\"cite_ref-JoniErnst_9-1\">[9]</sup><sup class=\"reference\" id=\"cite_ref-votesmart_10-1\">[10]</sup><sup class=\"reference\" id=\"cite_ref-:7_16-0\">[16]</sup><sup class=\"reference\" id=\"cite_ref-JoniErnstBio_17-0\">[17]</sup> Ernst ran for the United States Senate in 2014 and won, succeeding longtime Democratic Senator Tom Harkin and becoming the first Republican to win that seat since 1978. Having been strongly critical of President Barack Obama, she has been characterized as a reliable ally of President Donald Trump, and was thought to be a possible running mate in his 2016 campaign. Ernst was elected vice chair of the Senate Republican Conference in November 2018.<sup class=\"reference\" id=\"cite_ref-:8_18-0\">[18]</sup> She was reelected in 2020, defeating Democratic nominee Theresa Greenfield by 6.6 points.<sup class=\"reference\" id=\"cite_ref-19\">[19]</sup>\n</p> <p>Ernst opposes legalized abortion, and has supported a fetal personhood amendment and introduced legislation to defund Planned Parenthood. She opposes the Affordable Care Act and has called for reforms to Medicare, Medicaid, and Social Security. During the Trump administration, she expressed concern about, although not opposition to, Trump's trade war with China and criticized some aspects of his foreign policy. Ernst voted for the Tax Cuts and Jobs Act. While supporting both Trump's nominees for EPA administrator, she expressed concern over their commitment to the Renewable Fuel Standard. She rejects the scientific consensus on climate change. Ernst has opposed a federal minimum wage and advocated for the elimination of federal departments such as the Internal Revenue Service, Department of Education and the Environmental Protection Agency.\n</p>]",
        "capital_summary": "Des Moines is the capital and the most populous city in the U.S. state of Iowa. It is also the county seat of Polk County. A small part of the city extends into Warren County. It was incorporated on September 22, 1851, as Fort Des Moines, which was shortened to \"Des Moines\" in 1857. It is located on, and named after, the Des Moines River, which likely was adapted from the early French name, Rivière des Moines, meaning \"River of the Monks\". The city's population was 214,133 as of the 2020 census. The six-county metropolitan area is ranked 83rd in terms of population in the United States with 699,292 residents according to the 2019 estimate by the United States Census Bureau, and is the largest metropolitan area fully located within the state. A portion of the larger Omaha, Nebraska, metropolitan area extends into three counties of southwest Iowa.\n",
        "full_name": "Joni Ernst",
        "img": "https://upload.wikimedia.org/wikipedia/commons/7/74/Joni_Ernst%2C_official_portrait%2C_116th_Congress_3.jpg"
    },
    "Jerry_Moran": {
        "handle": "JerryMoran",
        "state": "Kansas",
        "capital_city": "Topeka",
        "latitude": "39.048191",
        "longitude": "-95.677956",
        "wiki_html": "[<p><b>Gerald Wesley Moran</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"'m' in 'my'\">m</span><span title=\"/ʌ/: 'u' in 'cut'\">ʌ</span><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'r' in 'rye'\">r</span><span title=\"/æ/: 'a' in 'bad'\">æ</span><span title=\"'n' in 'nigh'\">n</span></span>/</span></span> <i title=\"English pronunciation respelling\">mur-<span style=\"font-size:90%\">RAN</span></i>; born May 29, 1954) is an American lawyer and politician who is the senior United States senator from Kansas, a seat he has held since 2011. A member of the Republican Party, he was chair of the National Republican Senatorial Committee for the 113th U.S. Congress, during which he led successful Republican efforts in the 2014 election, producing the first Republican Senate majority since 2006.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> Previously, he was a member of the United States House of Representatives, representing <span data-sort-value=\"Kansas01 !\">Kansas's 1st congressional district</span>.\n</p> <p>Raised in Plainville, Kansas, Moran graduated from the University of Kansas and the University of Kansas School of Law. He worked in private law and was the state special assistant attorney general (1982–85) and deputy attorney of Rooks County (1987–95). He served in the Kansas Senate from 1989 to 1997 and was majority leader for his last two years. He was elected to the House of Representatives in 1996 and spent seven terms there with little electoral opposition. He was elected to the U.S. Senate in 2010 after defeating fellow U.S. Representative Todd Tiahrt in a contentious primary. He was reelected to the Senate in 2016.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup>\n</p> <p>Moran became the senior senator and dean of the Kansas congressional delegation in 2021 when Pat Roberts retired from the Senate.\n</p>]",
        "capital_summary": "Topeka is the capital city of the U.S. state of Kansas and the seat of Shawnee County. It is along the Kansas River in the central part of Shawnee County, in northeast Kansas, in the Central United States. As of the 2020 census, the population of the city was 126,587. The Topeka metropolitan statistical area, which includes Shawnee, Jackson, Jefferson, Osage, and Wabaunsee Counties, had a population of 233,870 in the 2010 census.",
        "full_name": "Jerry Moran",
        "img": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Jerry_Moran%2C_official_portrait%2C_112th_Congress.jpg"
    },
    "Roger_Marshall_(politician)": {
        "handle": "SenPatRoberts",
        "state": "Kansas",
        "capital_city": "Topeka",
        "latitude": "39.048191",
        "longitude": "-95.677956",
        "wiki_html": "[<p><b>Roger Wayne Marshall</b> (born August 9, 1960) is an American politician, physician, and former military officer serving as the junior United States senator from Kansas since 2021. A member of the Republican Party, he served from 2017 to 2021 as the U.S. representative for <span data-sort-value=\"Kansas01 !\">Kansas's 1st congressional district</span>, a mostly rural district covering much of the western and northern parts of the state.\n</p> <p>An obstetrician, Marshall was first elected to Congress in 2016, defeating incumbent Tim Huelskamp in the Republican primary for <span data-sort-value=\"Kansas01 !\">Kansas's 1st congressional district</span>. On September 7, 2019, he announced his bid for the United States Senate in the 2020 election; he sought the seat being vacated by Pat Roberts. Marshall won the August 4 Republican primary and was elected on November 3, defeating Democratic nominee Barbara Bollier. Marshall was sworn in on January 3, 2021.\n</p> <p>On January 6, 2021, Marshall joined a group of Republican senators led by Josh Hawley and Ted Cruz in support of the objections to Pennsylvania's and Arizona's electoral votes, both of which were overwhelmingly rejected by the Senate, 92–7 and 93–6 respectively.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup><sup class=\"reference\" id=\"cite_ref-2\">[2]</sup><sup class=\"reference\" id=\"cite_ref-3\">[3]</sup>\n</p>]",
        "capital_summary": "Topeka is the capital city of the U.S. state of Kansas and the seat of Shawnee County. It is along the Kansas River in the central part of Shawnee County, in northeast Kansas, in the Central United States. As of the 2020 census, the population of the city was 126,587. The Topeka metropolitan statistical area, which includes Shawnee, Jackson, Jefferson, Osage, and Wabaunsee Counties, had a population of 233,870 in the 2010 census.",
        "full_name": "Roger Marshall (politician)",
        "img": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Roger_Marshall_117th_Congress_portrait.jpg"
    },
    "Mitch_McConnell": {
        "handle": "LeaderMcConnell",
        "state": "Kentucky",
        "capital_city": "Frankfort",
        "latitude": "38.186722",
        "longitude": "-84.875374",
        "wiki_html": "[<p><b>Addison Mitchell McConnell III</b><sup class=\"reference\" id=\"cite_ref-memoir1_1-0\">[1]</sup> (born February 20, 1942) is an American politician and retired attorney serving as Senate minority leader since 2021 and as the senior United States senator from Kentucky, a seat he has held since 1985. A member of the Republican Party, he previously served as Senate majority leader from 2015 to 2021, and as minority leader from 2007 to 2015.\n</p> <p>McConnell was first elected to the U.S. Senate in 1984 and is the second Kentuckian to serve as a party leader in the Senate.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> During the 1998 and 2000 election cycles, he was chairman of the National Republican Senatorial Committee. He was elected Majority Whip in the 108th Congress and re-elected to the post in 2004. In November 2006 he was elected Senate minority leader – the post he held until Republicans took control of the Senate in 2015.\n</p> <p>McConnell holds conservative political positions, although he was known as a pragmatist and a moderate Republican early in his political career. He led opposition to stricter campaign finance laws, culminating in the Supreme Court ruling <i>Citizens United v. FEC</i> that partially overturned the Bipartisan Campaign Reform Act (McCain-Feingold) in 2010. McConnell worked to withhold Republican support for major presidential initiatives during the Obama administration, having made frequent use of the filibuster, and blocked many of President Barack Obama's judicial nominees, including Supreme Court nominee Merrick Garland. During the Trump administration, the Senate Republican majority under his leadership confirmed a record number of federal appeals court judges during a president's first two years and won confirmation battles on Neil Gorsuch, Brett Kavanaugh and Amy Coney Barrett for the U.S. Supreme Court. While supportive of many of Trump's policies, McConnell was critical of Trump's attempts to overturn the 2020 presidential election, and despite voting to acquit on Trump's second impeachment trial on reasons related to the constitutionality of impeaching a former president, deemed him \"practically and morally responsible\" for the 2021 United States Capitol attack.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup>\n</p> <p>McConnell is married to former secretary of transportation and former secretary of labor Elaine Chao. In 2015 and 2019, <i>Time</i> listed McConnell as one of the 100 most influential people in the world.<sup class=\"reference\" id=\"cite_ref-Boehner_4-0\">[4]</sup><sup class=\"reference\" id=\"cite_ref-auto_5-0\">[5]</sup>\n</p>]",
        "capital_summary": "Frankfort is the capital city of the Commonwealth of Kentucky and the seat of Franklin County.  It is a home rule-class city in Kentucky; the population was 28,602 at the 2020 census. Located along the Kentucky River, Frankfort is the principal city of the Frankfort, Kentucky Micropolitan Statistical Area, which includes all of Franklin and Anderson counties.\n",
        "full_name": "Mitch McConnell",
        "img": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Mitch_McConnell_2016_official_photo_%28cropped%29.jpg"
    },
    "Rand_Paul": {
        "handle": "RandPaul",
        "state": "Kentucky",
        "capital_city": "Frankfort",
        "latitude": "38.186722",
        "longitude": "-84.875374",
        "wiki_html": "[<p><b>Randal Howard Paul</b> (born January 7, 1963) is an American physician and politician serving as the junior U.S. senator from Kentucky since 2011.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> He is a son of former three-time presidential candidate and 12-term U.S. representative of Texas, Ron Paul. Paul is a Republican, and describes himself as a constitutional conservative and supporter of the Tea Party movement.\n</p> <p>Paul attended Baylor University and is a graduate of the Duke University School of Medicine. Paul was a practicing medical doctor (ophthalmology) in Bowling Green, Kentucky from 1993 until his election to the United States Senate in 2010. He was re-elected in 2016 and announced his candidacy for a third term in January 2022.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup>\n</p> <p>Paul was a candidate for the Republican nomination at the 2016 U.S. presidential election. He ended his campaign in February 2016 after finishing in fifth place during the Iowa caucuses. While he initially opposed candidate Donald Trump during the 2016 Republican primaries, he supported Trump following his nomination and became one of his top supporters in the U.S. Senate during and after his presidency.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup>\n</p>]",
        "capital_summary": "Frankfort is the capital city of the Commonwealth of Kentucky and the seat of Franklin County.  It is a home rule-class city in Kentucky; the population was 28,602 at the 2020 census. Located along the Kentucky River, Frankfort is the principal city of the Frankfort, Kentucky Micropolitan Statistical Area, which includes all of Franklin and Anderson counties.\n",
        "full_name": "Rand Paul",
        "img": "https://upload.wikimedia.org/wikipedia/commons/7/78/Rand_Paul%2C_official_portrait%2C_112th_Congress_alternate.jpg"
    },
    "Bill_Cassidy": {
        "handle": "BillCassidy",
        "state": "Louisiana",
        "capital_city": "Baton Rouge",
        "latitude": "30.457069",
        "longitude": "-91.187393",
        "wiki_html": "[<p><b>William Morgan Cassidy</b> (born September 28, 1957) is an American physician and politician serving as the senior United States senator from Louisiana, a seat he has held since 2015.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> A member of the Republican Party, he served in the Louisiana State Senate from 2006 to 2009 and in the U.S. House of Representatives from 2009 to 2015.\n</p> <p>Born in Highland Park, Illinois, Cassidy is a graduate of Louisiana State University (LSU) and LSU School of Medicine. A gastroenterologist, he was elected to the Louisiana State Senate from the 16th district which included parts of Baton Rouge, in 2006. In 2008, he was elected as the U.S. representative for Louisiana's 6th congressional district, defeating Democratic incumbent Don Cazayoux. In 2014, Cassidy defeated Democratic incumbent Mary Landrieu to represent Louisiana in the U.S. Senate, becoming the first Republican to hold the seat since Reconstruction. He was reelected in 2020.\n</p> <p>Cassidy was one of seven Republican senators to vote to convict Donald Trump of incitement of insurrection in his second impeachment trial. As a result, the Republican Party of Louisiana censured him.<sup class=\"reference\" id=\"cite_ref-cnn021321_2-0\">[2]</sup>\n</p>]",
        "capital_summary": "Baton Rouge is the capital of the U.S. state of Louisiana. On the eastern bank of the Mississippi River, it is the parish seat of East Baton Rouge Parish, the most-populous parish in Louisiana. Since 2020, it has been the 99th-most-populous city in the United States, and second-largest city in Louisiana after New Orleans. It is the 18th-most-populous state capital. At the U.S. Census Bureau's 2020 tabulation, it had a population of 227,470; its consolidated population was 456,781 in 2020. It is the center of the Greater Baton Rouge area, the second-largest metropolitan area in Louisiana, with a population of 870,569 as of 2020, up from 802,484 in 2010.\n",
        "full_name": "Bill Cassidy",
        "img": "https://upload.wikimedia.org/wikipedia/commons/0/04/Bill_Cassidy_official_Senate_photo.jpg"
    },
    "John_Kennedy_(Louisiana_politician)": {
        "handle": "SenJohnKennedy",
        "state": "Louisiana",
        "capital_city": "Baton Rouge",
        "latitude": "30.457069",
        "longitude": "-91.187393",
        "wiki_html": "[<p><b>John Neely Kennedy</b> (born November 21, 1951), is an American lawyer and politician who has served as the junior United States senator from Louisiana since 2017. A Democrat turned Republican, he served as the Louisiana State Treasurer from 2000 to 2017.\n</p> <p>Born in Centreville, Mississippi, Kennedy graduated from Vanderbilt University and the University of Virginia School of Law before attending Magdalen College, Oxford. He was a member of Governor Buddy Roemer's staff before running for state attorney general in the 1991 election. In 1999, he was elected state treasurer; he was reelected to that position in 2003, 2007, 2011, and 2015. Kennedy was an unsuccessful candidate for U.S. Senate in 2004 and 2008. In 2007, he switched parties and became a Republican.\n</p> <p>In 2016, when U.S. Senator David Vitter opted not to seek reelection, Kennedy once again ran for Senate. He finished first in the November nonpartisan blanket primary and defeated Democrat Foster Campbell 61–39% in the December runoff. He was sworn in on January 3, 2017. Kennedy was one of six Republican senators to object to the certification of Arizona's electors in the 2020 presidential election.\n</p> <p>Kennedy is running for reelection to a second term in the 2022 election.<sup class=\"reference\" id=\"cite_ref-:0_2-0\">[2]</sup>\n</p>]",
        "capital_summary": "Baton Rouge is the capital of the U.S. state of Louisiana. On the eastern bank of the Mississippi River, it is the parish seat of East Baton Rouge Parish, the most-populous parish in Louisiana. Since 2020, it has been the 99th-most-populous city in the United States, and second-largest city in Louisiana after New Orleans. It is the 18th-most-populous state capital. At the U.S. Census Bureau's 2020 tabulation, it had a population of 227,470; its consolidated population was 456,781 in 2020. It is the center of the Greater Baton Rouge area, the second-largest metropolitan area in Louisiana, with a population of 870,569 as of 2020, up from 802,484 in 2010.\n",
        "full_name": "John Kennedy (Louisiana politician)",
        "img": "https://upload.wikimedia.org/wikipedia/commons/e/e1/John_Kennedy%2C_official_portrait%2C_115th_Congress.jpg"
    },
    "Susan_Collins": {
        "handle": "SenatorCollins",
        "state": "Maine",
        "capital_city": "Augusta",
        "latitude": "44.307167",
        "longitude": "-69.781693",
        "wiki_html": "[<p><b>Susan Margaret Collins</b> (born December 7, 1952) is an American politician serving as the senior United States senator from Maine. A member of the Republican Party, she has held her seat since 1997 and is Maine's longest-serving member of Congress.\n</p> <p>Born in Caribou, Maine, Collins is a graduate of St. Lawrence University in Canton, New York. Beginning her career as a staff assistant for Senator William Cohen in 1975, she became staff director of the Oversight of Government Management Subcommittee of the Committee on Governmental Affairs (which later became the Committee on Homeland Security and Governmental Affairs)<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> in 1981. Governor John R. McKernan Jr. then appointed her commissioner of the Maine Department of Professional and Financial Regulation in 1987. In 1992 President George H. W. Bush appointed her director of the Small Business Administration's regional office in Boston. Collins became a deputy state treasurer in the office of the Treasurer and Receiver-General of Massachusetts in 1993.<sup class=\"reference\" id=\"cite_ref-US_HR_History_2-0\">[2]</sup> After moving back to Maine in 1994, she became the Republican nominee for governor of Maine in the 1994 general election. She was the first female major-party nominee for the post, finishing third in a four-way race with 23% of the vote. After her bid for governor in 1994, she became the founding director of the Center for Family Business at Husson University in Bangor, Maine.\n</p> <p>Collins was first elected to the U.S. Senate in 1996. She was reelected in 2002, 2008, 2014, and 2020. She chaired the Senate Special Committee on Aging from 2015 to 2021 and the Senate Committee on Homeland Security and Governmental Affairs from 2003 to 2007. Collins is a senior Republican woman in the Senate, the dean of Maine's congressional delegation, and the only New England Republican in the 116th and 117th Congresses.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup> She has been called a moderate Republican and is often a pivotal vote in the Senate.<sup class=\"reference\" id=\"cite_ref-4\">[4]</sup><sup class=\"reference\" id=\"cite_ref-5\">[5]</sup> To date, Collins is the longest-serving Republican woman in the Senate.<sup class=\"reference\" id=\"cite_ref-6\">[6]</sup><sup class=\"reference\" id=\"cite_ref-7\">[7]</sup>\n</p> <p>On February 13, 2021, Collins was one of seven Republican senators to vote to convict Donald Trump of incitement of insurrection in his second impeachment trial. She also was the only GOP senator to vote against the nomination of Amy Coney Barrett to the Supreme Court.\n</p>]",
        "capital_summary": "Augusta is the state capital of the U.S. state of Maine and the county seat of Kennebec County.\n",
        "full_name": "Susan Collins",
        "img": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Senator_Susan_Collins_2014_official_portrait_%28half-body_crop%29.jpg"
    },
    "Angus_King": {
        "handle": "SenAngusKing",
        "state": "Maine",
        "capital_city": "Augusta",
        "latitude": "44.307167",
        "longitude": "-69.781693",
        "wiki_html": "[<p><b>Angus Stanley King Jr.</b> (born March 31, 1944) is an American politician and lawyer who is the junior United States senator from Maine since 2013.<sup class=\"reference\" id=\"cite_ref-hsieu_1-0\">[1]</sup> A political independent since 1993, he was the 72nd governor of Maine from 1995 to 2003.\n</p> <p>King won Maine's 2012 Senate election to replace the retiring Republican Olympia Snowe and took office on January 3, 2013. He was reelected to a second term in 2018, following the state's inaugural instant-runoff voting elections. For committee assignment purposes, he caucuses with the Democratic Party. He is one of two independents currently serving in the Senate, the other being Bernie Sanders of Vermont, who also caucuses with the Democrats.\n</p>]",
        "capital_summary": "Augusta is the state capital of the U.S. state of Maine and the county seat of Kennebec County.\n",
        "full_name": "Angus King",
        "img": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Angus_King%2C_official_portrait%2C_113th_Congress.jpg"
    },
    "Ben_Cardin": {
        "handle": "SenatorCardin",
        "state": "Maryland",
        "capital_city": "Annapolis",
        "latitude": "38.978764",
        "longitude": "-76.490936",
        "wiki_html": "[<p><b>Benjamin Louis Cardin</b> (born October 5, 1943) is an American lawyer and politician serving as the senior United States senator from Maryland, a seat he has held since 2007. A member of the Democratic Party, he previously was the U.S. representative for <span data-sort-value=\"Maryland03 !\">Maryland's 3rd congressional district</span> from 1987 to 2007. Cardin served as a member of the Maryland House of Delegates from 1967 to 1987 and as Speaker of the Maryland House of Delegates from 1979 to 1987, the youngest person to hold the position in history. In his half-century career as an elected official, he has never lost an election.\n</p> <p>Cardin was elected as U.S. Senator to succeed Paul Sarbanes in 2006, defeating Republican Michael Steele, the Lieutenant Governor of Maryland, by a margin of 54% to 44%. He was reelected in 2012 taking 56% of the vote.<sup class=\"reference\" id=\"cite_ref-MD2012_1-0\">[1]</sup> He became Maryland's senior U.S. senator on January 3, 2017 upon Barbara Mikulski's retirement. Cardin won reelection to a third term in 2018, taking 65% of the vote.\n</p>]",
        "capital_summary": "Annapolis is the capital of the U.S. state of Maryland, also functions as the county seat of Anne Arundel County. Situated on the Chesapeake Bay at the mouth of the Severn River, 25 miles  south of Baltimore and about 30 miles  east of Washington, D.C., Annapolis forms part of the Baltimore–Washington metropolitan area. The 2020 census recorded its population as 40,812, an increase of 6.3% since 2010.\n",
        "full_name": "Ben Cardin",
        "img": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Ben_Cardin_official_Senate_portrait.jpg"
    },
    "Chris_Van_Hollen": {
        "handle": "ChrisVanHollen",
        "state": "Maryland",
        "capital_city": "Annapolis",
        "latitude": "38.978764",
        "longitude": "-76.490936",
        "wiki_html": "[<p><b>Christopher J. Van Hollen Jr.</b><sup class=\"reference\" id=\"cite_ref-1\">[1]</sup><sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> (born January 10, 1959) is an American attorney  and politician serving as the junior United States senator from Maryland since January 3, 2017. From 2003 to 2017 he served as the U.S. representative for <span data-sort-value=\"Maryland08 !\">Maryland's 8th congressional district</span>. He is a member of the Democratic Party.\n</p> <p>In 2007, Van Hollen became the chair of the Democratic Congressional Campaign Committee (DCCC). In this post, he was responsible for leading efforts to defend vulnerable Democrats and get more Democrats elected to Congress in 2008, which he did. House Speaker Nancy Pelosi created a new leadership post, Assistant to the Speaker, in 2006 so that Van Hollen could be present at all leadership meetings. He was elected ranking member on the Budget Committee on November 17, 2010. Pelosi appointed Van Hollen to the 12-member bipartisan Committee on Deficit Reduction with a mandate for finding major budget reductions by late 2011. On October 17, 2013, Pelosi appointed Van Hollen to serve on the bicameral conference committee.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup>\n</p> <p>Van Hollen ran for the United States Senate in 2016 to replace retiring Senator Barbara Mikulski. He defeated Congresswoman Donna Edwards in the Democratic primary and won the general election 60 to 36 percent. Van Hollen served as chair of the Democratic Senatorial Campaign Committee (DSCC) from 2017 to 2019.<sup class=\"reference\" id=\"cite_ref-krobillard1_4-0\">[4]</sup>\n</p>]",
        "capital_summary": "Annapolis is the capital of the U.S. state of Maryland, also functions as the county seat of Anne Arundel County. Situated on the Chesapeake Bay at the mouth of the Severn River, 25 miles  south of Baltimore and about 30 miles  east of Washington, D.C., Annapolis forms part of the Baltimore–Washington metropolitan area. The 2020 census recorded its population as 40,812, an increase of 6.3% since 2010.\n",
        "full_name": "Chris Van Hollen",
        "img": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Chris_Van_Hollen_official_portrait_115th_Congress.jpg"
    },
    "Elizabeth_Warren": {
        "handle": "SenWarren",
        "state": "Massachusetts",
        "capital_city": "Boston",
        "latitude": "42.358162",
        "longitude": "-71.063698",
        "wiki_html": "[<p><img alt=\"Elizabeth Warren's signature\" data-file-height=\"243\" data-file-width=\"634\" decoding=\"async\" height=\"59\" src=\"//upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Elizabeth_Warren_Signature.svg/155px-Elizabeth_Warren_Signature.svg.png\" srcset=\"//upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Elizabeth_Warren_Signature.svg/233px-Elizabeth_Warren_Signature.svg.png 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Elizabeth_Warren_Signature.svg/310px-Elizabeth_Warren_Signature.svg.png 2x\" width=\"155\"/>\n</p> <p><b>Elizabeth Ann Warren</b> (née <b>Herring</b>; born June 22, 1949) is an American politician and former law professor who is the senior United States senator from Massachusetts, serving since 2013. A member of the Democratic Party and regarded as a progressive,<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> Warren has focused on consumer protection, economic opportunity, and the social safety net while in the Senate. Warren was a candidate in the 2020 Democratic Party presidential primaries, ultimately finishing third.\n</p> <p>Warren is a graduate of the University of Houston and Rutgers Law School and has taught law at several universities, including the University of Houston, the University of Texas at Austin, the University of Pennsylvania, and Harvard University. She was one of the most influential professors in commercial and bankruptcy law before beginning her political career. Warren has written 12 books and more than 100 articles.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup><sup class=\"reference\" id=\"cite_ref-eleven_4-0\">[4]</sup><sup class=\"reference\" id=\"cite_ref-5\">[5]</sup>\n</p> <p>Warren's first foray into public policy began in 1995, when she worked to oppose what eventually became a 2005 act restricting bankruptcy access for individuals.<sup class=\"reference\" id=\"cite_ref-6\">[6]</sup><sup class=\"reference\" id=\"cite_ref-7\">[7]</sup> During the late 2000s, her national profile grew after her forceful public stances in favor of more stringent banking regulations after the financial crisis of 2007–08. She served as chair of the Congressional Oversight Panel of the Troubled Asset Relief Program, and proposed and established the Consumer Financial Protection Bureau, for which she served as the first special advisor under President Barack Obama.<sup class=\"reference\" id=\"cite_ref-8\">[8]</sup>\n</p> <p>In 2012, Warren defeated incumbent Republican Scott Brown and became the first female U.S. senator from Massachusetts.<sup class=\"reference\" id=\"cite_ref-9\">[9]</sup> She won re-election by a wide margin in 2018, defeating Republican nominee Geoff Diehl.<sup class=\"reference\" id=\"cite_ref-10\">[10]</sup> On February 9, 2019, Warren announced her candidacy in the 2020 United States presidential election.<sup class=\"reference\" id=\"cite_ref-CNNkickoff_11-0\">[11]</sup> She was briefly considered the front-runner for the Democratic nomination in late 2019, but support for her campaign dwindled. She withdrew from the race on March 5, 2020, after Super Tuesday.<sup class=\"reference\" id=\"cite_ref-12\">[12]</sup>\n</p>]",
        "capital_summary": "Boston, officially the City of Boston, is the capital and most populous city of the Commonwealth of Massachusetts in the United States and 24th-most populous city in the country. The city proper covers about  48.4 square miles  with a population of 675,647 in 2020, also making it the most populous city in New England. It is the seat of Suffolk County . The city is the economic and cultural anchor of a substantially larger metropolitan area known as Greater Boston, a metropolitan statistical area  home to a census-estimated 4.8 million people in 2016 and ranking as the tenth-largest MSA in the country. A broader combined statistical area , generally corresponding to the commuting area and including Providence, Rhode Island, is home to some 8.2 million people, making it the sixth most populous in the United States.\n",
        "full_name": "Elizabeth Warren",
        "img": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Elizabeth_Warren%2C_official_portrait%2C_114th_Congress.jpg"
    },
    "Ed_Markey": {
        "handle": "senmarkey",
        "state": "Massachusetts",
        "capital_city": "Boston",
        "latitude": "42.358162",
        "longitude": "-71.063698",
        "wiki_html": "[<p><b>Edward John Markey</b> (born July 11, 1946) is an American lawyer, politician, and former Army reservist who has served as the junior United States senator from Massachusetts since 2013. A member of the Democratic Party, he was the U.S. representative for <span data-sort-value=\"Massachusetts07 !\">Massachusetts's 7th congressional district</span> from 1976 to 2013. Between the House and Senate, Markey has served in Congress for more than four decades. He was also a member of the Massachusetts House of Representatives from 1973 to 1976.\n</p> <p>In 2013, after John Kerry was appointed United States Secretary of State, Markey was elected to serve out the remainder of Kerry's Senate term in a 2013 special election. Markey defeated Stephen Lynch in the Democratic primary and Republican Gabriel E. Gomez in the general election. Markey was elected to a full term in the Senate in 2014. Markey fended off a primary challenge from Joseph Kennedy III and was reelected in 2020 by a wide margin.\n</p> <p>Markey is a progressive who has focused on climate change and energy policy and was chair of the House Select Committee on Energy Independence and Global Warming from 2007 to 2011. He is the Senate author of the Green New Deal.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> Markey is the dean of the Massachusetts congressional delegation, having served in Congress since 1976. Markey's progressive policies have led to widespread support among young voters.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> The Hill called him \"an icon to Gen Z activists\".<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup>\n</p>]",
        "capital_summary": "Boston, officially the City of Boston, is the capital and most populous city of the Commonwealth of Massachusetts in the United States and 24th-most populous city in the country. The city proper covers about  48.4 square miles  with a population of 675,647 in 2020, also making it the most populous city in New England. It is the seat of Suffolk County . The city is the economic and cultural anchor of a substantially larger metropolitan area known as Greater Boston, a metropolitan statistical area  home to a census-estimated 4.8 million people in 2016 and ranking as the tenth-largest MSA in the country. A broader combined statistical area , generally corresponding to the commuting area and including Providence, Rhode Island, is home to some 8.2 million people, making it the sixth most populous in the United States.\n",
        "full_name": "Ed Markey",
        "img": "https://upload.wikimedia.org/wikipedia/commons/9/94/Edward_Markey%2C_official_portrait%2C_114th_Congress.jpg"
    },
    "Debbie_Stabenow": {
        "handle": "SenStabenow",
        "state": "Michigan",
        "capital_city": "Lansing",
        "latitude": "42.733635",
        "longitude": "-84.555328",
        "wiki_html": "[<p><b>Deborah Ann Stabenow</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'s' in 'sigh'\">s</span><span title=\"'t' in 'tie'\">t</span><span title=\"/æ/: 'a' in 'bad'\">æ</span><span title=\"'b' in 'buy'\">b</span><span title=\"/ə/: 'a' in 'about'\">ə</span><span title=\"/ˌ/: secondary stress follows\">ˌ</span><span title=\"'n' in 'nigh'\">n</span><span title=\"/aʊ/: 'ou' in 'mouth'\">aʊ</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">STAB</span>-ə-now</i>; née <b>Greer</b>, born April 29, 1950) is an American politician serving as the senior United States senator from Michigan, a seat she has held since 2001. A member of the Democratic Party, she became the state's first female U.S. senator after defeating Republican incumbent Spencer Abraham in the 2000 election. Before her election to the Senate, she was a member of the U.S. House of Representatives, representing Michigan's 8th congressional district from 1997 to 2001. Previously she served on the Ingham County Board of Commissioners and in the Michigan State Legislature.\n</p> <p>Stabenow was reelected to Senate in 2006, 2012 and 2018. She became the state's senior U.S. senator upon Carl Levin's retirement in 2015. Stabenow chaired the Senate Agriculture Committee from 2011 to 2015 and again since 2021. She became chair of the Senate Democratic Policy Committee in 2017. At the start of the 118th Congress, Stabenow will become the dean of the Michigan congressional delegation, upon the retirement of Representative Fred Upton.\n</p>]",
        "capital_summary": "Lansing is the capital of the U.S. state of Michigan. It is mostly in Ingham County, although portions of the city extend west into Eaton County and north into Clinton County. The 2020 Census placed the city's population at 112,644, making it the sixth largest city in Michigan. The population of its metropolitan statistical area  was 541,297 at the 2020 Census, the third largest in the state after metropolitan Detroit and Grand Rapids. It was named the new state capital of Michigan in 1847, ten years after Michigan became a state.\n",
        "full_name": "Debbie Stabenow",
        "img": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Debbie_Stabenow%2C_official_photo%2C_116th_Congress.jpg"
    },
    "Gary_Peters": {
        "handle": "SenGaryPeters",
        "state": "Michigan",
        "capital_city": "Lansing",
        "latitude": "42.733635",
        "longitude": "-84.555328",
        "wiki_html": "[<p><b>Gary Charles Peters Sr.</b> (born December 1, 1958) is an American lawyer, politician, and former military officer serving as the junior United States senator from Michigan since 2015. A member of the Democratic Party, he was the U.S. representative for <span data-sort-value=\"Michigan14 !\">Michigan's 14th congressional district</span>, which includes the eastern half of Detroit, the Grosse Pointes, Hamtramck, Southfield, and Pontiac, from 2013 to 2015. He represented <span data-sort-value=\"Michigan09 !\">Michigan's 9th congressional district</span> from 2009 to 2013.\n</p> <p>Before his election to Congress, Peters served in the United States Navy Reserve, spent 22 years as an investment advisor, and worked briefly in academia. He was elected to the Rochester Hills City Council in 1991 and represented the 14th district in the Michigan Senate from 1995 to 2002. He was the Democratic nominee for Michigan Attorney General in 2002, narrowly losing to Republican Mike Cox. He was then appointed commissioner of the Michigan Lottery by Governor Jennifer Granholm, serving from 2003 to 2008, when he resigned to successfully run for Congress.\n</p> <p>In 2014, Peters was elected to the United States Senate seat being vacated by retiring Democratic incumbent Carl Levin.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> He was unopposed in the Democratic primary and defeated Republican Terri Lynn Land in the general election. He was the only non-incumbent Democrat to win a Senate election in 2014.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup><sup class=\"reference\" id=\"cite_ref-3\">[3]</sup> Peters was reelected in 2020, defeating Republican challenger John E. James in a close race.<sup class=\"reference\" id=\"cite_ref-4\">[4]</sup>\n</p> <p>On January 28, 2021, Peters was selected as chair of the Democratic Senatorial Campaign Committee, succeeding Senator Catherine Cortez Masto.<sup class=\"reference\" id=\"cite_ref-5\">[5]</sup>\n</p>]",
        "capital_summary": "Lansing is the capital of the U.S. state of Michigan. It is mostly in Ingham County, although portions of the city extend west into Eaton County and north into Clinton County. The 2020 Census placed the city's population at 112,644, making it the sixth largest city in Michigan. The population of its metropolitan statistical area  was 541,297 at the 2020 Census, the third largest in the state after metropolitan Detroit and Grand Rapids. It was named the new state capital of Michigan in 1847, ten years after Michigan became a state.\n",
        "full_name": "Gary Peters",
        "img": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Gary_Peters_official_photo_115th_congress.jpg"
    },
    "Amy_Klobuchar": {
        "handle": "amyklobuchar",
        "state": "Minnesota",
        "capital_city": "St. Paul",
        "latitude": "44.955097",
        "longitude": "-93.102211",
        "wiki_html": "[<p><img alt=\"Signature Amy Klobuchar.svg\" data-file-height=\"387\" data-file-width=\"512\" decoding=\"async\" height=\"102\" src=\"//upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Signature_Amy_Klobuchar.svg/135px-Signature_Amy_Klobuchar.svg.png\" srcset=\"//upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Signature_Amy_Klobuchar.svg/203px-Signature_Amy_Klobuchar.svg.png 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Signature_Amy_Klobuchar.svg/270px-Signature_Amy_Klobuchar.svg.png 2x\" width=\"135\"/>\n</p> <p><b>Amy Jean Klobuchar</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'k' in 'kind'\">k</span><span title=\"'l' in 'lie'\">l</span><span title=\"/oʊ/: 'o' in 'code'\">oʊ</span><span title=\"'b' in 'buy'\">b</span><span title=\"/ə/: 'a' in 'about'\">ə</span><span title=\"/ʃ/: 'sh' in 'shy'\">ʃ</span><span title=\"/ɑːr/: 'ar' in 'far'\">ɑːr</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">KLOH</span>-bə-shar</i>; born May 25, 1960) is an American lawyer and politician serving as the senior United States senator from Minnesota, a seat she has held since 2007. A member of the Minnesota Democratic–Farmer–Labor Party (DFL), Minnesota's affiliate of the Democratic Party, she previously served as the Hennepin County attorney.\n</p> <p>Born in Plymouth, Minnesota, Klobuchar is a graduate of Yale University and the University of Chicago Law School. She was a partner at two Minneapolis law firms before being elected county attorney for Hennepin County in 1998, making her responsible for all criminal prosecution in Minnesota's most populous county. Klobuchar was first elected to the Senate in 2006, becoming Minnesota's first elected female United States senator, and was reelected in 2012 and 2018.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> In 2009 and 2010, she was described as a \"rising star\" in the Democratic Party.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup><sup class=\"reference\" id=\"cite_ref-3\">[3]</sup>\n</p> <p>She announced her candidacy for the Democratic nomination for president of the United States in the 2020 election on February 10, 2019; on March 2, 2020, she suspended her campaign and endorsed Joe Biden.<sup class=\"reference\" id=\"cite_ref-4\">[4]</sup><sup class=\"reference\" id=\"cite_ref-5\">[5]</sup> In 2021, she became the chair of the Senate Rules Committee.\n</p>]",
        "capital_summary": "Saint Paul is the capital of the U.S. state of Minnesota and the county seat of Ramsey County. Situated on high bluffs overlooking a bend in the Mississippi River, Saint Paul is a regional business hub and the center of Minnesota's government. The Minnesota State Capitol and the state government offices all sit on a hill close to the city's downtown district. One of the oldest cities in Minnesota, Saint Paul has several historic neighborhoods and landmarks, such as the Summit Avenue Neighborhood and the James J. Hill House. Like the nearby and larger city of Minneapolis, Saint Paul is known for its cold, snowy winters and humid summers. \n",
        "full_name": "Amy Klobuchar",
        "img": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Amy_Klobuchar%2C_official_portrait%2C_113th_Congress.jpg"
    },
    "Tina_Smith": {
        "handle": "SenTinaSmith",
        "state": "Minnesota",
        "capital_city": "St. Paul",
        "latitude": "44.955097",
        "longitude": "-93.102211",
        "wiki_html": "[<p><b>Christine Elizabeth Smith</b> (née <b>Flint</b>, born March 4, 1958) is an American politician, retired Democratic political consultant, and former businesswoman serving as the junior United States senator from Minnesota since 2018. She is a member of the Minnesota Democratic–Farmer–Labor Party (DFL), an affiliate of the Democratic Party. \n</p> <p>Born in Albuquerque, New Mexico, Smith moved to Minnesota in the 1980s to work for General Mills and later became the vice president of Planned Parenthood of Minnesota. She then began a career as a political consultant and organizer for Democratic candidates. Smith was the campaign manager for Walter Mondale’s unsuccessful last-minute campaign in the 2002 United States Senate election in Minnesota after incumbent senator Paul Wellstone died in a plane crash 11 days before the election.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup>\n</p> <p>After Mondale lost, Smith served as chief of staff to Mayor of Minneapolis R. T. Rybak. She then helped run Mark Dayton's successful campaign for Governor of Minnesota in 2010. After his extremely close victory, Dayton named Smith his chief of staff. Later, for Dayton’s reelection campaign in the 2014 election, Smith was named as Dayton’s pick for lieutenant governor.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup> After winning her first election to public office, Smith served as the 48th lieutenant governor of Minnesota from 2015 to 2018. Dayton appointed her to fill the U.S. Senate seat vacated by Al Franken's resignation in 2018. She won the 2018 special election and was elected to a full term in 2020 in a close election.<sup class=\"reference\" id=\"cite_ref-4\">[4]</sup>\n</p>]",
        "capital_summary": "Saint Paul is the capital of the U.S. state of Minnesota and the county seat of Ramsey County. Situated on high bluffs overlooking a bend in the Mississippi River, Saint Paul is a regional business hub and the center of Minnesota's government. The Minnesota State Capitol and the state government offices all sit on a hill close to the city's downtown district. One of the oldest cities in Minnesota, Saint Paul has several historic neighborhoods and landmarks, such as the Summit Avenue Neighborhood and the James J. Hill House. Like the nearby and larger city of Minneapolis, Saint Paul is known for its cold, snowy winters and humid summers. \n",
        "full_name": "Tina Smith",
        "img": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Tina_Smith%2C_official_portrait%2C_116th_congress.jpg"
    },
    "Roger_Wicker": {
        "handle": "SenatorWicker",
        "state": "Mississippi",
        "capital_city": "Jackson",
        "latitude": "32.303848",
        "longitude": "-90.182106",
        "wiki_html": "[<p><b>Roger Frederick Wicker</b> (born July 5, 1951) is an American attorney and politician serving as the senior United States senator from Mississippi, in office since 2007. A member of the Republican Party, Wicker previously served as a member of the United States House of Representatives and the Mississippi State Senate.\n</p> <p>Born in Pontotoc, Mississippi, Wicker is a graduate of the University of Mississippi and the University of Mississippi School of Law. He was an officer in the United States Air Force from 1976 to 1980 and a member of the United States Air Force Reserves from 1980 to 2003. During the 1980s, he worked as a political counselor to then-Congressman Trent Lott on the House Rules Committee. In 1987, Wicker was elected to the Mississippi State Senate, representing the 6th district, which included Tupelo.\n</p> <p>Wicker was elected to the U.S. House of Representatives in 1994, succeeding longtime Representative Jamie Whitten. Wicker served in the House from 1995 to 2007, when he was appointed to the Senate by Governor Haley Barbour to fill the seat vacated by Lott. Wicker subsequently won a special election for the remainder of the term in 2008 and was reelected to a full term in 2012. Wicker served as chair of the National Republican Senatorial Committee from 2015 to 2017 and is a deputy Republican whip. He was reelected in 2018, defeating Democratic nominee David Baria.\n</p>]",
        "capital_summary": "Jackson, officially the City of Jackson, is the capital and most populous city of the U.S. State of Mississippi.  It is one of two county seats of Hinds County, along with Raymond, Mississippi.  The city of Jackson also includes around 3,000 acres  comprising Jackson-Medgar Evers International Airport in Rankin County and a small portion of Madison County.  The city has a population of 153,701 as of the 2020 census, down from 173,514 from the 2010 census. Jackson's population declined more between 2010 and 2020  than any major city in the United States.  The city sits on the Pearl River and is located in the greater Jackson Prairie region of Mississippi.\n",
        "full_name": "Roger Wicker",
        "img": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Roger_Wicker_Portrait_2018_full.jpg"
    },
    "Cindy_Hyde-Smith": {
        "handle": "SenHydeSmith",
        "state": "Mississippi",
        "capital_city": "Jackson",
        "latitude": "32.303848",
        "longitude": "-90.182106",
        "wiki_html": "[<p><b>Cindy Hyde-Smith</b> (née <b>Hyde</b>; born May 10, 1959)<sup class=\"reference\" id=\"cite_ref-:2_1-0\">[1]</sup> is an American politician serving as the junior United States senator from Mississippi since 2018.<sup class=\"reference\" id=\"cite_ref-chronolist_2-0\">[2]</sup> A member of the Republican Party, she was previously the Mississippi Commissioner of Agriculture and Commerce and a member of the Mississippi State Senate.\n</p> <p>Born in Brookhaven, Mississippi, Hyde-Smith is a graduate of Copiah–Lincoln Community College and the University of Southern Mississippi. In 1999, she was elected to the Mississippi State Senate as a Democrat. She represented the 39th district from 2000 to 2012. In 2010, Hyde-Smith switched parties and became a Republican, citing her conservative beliefs.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup> Hyde-Smith was elected Mississippi agriculture commissioner in 2011, the first woman elected to that office.\n</p> <p>On March 21, 2018, Governor Phil Bryant announced his intention to appoint Hyde-Smith to the United States Senate seat being vacated due to the resignation of Thad Cochran.<sup class=\"reference\" id=\"cite_ref-4\">[4]</sup> Hyde-Smith was sworn into office on April 9, 2018. She is the first woman to represent Mississippi in Congress.<sup class=\"reference\" id=\"cite_ref-5\">[5]</sup> Hyde-Smith was a candidate in the 2018 U.S. Senate special election for the remainder of Cochran's term, which expired in 2021.<sup class=\"reference\" id=\"cite_ref-6\">[6]</sup> She finished first in the top-two general election on November 6, 2018, but did not receive more than 50% of the vote, thus advancing to a November 27 special runoff election versus Mike Espy. Hyde-Smith won the runoff election,<sup class=\"reference\" id=\"cite_ref-7\">[7]</sup> becoming the first woman elected to Congress from Mississippi.<sup class=\"reference\" id=\"cite_ref-8\">[8]</sup>\n</p> <p>In January 2021, Hyde-Smith joined a group of Republican senators who objected to certifying some swing states' electoral votes as part of an attempt to overturn the 2020 United States presidential election.<sup class=\"noprint Inline-Template Template-Fact\" style=\"white-space:nowrap;\">[<i><span title=\"This claim needs references to reliable sources. (February 2022)\">citation needed</span></i>]</sup>\n</p>]",
        "capital_summary": "Jackson, officially the City of Jackson, is the capital and most populous city of the U.S. State of Mississippi.  It is one of two county seats of Hinds County, along with Raymond, Mississippi.  The city of Jackson also includes around 3,000 acres  comprising Jackson-Medgar Evers International Airport in Rankin County and a small portion of Madison County.  The city has a population of 153,701 as of the 2020 census, down from 173,514 from the 2010 census. Jackson's population declined more between 2010 and 2020  than any major city in the United States.  The city sits on the Pearl River and is located in the greater Jackson Prairie region of Mississippi.\n",
        "full_name": "Cindy Hyde-Smith",
        "img": "https://upload.wikimedia.org/wikipedia/commons/5/52/Official_headshot_of_US_Senator_Cindy_Hyde-Smith.jpg"
    },
    "Roy_Blunt": {
        "handle": "RoyBlunt",
        "state": "Missouri",
        "capital_city": "Jefferson City",
        "latitude": "38.579201",
        "longitude": "-92.172935",
        "wiki_html": "[<p><b>Roy Dean Blunt</b><sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> (born January 10, 1950) is an American politician serving as the senior United States senator from Missouri, a seat he was first elected to in 2010. A member of the Republican Party, he previously served as the 33rd Missouri Secretary of State (1985–1993) and U.S. Representative for Missouri's 7th congressional district (1997–2011).\n</p> <p>Born in Niangua, Missouri, Blunt is a graduate of Southwest Baptist University and Southwest Missouri State University (now Missouri State University). After serving as Missouri Secretary of State from 1985 to 1993, he was elected to the U.S. House of Representatives for Missouri's 7th congressional district in 1996. There, he served as Republican Whip from 2003 to 2009.\n</p> <p>Blunt successfully ran for the U.S. Senate in 2010. The next year, he was elected vice chairman of the Senate Republican Conference.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> Blunt is the dean of Missouri's congressional delegation, and was elected to serve as Policy Committee chairman in November 2018.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup> On March 8, 2021, he announced that he will not seek reelection in 2022.<sup class=\"reference\" id=\"cite_ref-4\">[4]</sup><sup class=\"reference\" id=\"cite_ref-5\">[5]</sup><sup class=\"reference\" id=\"cite_ref-6\">[6]</sup>\n</p>]",
        "capital_summary": "Jefferson City is located on the northern edge of the Ozark Plateau on the southern side of the Missouri River in a region known as Mid-Missouri, that is roughly mid-way between the state's two large urban areas of Kansas City and St. Louis. It is 29 miles south of Columbia, Missouri, and sits at the western edge of the Missouri Rhineland, one of the major wine-producing regions of the Midwest. The city is dominated by the domed Capitol, which rises from a bluff overlooking the Missouri River to the north; Lewis and Clark passed the bluff on their historic expedition upriver before Europeans established any settlement there.\n",
        "full_name": "Roy Blunt",
        "img": "https://upload.wikimedia.org/wikipedia/commons/2/20/Roy_Blunt%2C_Official_Portrait%2C_112th_Congress.jpg"
    },
    "Josh_Hawley": {
        "handle": "clairecmc",
        "state": "Missouri",
        "capital_city": "Jefferson City",
        "latitude": "38.579201",
        "longitude": "-92.172935",
        "wiki_html": "[<p><b>Joshua David Hawley</b> (born December 31, 1979) is an American politician, lawyer, and former professor who has served as the junior United States senator from Missouri since 2019. A member of the Republican Party, Hawley served as the 42nd attorney general of Missouri from 2017 to 2019, before defeating two-term incumbent Democratic senator Claire McCaskill in the 2018 election.\n</p> <p>Born in Springdale, Arkansas, to a banker and a teacher, Hawley graduated from Stanford University in 2002 and Yale Law School in 2006. He was a law clerk to Tenth Circuit Judge Michael W. McConnell and Chief Justice John Roberts and then worked as a lawyer, first in private practice, from 2008 to 2011, and then for the Becket Fund for Religious Liberty, from 2011 to 2015. Before becoming Missouri attorney general, he was also a post graduate intern at St Paul's School in London, an associate professor at the University of Missouri School of Law, and a faculty member of the conservative Blackstone Legal Fellowship.\n</p> <p>As Missouri attorney general, Hawley initiated several high-profile lawsuits and investigations, including a lawsuit against the Affordable Care Act, an investigation into Missouri governor Eric Greitens, and a lawsuit and investigation into companies associated with the opioid epidemic. In the Senate, Hawley became widely known for his criticism of Big Tech, as well as for his criticism of the Chinese government and his support for an independent Hong Kong. His political beliefs have been described as strongly socially conservative.<sup class=\"reference\" id=\"cite_ref-kilgore_3-0\">[3]</sup> Critics have characterized his ideology as reactionary and theocratic.<sup class=\"reference\" id=\"cite_ref-New_York_Times_4-0\">[4]</sup><sup class=\"reference\" id=\"cite_ref-5\">[5]</sup><sup class=\"reference\" id=\"cite_ref-6\">[6]</sup>\n</p> <p>In December 2020, Hawley provoked a political backlash when he became the first senator to announce plans to object to the certification of Joe Biden's victory in the 2020 United States presidential election. Hawley led Senate efforts to overturn the Electoral College vote count<sup class=\"reference\" id=\"cite_ref-:8_7-0\">[7]</sup><sup class=\"reference\" id=\"cite_ref-NPR2020_8-0\">[8]</sup><sup class=\"reference\" id=\"cite_ref-9\">[9]</sup><sup class=\"reference\" id=\"cite_ref-10\">[10]</sup><sup class=\"reference\" id=\"cite_ref-11\">[11]</sup> and rallied supporters of the Stop the Steal conspiracy theory that motivated an attack on the U.S. Capitol,<sup class=\"reference\" id=\"cite_ref-12\">[12]</sup><sup class=\"reference\" id=\"cite_ref-Misinformation_13-0\">[13]</sup><sup class=\"reference\" id=\"cite_ref-MisleadingDenial_14-0\">[14]</sup><sup class=\"reference\" id=\"cite_ref-ReutersRepublicans_15-0\">[15]</sup><sup class=\"reference\" id=\"cite_ref-16\">[16]</sup> with figures across the political spectrum calling on him to resign or be expelled from the Senate. In late January 2021, Hawley denied trying to overturn the election results,<sup class=\"reference\" id=\"cite_ref-17\">[17]</sup> and ultimately there were no repercussions.<sup class=\"reference\" id=\"cite_ref-18\">[18]</sup>\n</p>]",
        "capital_summary": "Jefferson City is located on the northern edge of the Ozark Plateau on the southern side of the Missouri River in a region known as Mid-Missouri, that is roughly mid-way between the state's two large urban areas of Kansas City and St. Louis. It is 29 miles south of Columbia, Missouri, and sits at the western edge of the Missouri Rhineland, one of the major wine-producing regions of the Midwest. The city is dominated by the domed Capitol, which rises from a bluff overlooking the Missouri River to the north; Lewis and Clark passed the bluff on their historic expedition upriver before Europeans established any settlement there.\n",
        "full_name": "Josh Hawley",
        "img": "https://upload.wikimedia.org/wikipedia/commons/3/31/Josh_Hawley%2C_official_portrait%2C_116th_congress.jpg"
    },
    "Jon_Tester": {
        "handle": "SenatorTester",
        "state": "Montana",
        "capital_city": "Helena",
        "latitude": "46.585709",
        "longitude": "-112.018417",
        "wiki_html": "[<p><b>Raymond Jon Tester</b><sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> (born August 21, 1956) is an American farmer and politician serving as the senior United States senator from Montana, a seat he has held since 2007. He was first elected in 2006, defeating Republican incumbent Conrad Burns in one of the closest Senate races of that year. He narrowly won reelection in 2012 against U.S. Representative Denny Rehberg, and in 2018 against Montana State Auditor Matt Rosendale. Tester was previously the president of the Montana Senate and worked as a music teacher and farmer. He became Montana's senior senator in 2014 following Max Baucus's departure<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> and is the dean of Montana's congressional delegation. Since January 4, 2021, he has been the only member of the Democratic Party to hold statewide office in Montana.\n</p>]",
        "capital_summary": "Helena is the state capital of the U.S. state of Montana and the county seat of Lewis and Clark County.\n",
        "full_name": "Jon Tester",
        "img": "https://upload.wikimedia.org/wikipedia/commons/3/39/JonTester.jpg"
    },
    "Steve_Daines": {
        "handle": "SteveDaines",
        "state": "Montana",
        "capital_city": "Helena",
        "latitude": "46.585709",
        "longitude": "-112.018417",
        "wiki_html": "[<p><b>Steven David Daines</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'d' in 'dye'\">d</span><span title=\"/eɪ/: 'a' in 'face'\">eɪ</span><span title=\"'n' in 'nigh'\">n</span><span title=\"'z' in 'zoom'\">z</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">DAYNZ</span></i>; born August 20, 1962) is an American politician and former corporate executive<sup class=\"reference\" id=\"cite_ref-:3_2-0\">[2]</sup> serving as the junior United States senator for Montana since 2015. A Republican, he served as the U.S. representative for Montana's at-large congressional district from 2013 to 2015. In 2014, Daines won Montana's open U.S. Senate seat. He was reelected in 2020, defeating the Democratic nominee, Governor Steve Bullock. Before entering politics, Daines worked for Procter &amp; Gamble and RightNow Technologies.\n</p>]",
        "capital_summary": "Helena is the state capital of the U.S. state of Montana and the county seat of Lewis and Clark County.\n",
        "full_name": "Steve Daines",
        "img": "https://upload.wikimedia.org/wikipedia/commons/4/41/Steve_Daines%2C_Official_Portrait%2C_116th_Congress.jpg"
    },
    "Deb_Fischer": {
        "handle": "SenatorFischer",
        "state": "Nebraska",
        "capital_city": "Lincoln",
        "latitude": "40.808075",
        "longitude": "-96.699654",
        "wiki_html": "[<p><b>Debra Strobel Fischer</b> (born March 1, 1951) is an American politician serving as the senior United States senator from Nebraska, a seat she has held since 2013. She was elected to the Senate in 2012 and reelected in 2018. Fischer previously served in the Nebraska Legislature, representing the 43rd legislative district for two terms from 2005 to 2013. She is a member of the Republican Party and the first woman elected to a full term as a U.S. senator from Nebraska.\n</p>]",
        "capital_summary": "Lincoln is the capital city of the U.S. state of Nebraska and the county seat of Lancaster County. The city covers 99.050 square miles  with a population of 291,082 in 2020. It is the second-most populous city in Nebraska and the 73rd-largest in the United States. The city is the economic and cultural anchor of a substantially larger metropolitan area in the southeastern part of the state called the Lincoln Metropolitan and Lincoln-Beatrice Combined Statistical Areas. The statistical area is home to 361,921 people, making it the 104th-largest combined statistical area in the United States.\n",
        "full_name": "Deb Fischer",
        "img": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Deb_Fischer%2C_official_portrait%2C_115th_Congress.jpg"
    },
    "Ben_Sasse": {
        "handle": "BenSasse",
        "state": "Nebraska",
        "capital_city": "Lincoln",
        "latitude": "40.808075",
        "longitude": "-96.699654",
        "wiki_html": "[<p><b>Benjamin Eric Sasse</b> (<span class=\"rt-commentedText nowrap\"><small> </small><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'s' in 'sigh'\">s</span><span title=\"/æ/: 'a' in 'bad'\">æ</span><span title=\"'s' in 'sigh'\">s</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">SASS</span></i>;<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> born February 22, 1972) is an American politician serving as the junior United States senator for Nebraska since 2015. He is a member of the Republican Party. \n</p> <p>Born in Plainview, Nebraska, Sasse holds a bachelor's degree in government from Harvard University, a Master of Arts in liberal studies from St. John's College and master's and doctoral degrees in American history from Yale University. He taught at the University of Texas and served as an assistant secretary in the U.S. Department of Health and Human Services.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup>\n</p> <p>In 2010, Sasse was named the 15th president of Midland University in Fremont, Nebraska. In 2014, he ran for a vacant seat in the U.S. Senate, defeating Democratic nominee David Domina, 65% to 31%.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup> In 2020, Sasse was reelected to a second term. On February 13, 2021, Sasse was one of seven Republican senators to vote to convict Donald Trump of incitement of insurrection in his second impeachment trial.\n</p>]",
        "capital_summary": "Lincoln is the capital city of the U.S. state of Nebraska and the county seat of Lancaster County. The city covers 99.050 square miles  with a population of 291,082 in 2020. It is the second-most populous city in Nebraska and the 73rd-largest in the United States. The city is the economic and cultural anchor of a substantially larger metropolitan area in the southeastern part of the state called the Lincoln Metropolitan and Lincoln-Beatrice Combined Statistical Areas. The statistical area is home to 361,921 people, making it the 104th-largest combined statistical area in the United States.\n",
        "full_name": "Ben Sasse",
        "img": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Ben_Sasse_Official_photo_114th_congress.jpg"
    },
    "Catherine_Cortez_Masto": {
        "handle": "SenCortezMasto",
        "state": "Nevada",
        "capital_city": "Carson City",
        "latitude": "39.163914",
        "longitude": "-119.766121",
        "wiki_html": "[<p><b>Catherine Marie Cortez Masto</b> (born March 29, 1964) is an American lawyer and politician serving as the senior United States senator from Nevada since 2017. A member of the Democratic Party, she was the 32nd attorney general of Nevada from 2007 to 2015.\n</p> <p>Cortez Masto graduated from University of Nevada, Reno, and Gonzaga University School of Law. She worked four years as a civil attorney in Las Vegas and two years as a criminal prosecutor for the U.S. Attorney's Office in Washington, D.C., before being elected Nevada attorney general in 2006, replacing George Chanos. Reelected in 2010, she was not eligible to run for a third term in 2014 because of lifetime term limits established by the Constitution of Nevada.\n</p> <p>Cortez Masto narrowly defeated Republican Joe Heck in the 2016 United States Senate election in Nevada to replace outgoing Democratic senator Harry Reid, becoming the first woman elected to represent Nevada in the Senate and the first Latina elected to serve in the upper chamber.<sup class=\"reference\" id=\"cite_ref-politico_1-0\">[1]</sup> She took office on January 3, 2017, and became Nevada's senior senator in January 2019, when Dean Heller left the Senate following his defeat.\n</p>]",
        "capital_summary": "Carson City, officially the Consolidated Municipality of Carson City, is an independent city and the capital of the U.S. state of Nevada, named after the mountain man Kit Carson. As of the 2020 census, the population was 58,639, making it the sixth largest city in Nevada. The majority of the city's population lives in Eagle Valley, on the eastern edge of the Carson Range, a branch of the Sierra Nevada, about 30 miles  south of Reno.\n",
        "full_name": "Catherine Cortez Masto",
        "img": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Catherine_Cortez_Masto_official_portrait.jpg"
    },
    "Jacky_Rosen": {
        "handle": "SenDeanHeller",
        "state": "Nevada",
        "capital_city": "Carson City",
        "latitude": "39.163914",
        "longitude": "-119.766121",
        "wiki_html": "[<p><b>Jacklyn Sheryl Rosen</b> (née <b>Spektor</b>; born August 2, 1957) is an American politician serving as the junior United States senator from Nevada since 2019. A member of the Democratic Party, she was the U.S. representative for Nevada's 3rd congressional district from 2017 to 2019.\n</p> <p>Rosen was elected to the Senate in 2018, defeating Republican incumbent Dean Heller.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> She was the only House freshman to win a Senate seat in the 2018 midterm elections and the only challenger to defeat a Republican incumbent senator in 2018.\n</p>]",
        "capital_summary": "Carson City, officially the Consolidated Municipality of Carson City, is an independent city and the capital of the U.S. state of Nevada, named after the mountain man Kit Carson. As of the 2020 census, the population was 58,639, making it the sixth largest city in Nevada. The majority of the city's population lives in Eagle Valley, on the eastern edge of the Carson Range, a branch of the Sierra Nevada, about 30 miles  south of Reno.\n",
        "full_name": "Jacky Rosen",
        "img": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Jacky_Rosen%2C_official_portrait%2C_116th_congress.jpg"
    },
    "Jeanne_Shaheen": {
        "handle": "SenatorShaheen",
        "state": "New Hampshire",
        "capital_city": "Concord",
        "latitude": "43.206898",
        "longitude": "-71.537994",
        "wiki_html": "[<p><b>Cynthia Jeanne Shaheen</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ʃ/: 'sh' in 'shy'\">ʃ</span><span title=\"/ə/: 'a' in 'about'\">ə</span><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'h' in 'hi'\">h</span><span title=\"/iː/: 'ee' in 'fleece'\">iː</span><span title=\"'n' in 'nigh'\">n</span></span>/</span></span> <i title=\"English pronunciation respelling\">shə-<span style=\"font-size:90%\">HEEN</span></i>; née <b>Bowers</b>, born January 28, 1947) is an American politician and retired educator serving as the senior United States senator from New Hampshire since 2009. A member of the Democratic Party, she is the first female U.S. senator in New Hampshire's history, the first elected female governor of New Hampshire and the first woman elected as both a governor and a U.S. senator, with the junior senator from New Hampshire and former governor of the state Maggie Hassan being the second woman to have occupied both of those roles.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup>\n</p> <p>After serving two terms in the New Hampshire Senate, Shaheen was elected governor in 1996 and reelected in 1998 and 2000. In 2002, she ran for the United States Senate unsuccessfully against Republican nominee John E. Sununu. She served as director of the Harvard Institute of Politics before resigning to run for the U.S. Senate again in the 2008 election, defeating Sununu in a rematch. She is the dean of New Hampshire's congressional delegation, serving in Congress since 2009.\n</p> <p>Shaheen became the first Democratic senator from New Hampshire since John A. Durkin, who was defeated in 1980. In 2014, she became the second Democrat from New Hampshire to be reelected to the U.S. Senate and the first since Thomas J. McIntyre in 1972. She was reelected to a third term in 2020, defeating Republican Bryant Messner.\n</p>]",
        "capital_summary": "Concord is the capital city of the U.S. state of New Hampshire and the county seat of Merrimack County. As of the 2020 census the population was 43,976, making it the third largest city in New Hampshire behind Manchester and Nashua.",
        "full_name": "Jeanne Shaheen",
        "img": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Jeanne_Shaheen%2C_official_Senate_photo_portrait%2C_2009.jpg"
    },
    "Maggie_Hassan": {
        "handle": "SenatorHassan",
        "state": "New Hampshire",
        "capital_city": "Concord",
        "latitude": "43.206898",
        "longitude": "-71.537994",
        "wiki_html": "[<p><b>Margaret Coldwell Hassan</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'h' in 'hi'\">h</span><span title=\"/æ/: 'a' in 'bad'\">æ</span><span title=\"'s' in 'sigh'\">s</span><span title=\"/ə/: 'a' in 'about'\">ə</span><span title=\"'n' in 'nigh'\">n</span></span>/</span></span>; née <b>Wood</b>; born February 27, 1958)<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup><sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> is an American politician and attorney serving as the junior United States senator from New Hampshire. A Democrat, Hassan was elected to the Senate in 2016 while she was serving as the 81st governor of New Hampshire, an office she held from 2013 to 2017.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup>\n</p> <p>Born in Boston, Massachusetts, Hassan is a graduate of Brown University and Northeastern University School of Law. After graduating from law school in 1985, she worked at the law firm Palmer &amp; Dodge. She later worked as associate general counsel for Brigham and Women’s Hospital.<sup class=\"reference\" id=\"cite_ref-4\">[4]</sup>\n</p> <p>Hassan first ran for the New Hampshire Senate in 2002.<sup class=\"reference\" id=\"cite_ref-atlantic_5-0\">[5]</sup><sup class=\"reference\" id=\"cite_ref-:0_6-0\">[6]</sup> She lost to incumbent Russell Prescott, but ran against Prescott again in 2004 and won.<sup class=\"reference\" id=\"cite_ref-:1_7-0\">[7]</sup><sup class=\"reference\" id=\"cite_ref-:2_8-0\">[8]</sup> Hassan was elected to a total of three two-year terms, representing New Hampshire's 23rd district from January 2005 to December 2010. She became the majority leader in 2008 before losing reelection in a 2010 rematch with Prescott.<sup class=\"reference\" id=\"cite_ref-exeter_9-0\">[9]</sup>\n</p> <p>Hassan declared her candidacy for governor in October 2011. She defeated former state senator Jacalyn Cilley in the Democratic primary and faced the Republican nominee, attorney Ovide M. Lamontagne, in the general election. Hassan won with 55% of the vote, becoming the state's second female governor. She was reelected in 2014. After becoming governor, Hassan was elected vice chair of the Democratic Governors Association and served as a superdelegate at the Democratic National Convention.<sup class=\"reference\" id=\"cite_ref-:0_6-1\">[6]</sup>\n</p> <p>In 2016, Hassan ran for the U.S. Senate and narrowly defeated Kelly Ayotte, the Republican incumbent, by about a thousand votes (about 0.1% of the total).<sup class=\"reference\" id=\"cite_ref-10\">[10]</sup><sup class=\"reference\" id=\"cite_ref-11\">[11]</sup> She is serving with Jeanne Shaheen, another former governor. Hassan and Shaheen are the only two women in American history to be elected both governor and U.S. senator, and both coincidentally in the same state.<sup class=\"reference\" id=\"cite_ref-12\">[12]</sup>\n</p>]",
        "capital_summary": "Concord is the capital city of the U.S. state of New Hampshire and the county seat of Merrimack County. As of the 2020 census the population was 43,976, making it the third largest city in New Hampshire behind Manchester and Nashua.",
        "full_name": "Maggie Hassan",
        "img": "https://upload.wikimedia.org/wikipedia/commons/3/37/Maggie_Hassan%2C_official_portrait%2C_115th_Congress.jpg"
    },
    "Bob_Menendez": {
        "handle": "SenatorMenendez",
        "state": "New Jersey",
        "capital_city": "Trenton",
        "latitude": "40.220596",
        "longitude": "-74.769913",
        "wiki_html": "[<p><b>Robert Menendez</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"'m' in 'my'\">m</span><span title=\"/ɛ/: 'e' in 'dress'\">ɛ</span><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'n' in 'nigh'\">n</span><span title=\"/ɛ/: 'e' in 'dress'\">ɛ</span><span title=\"'n' in 'nigh'\">n</span><span title=\"'d' in 'dye'\">d</span><span title=\"/ɛ/: 'e' in 'dress'\">ɛ</span><span title=\"'z' in 'zoom'\">z</span></span>/</span></span>; born January 1, 1954) is an American lawyer and politician serving as the senior United States senator from New Jersey, a seat he has held since 2006.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> A member of the Democratic Party, he was first appointed to the U.S. Senate by Governor Jon Corzine, and chaired the United States Senate Committee on Foreign Relations from 2013 to 2015, and again since 2021.\n</p> <p>In 1974, at the age of 20, Menendez was elected to the Union City School District's Board of Education. He received degrees from Saint Peter's University and Rutgers Law School. In 1986, he was elected mayor of Union City. In 1988, while continuing to serve as mayor, he was elected to represent the state's 33rd district in the New Jersey General Assembly and, within three years, moved to the New Jersey Senate, upon winning the March 1991 special election for the 33rd Senate district. The next year, Menendez won a seat in the House of Representatives and represented New Jersey's 13th congressional district for six two-year terms, from 1993 to 2006. In January 2006, he was appointed to fill the U.S. Senate seat being vacated by Jon Corzine (who had been elected governor of New Jersey), and was elected to a full six-year term in November; he was reelected in 2012 and 2018.\n</p> <p>In 2015, Menendez was indicted on federal corruption charges, which were dropped in 2018. The United States Senate Select Committee on Ethics \"severely admonished\" him.\n</p>]",
        "capital_summary": "Trenton is the capital city of the U.S. state of New Jersey and the county seat of Mercer County. It briefly served as the capital of the United States in 1784. The city's metropolitan area, consisting of Mercer County, is grouped with the New York Combined Statistical Area by the United States Census Bureau, but it directly borders the Philadelphia metropolitan area and was from 1990 until 2000 part of the Philadelphia Combined Statistical Area. As of the 2010 United States Census, Trenton had a population of 84,913, making it the state's 10th-largest municipality in 2010 and 2020, after having been the state's ninth-largest municipality in 2000. The population declined by 490  from the 85,403 counted in the 2000 Census, which had in turn declined by 3,272  from the 88,675 counted in the 1990 Census. The Census Bureau's Population Estimates Program calculated that the city's population was 83,203 in 2019, ranking the city the 413th-most-populous in the country.\n",
        "full_name": "Bob Menendez",
        "img": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Robert_Menendez_official_Senate_portrait.jpg"
    },
    "Cory_Booker": {
        "handle": "CoryBooker",
        "state": "New Jersey",
        "capital_city": "Trenton",
        "latitude": "40.220596",
        "longitude": "-74.769913",
        "wiki_html": "[<p><img alt=\"Cory Booker's signature\" data-file-height=\"109\" data-file-width=\"416\" decoding=\"async\" height=\"41\" src=\"//upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Cory_Booker_Signature.svg/155px-Cory_Booker_Signature.svg.png\" srcset=\"//upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Cory_Booker_Signature.svg/233px-Cory_Booker_Signature.svg.png 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Cory_Booker_Signature.svg/310px-Cory_Booker_Signature.svg.png 2x\" width=\"155\"/>\n</p> <p><b>Cory Anthony Booker</b> (born April 27, 1969)<sup class=\"reference\" id=\"cite_ref-:1_1-0\">[1]</sup><sup class=\"reference\" id=\"cite_ref-path_2-0\">[2]</sup> is an American politician, attorney, and author who has served as the junior United States senator from New Jersey since 2013. A member of the Democratic Party, Booker is the first African-American U.S. senator from New Jersey. He was the 38th mayor of Newark from 2006 to 2013, and served on the Municipal Council of Newark for the Central Ward from 1998 to 2002.\n</p> <p>Booker was born in Washington, D.C., and raised in Harrington Park, New Jersey. He attended Stanford University, receiving a BA in 1991 and a master's degree a year later. He attended Queen's College, Oxford on a Rhodes Scholarship before attending Yale Law School. He won an upset victory for a seat on the Municipal Council of Newark in 1998, staging a 10-day hunger strike and briefly living in a tent to draw attention to urban development issues in the city. He ran for mayor in 2002 but lost to incumbent Sharpe James. He ran again in 2006 and defeated Deputy Mayor Ronald Rice. Booker's first term saw the doubling of affordable housing under development and the reduction of the city budget deficit from $180 million to $73 million. He was reelected in 2010. He was elected to the U.S. Senate in a 2013 special election and reelected in 2014 and in 2020.\n</p> <p>Throughout his Senate tenure, Booker has written, sponsored, and passed legislation advancing women's rights, affirmative action, same-sex marriage, and single-payer healthcare. He has pushed for economic reforms to address wealth inequality in the U.S., particularly the racial wealth gap. Booker has pursued measures to reform the criminal justice system, combat climate change, and restructure national immigration policy. In foreign policy, he has voted successfully for tougher sanctions against Iran, voiced support for the withdrawal of U.S. troops from Afghanistan, and lobbied for increased diplomacy in the Middle East. He was the first senator to ever testify against another senator during attorney general nominee Jeff Sessions's 2017 confirmation hearing. Booker was a candidate for the Democratic nomination in the 2020 U.S. presidential election, suspending his campaign on January 13, 2020.\n</p>]",
        "capital_summary": "Trenton is the capital city of the U.S. state of New Jersey and the county seat of Mercer County. It briefly served as the capital of the United States in 1784. The city's metropolitan area, consisting of Mercer County, is grouped with the New York Combined Statistical Area by the United States Census Bureau, but it directly borders the Philadelphia metropolitan area and was from 1990 until 2000 part of the Philadelphia Combined Statistical Area. As of the 2010 United States Census, Trenton had a population of 84,913, making it the state's 10th-largest municipality in 2010 and 2020, after having been the state's ninth-largest municipality in 2000. The population declined by 490  from the 85,403 counted in the 2000 Census, which had in turn declined by 3,272  from the 88,675 counted in the 1990 Census. The Census Bureau's Population Estimates Program calculated that the city's population was 83,203 in 2019, ranking the city the 413th-most-populous in the country.\n",
        "full_name": "Cory Booker",
        "img": "https://upload.wikimedia.org/wikipedia/commons/5/59/Cory_Booker%2C_official_portrait%2C_114th_Congress.jpg"
    },
    "Martin_Heinrich": {
        "handle": "MartinHeinrich",
        "state": "New Mexico",
        "capital_city": "Santa Fe",
        "latitude": "35.68224",
        "longitude": "-105.939728",
        "wiki_html": "[<p><b>Martin Trevor Heinrich</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'h' in 'hi'\">h</span><span title=\"/aɪ/: 'i' in 'tide'\">aɪ</span><span title=\"'n' in 'nigh'\">n</span><span title=\"'r' in 'rye'\">r</span><span title=\"/ɪ/: 'i' in 'kit'\">ɪ</span><span title=\"'k' in 'kind'\">k</span></span>/</span></span>; born October 17, 1971) is an American politician and businessman serving as the senior United States senator from New Mexico, a seat he has held since 2013.\n</p> <p>A native of Fallon, Nevada, Heinrich lived much of his adulthood in Albuquerque, New Mexico, and maintains a residence there along with his work residence in Silver Spring, Maryland.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup><sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> As a member of the Democratic Party, he was the U.S. representative for <span data-sort-value=\"New Mexico01 !\">New Mexico's 1st congressional district</span> from 2009 to 2013. He then won the Senate seat vacated by retiring Senator Jeff Bingaman in 2012. Heinrich was mentioned as a possible nominee for Vice President of the United States in 2016 under Democratic presidential nominee Hillary Clinton.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup> He is the dean of New Mexico's congressional delegation.\n</p>]",
        "capital_summary": "Santa Fe is widely considered one of the world's great art cities, due to its many art galleries and installations, and it is recognized by UNESCO's Creative Cities Network. Its cultural highlights include Santa Fe Plaza, the Palace of the Governors, the Fiesta de Santa Fe, numerous restaurants featuring distinctive New Mexican cuisine, and performances of New Mexico music. Among its many art galleries and installations are the Georgia O'Keeffe Museum, a gallery by cartoonist Chuck Jones, and newer art collectives such as Meow Wolf.\n",
        "full_name": "Martin Heinrich",
        "img": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Heinrich_Official_Headshot_2019.jpg"
    },
    "Ben_Ray_Luj%C3%A1n": {
        "handle": "SenatorTomUdall",
        "state": "New Mexico",
        "capital_city": "Santa Fe",
        "latitude": "35.68224",
        "longitude": "-105.939728",
        "wiki_html": "[<p><b>Ben Ray Luján</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"'l' in 'lie'\">l</span><span title=\"/uː/: 'oo' in 'goose'\">uː</span><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'h' in 'hi'\">h</span><span title=\"/ɑː/: 'a' in 'father'\">ɑː</span><span title=\"'n' in 'nigh'\">n</span></span>/</span></span> <i title=\"English pronunciation respelling\">loo-<span style=\"font-size:90%\">HAHN</span></i>;<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> born June 7, 1972) is an American politician who has served as the junior United States senator from New Mexico since 2021. He served as the U.S. representative for <span data-sort-value=\"New Mexico03 !\">New Mexico's 3rd congressional district</span> from 2009 to 2021 and the assistant House Democratic leader (officially the \"Assistant Speaker\") from 2019 to 2021. He served as a member of the New Mexico Public Regulation Commission from 2005 to 2008, where he also served as chairman. \n</p> <p>Luján was selected as chairman of the Democratic Congressional Campaign Committee (DCCC) in 2014 and led the Democrats to win a House majority in the 2018 elections. He was the first Hispanic to serve in this role.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup> In his role as assistant House Democratic leader, Luján was the highest-ranking Latino in Congress.\n</p> <p>On April 1, 2019, Luján announced his intention to seek the United States Senate seat being vacated by two-term Democratic incumbent Tom Udall in the 2020 election.<sup class=\"reference\" id=\"cite_ref-Senate_4-0\">[4]</sup> He defeated Republican Mark Ronchetti in the general election on November 3, 2020,<sup class=\"reference\" id=\"cite_ref-5\">[5]</sup><sup class=\"reference\" id=\"cite_ref-6\">[6]</sup> and took office on January 3, 2021.\n</p>]",
        "capital_summary": "Santa Fe is widely considered one of the world's great art cities, due to its many art galleries and installations, and it is recognized by UNESCO's Creative Cities Network. Its cultural highlights include Santa Fe Plaza, the Palace of the Governors, the Fiesta de Santa Fe, numerous restaurants featuring distinctive New Mexican cuisine, and performances of New Mexico music. Among its many art galleries and installations are the Georgia O'Keeffe Museum, a gallery by cartoonist Chuck Jones, and newer art collectives such as Meow Wolf.\n",
        "full_name": "Ben Ray Luj%C3%A1n",
        "img": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Ben_Ray_Lujan%2C_117th_Congress_portrait_2.jpg"
    },
    "Chuck_Schumer": {
        "handle": "SenSchumer",
        "state": "North Carolina",
        "capital_city": "Raleigh",
        "latitude": "35.78043",
        "longitude": "-78.639099",
        "wiki_html": "[<p><b>Charles Ellis Schumer</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"/ʃ/: 'sh' in 'shy'\">ʃ</span><span title=\"/uː/: 'oo' in 'goose'\">uː</span><span title=\"'m' in 'my'\">m</span><span title=\"/ər/: 'er' in 'letter'\">ər</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">SHOO</span>-mər</i>; born November 23, 1950) is an American politician serving as Senate Majority Leader since January 20, 2021.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> A member of the Democratic Party, Schumer is the senior United States senator from New York, a seat he has held since 1999. He is the dean of New York's congressional delegation.\n</p> <p>A native of Brooklyn and a graduate of Harvard College and Harvard Law School, Schumer was a three-term member of the New York State Assembly from 1975 to 1980. He served in the United States House of Representatives from 1981 to 1999, first representing New York's 16th congressional district before being redistricted to the 10th congressional district in 1983 and 9th congressional district ten years later. In 1998, Schumer was elected to the Senate, defeating three-term Republican incumbent Al D'Amato. He was reelected in 2004 with 71% of the vote, in 2010 with 66% of the vote, and in 2016 with 70% of the vote.\n</p> <p>Schumer chaired the Democratic Senatorial Campaign Committee from 2005 to 2009, overseeing 14 Democratic gains in the Senate in the 2006 and 2008 elections. He was the third-ranking Democrat in the Senate, behind Senate Majority Leader Harry Reid and Majority Whip Dick Durbin. He served as Vice Chair of the Democratic Caucus in the Senate from 2007 to 2017<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup> and chaired the Senate Democratic Policy Committee from 2011 to 2017.<sup class=\"reference\" id=\"cite_ref-4\">[4]</sup> Schumer won his fourth term in the Senate in 2016 and was then unanimously elected Democratic leader to succeed Harry Reid, who was retiring.<sup class=\"reference\" id=\"cite_ref-5\">[5]</sup><sup class=\"reference\" id=\"cite_ref-6\">[6]</sup>\n</p> <p>In January 2021, Schumer became Senate Majority Leader, and the first Jewish-American leader of either chamber of Congress.\n</p>]",
        "capital_summary": "Albany is the capital of the U.S. state of New York, and the seat and largest city of Albany County. Albany is on the west bank of the Hudson River, about 10 miles  south of its confluence with the Mohawk River, and about 135 miles  north of New York City.\n",
        "full_name": "Chuck Schumer",
        "img": "https://upload.wikimedia.org/wikipedia/commons/8/89/Chuck_Schumer_official_photo.jpg"
    },
    "Kirsten_Gillibrand": {
        "handle": "SenGillibrand",
        "state": "North Carolina",
        "capital_city": "Raleigh",
        "latitude": "35.78043",
        "longitude": "-78.639099",
        "wiki_html": "[<p><img alt=\"Kirsten Gillibrand Signature.svg\" data-file-height=\"106\" data-file-width=\"512\" decoding=\"async\" height=\"28\" src=\"//upload.wikimedia.org/wikipedia/commons/thumb/1/15/Kirsten_Gillibrand_Signature.svg/135px-Kirsten_Gillibrand_Signature.svg.png\" srcset=\"//upload.wikimedia.org/wikipedia/commons/thumb/1/15/Kirsten_Gillibrand_Signature.svg/203px-Kirsten_Gillibrand_Signature.svg.png 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/1/15/Kirsten_Gillibrand_Signature.svg/270px-Kirsten_Gillibrand_Signature.svg.png 2x\" width=\"135\"/>\n</p> <p><b>Kirsten Elizabeth Gillibrand</b> (<span title=\"Name at birth\">née</span><span class=\"nowrap\"> </span><b>Rutnik</b>;<sup class=\"reference\" id=\"cite_ref-Fast_Facts_1-0\">[1]</sup> <span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'k' in 'kind'\">k</span><span title=\"/ɪər/: 'ear' in 'near'\">ɪər</span><span title=\"'s' in 'sigh'\">s</span><span title=\"'t' in 'tie'\">t</span><span title=\"/ən/: 'on' in 'button'\">ən</span></span><span class=\"wrap\"> </span><span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"/dʒ/: 'j' in 'jam'\">dʒ</span><span title=\"/ɪ/: 'i' in 'kit'\">ɪ</span><span title=\"'l' in 'lie'\">l</span><span title=\"/ɪ/: 'i' in 'kit'\">ɪ</span><span title=\"'b' in 'buy'\">b</span><span title=\"'r' in 'rye'\">r</span><span title=\"/æ/: 'a' in 'bad'\">æ</span><span title=\"'n' in 'nigh'\">n</span><span title=\"'d' in 'dye'\">d</span></span>/</span> <span class=\"nowrap\" style=\"font-size:85%\">(<span class=\"unicode haudio\"><span class=\"fn\"><span style=\"white-space:nowrap;margin-right:.25em;\"><img alt=\"audio speaker icon\" data-file-height=\"20\" data-file-width=\"20\" decoding=\"async\" height=\"11\" src=\"//upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Loudspeaker.svg/11px-Loudspeaker.svg.png\" srcset=\"//upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Loudspeaker.svg/17px-Loudspeaker.svg.png 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Loudspeaker.svg/22px-Loudspeaker.svg.png 2x\" width=\"11\"/></span>listen</span></span>)</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">KEER</span>-stən <span style=\"font-size:90%\">JIL</span>-i-brand</i>; born December 9, 1966) is an American lawyer and politician serving as the junior United States senator from New York since 2009. A member of the Democratic Party, she served as member of the U.S. House of Representatives from 2007 to 2009.\n</p> <p>Born and raised in upstate New York, Gillibrand graduated from Dartmouth College and from the UCLA School of Law. After holding positions in government and private practice and working on Hillary Clinton's 2000 U.S. Senate campaign, Gillibrand was elected to the United States House of Representatives in 2006. She represented New York's 20th congressional district and was reelected in 2008. During her House tenure, Gillibrand was a Blue Dog Democrat noted for voting against the Emergency Economic Stabilization Act of 2008.\n</p> <p>After Clinton was appointed U.S. Secretary of State in 2009, Governor David Paterson selected Gillibrand to fill the Senate seat Clinton had vacated, making her New York's second female senator. Gillibrand won a special election in 2010 to keep the seat, and was reelected to full terms in 2012 and 2018. During her Senate tenure, Gillibrand has shifted to the left. She has been outspoken on sexual assault in the military and sexual harassment, having criticized President Bill Clinton, Senator Al Franken, and Governor Andrew Cuomo, all fellow Democrats, for alleged sexual misconduct. She supports paid family leave, a federal jobs guarantee, and the abolition and replacement of the U.S. Immigration and Customs Enforcement.\n</p> <p>Gillibrand ran for the Democratic nomination for president of the United States in 2020, officially announcing her candidacy on March 17, 2019. After failing to qualify for the third debate, she withdrew from the race on August 28, 2019.\n</p>]",
        "capital_summary": "Albany is the capital of the U.S. state of New York, and the seat and largest city of Albany County. Albany is on the west bank of the Hudson River, about 10 miles  south of its confluence with the Mohawk River, and about 135 miles  north of New York City.\n",
        "full_name": "Kirsten Gillibrand",
        "img": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Kirsten_Gillibrand%2C_official_photo%2C_116th_Congress.jpg"
    },
    "Richard_Burr": {
        "handle": "SenatorBurr",
        "state": "North Dakota",
        "capital_city": "Bismarck",
        "latitude": "46.82085",
        "longitude": "-100.783318",
        "wiki_html": "[<p><b>Richard Mauze Burr</b> (born November 30, 1955) is an American businessman and politician who is the senior United States senator from North Carolina, serving since 2005. A member of the Republican Party, Burr was previously a member of the United States House of Representatives. He is the dean of North Carolina's congressional delegation.\n</p> <p>Born in Charlottesville, Virginia, Burr is a graduate of Wake Forest University. Before seeking elected office, he was a sales manager for a lawn equipment company.<sup class=\"reference\" id=\"cite_ref-:2_1-0\">[1]</sup> In 1994, he was elected to the U.S. House of Representatives for North Carolina's 5th congressional district as part of the Republican Revolution.\n</p> <p>Burr was first elected to the United States Senate in 2004. From 2015 to 2020, he chaired the Senate Intelligence Committee. In 2016, he announced that he would not seek reelection in 2022.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> Burr temporarily stepped down as chair of the Intelligence Committee on May 15, 2020, amid an FBI investigation into allegations of insider trading during the COVID-19 pandemic.<sup class=\"reference\" id=\"cite_ref-stepdown_3-0\">[3]</sup> On January 19, 2021, the Department of Justice announced that the investigation had been closed, with no charges against Burr.<sup class=\"reference\" id=\"cite_ref-auto_4-0\">[4]</sup>\n</p> <p>Burr was one of seven Republican senators to vote to convict Donald Trump of incitement of insurrection in his second impeachment trial.<sup class=\"reference\" id=\"cite_ref-5\">[5]</sup>\n</p>]",
        "capital_summary": "Raleigh is the capital of the state of North Carolina and the seat of Wake County in the United States. It is the second-most populous city in North Carolina, the 41st-most populous city in the U.S., and the largest city of the Research Triangle metro area. Raleigh is known as the \"City of Oaks\" for its many oak trees, which line the streets in the heart of the city. The city covers a land area of 147.6 square miles . The U.S. Census Bureau counted the city's population as 474,069 in 2020. It is one of the fastest-growing cities in the country. The city of Raleigh is named after Walter Raleigh, who established the lost Roanoke Colony in present-day Dare County.\n",
        "full_name": "Richard Burr",
        "img": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Richard_Burr_official_portrait.jpg"
    },
    "Thom_Tillis": {
        "handle": "SenThomTillis",
        "state": "North Dakota",
        "capital_city": "Bismarck",
        "latitude": "46.82085",
        "longitude": "-100.783318",
        "wiki_html": "[<p><b>Thomas Roland Tillis</b><sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> (born August 30, 1960) is an American politician serving as the junior United States senator from North Carolina since 2015. A Republican, he was elected to the North Carolina House of Representatives in 2006, and began serving as the speaker in 2011. He was elected to the United States Senate in 2014, defeating Democratic incumbent Kay Hagan,<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> and reelected in 2020, defeating Democratic nominee Cal Cunningham.<sup class=\"reference\" id=\"cite_ref-vox_3-0\">[3]</sup><sup class=\"reference\" id=\"cite_ref-4\">[4]</sup>\n</p> <p>As speaker of the North Carolina House of Representatives, Tillis led the Republican effort to block the expansion of Medicaid and worked to introduce restrictions on abortion, stringent voting requirements, and a constitutional amendment banning same-sex marriage. In the Senate, he has repeatedly voted to repeal the Affordable Care Act; he introduced a bill intended to protect coverage for preexisting conditions but it was undermined by loopholes and failed to match the ACA's protections. On immigration, he proposed a 15-year pathway to citizenship for some undocumented youth as a more conservative alternative to the bipartisan DREAM Act. He initially opposed President Trump's national emergency declaration to divert funding to a border wall, but voted for it after pressure from his party. Having previously denied that climate change is occurring, he has since acknowledged it, but opposes the Paris Agreement and the Clean Power Plan.\n</p>]",
        "capital_summary": "Raleigh is the capital of the state of North Carolina and the seat of Wake County in the United States. It is the second-most populous city in North Carolina, the 41st-most populous city in the U.S., and the largest city of the Research Triangle metro area. Raleigh is known as the \"City of Oaks\" for its many oak trees, which line the streets in the heart of the city. The city covers a land area of 147.6 square miles . The U.S. Census Bureau counted the city's population as 474,069 in 2020. It is one of the fastest-growing cities in the country. The city of Raleigh is named after Walter Raleigh, who established the lost Roanoke Colony in present-day Dare County.\n",
        "full_name": "Thom Tillis",
        "img": "https://upload.wikimedia.org/wikipedia/commons/0/01/Sen._Thom_Tillis_official_photo.jpg"
    },
    "John_Hoeven": {
        "handle": "SenJohnHoeven",
        "state": "New York",
        "capital_city": "Albany",
        "latitude": "42.652843",
        "longitude": "-73.757874",
        "wiki_html": "[<p><b>John Henry Hoeven III</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'h' in 'hi'\">h</span><span title=\"/oʊ/: 'o' in 'code'\">oʊ</span><span title=\"'v' in 'vie'\">v</span><span title=\"/ə/: 'a' in 'about'\">ə</span><span title=\"'n' in 'nigh'\">n</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">HO</span>-ven</i>; born March 13, 1957) is an American banker and politician serving as the senior U.S. senator from North Dakota since 2011. A Republican, he served as the 31st governor of North Dakota from 2000 to 2010. In 2010, Hoeven was elected to the U.S. Senate, succeeding Senator Byron Dorgan, who chose not to seek reelection. Hoeven became North Dakota's senior senator in 2013 after Kent Conrad retired and was succeeded by Heidi Heitkamp, who was once Hoeven's opponent for the governor's office. Hoeven was reelected in 2016.\n</p> <p>Before being elected governor, Hoeven was a banker who served in numerous executive roles at various banks, most notably as president of the nation's only state-owned bank, the Bank of North Dakota, from 1993 to 2000.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> He is on the board of directors at First Western Bank &amp; Trust and has an estimated net worth of $45 million, making him one of the wealthiest U.S. senators.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup><sup class=\"reference\" id=\"cite_ref-3\">[3]</sup><sup class=\"reference\" id=\"cite_ref-4\">[4]</sup> He is the dean of North Dakota's congressional delegation.\n</p>]",
        "capital_summary": "Bismarck was founded by European-Americans in 1872 on the east bank of the Missouri River. It has been North Dakota's capital city since 1889, when the state was created from the Dakota Territory and admitted to the Union.\n",
        "full_name": "John Hoeven",
        "img": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Hoeven_Official_Portrait_2014.JPG"
    },
    "Kevin_Cramer": {
        "handle": "SenatorHeitkamp",
        "state": "New York",
        "capital_city": "Albany",
        "latitude": "42.652843",
        "longitude": "-73.757874",
        "wiki_html": "[<p><b>Kevin John Cramer</b> (born January 21, 1961) is an American politician who has served as the junior United States senator for North Dakota since 2019. A member of the Republican Party, he represented North Dakota's at-large congressional district in the United States House of Representatives from 2013 to 2019. \n</p> <p>Cramer chaired the North Dakota Republican Party from 1991 to 1993 and served as State Tourism Director from 1993 to 1997 and Economic Development Director from 1997 to 2000. He served on the state's Public Service Commission from 2003 to 2012.\n</p>]",
        "capital_summary": "Bismarck was founded by European-Americans in 1872 on the east bank of the Missouri River. It has been North Dakota's capital city since 1889, when the state was created from the Dakota Territory and admitted to the Union.\n",
        "full_name": "Kevin Cramer",
        "img": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Kevin_Cramer%2C_official_portrait%2C_116th_congress_2.jpg"
    },
    "Sherrod_Brown": {
        "handle": "SenSherrodBrown",
        "state": "Ohio",
        "capital_city": "Columbus",
        "latitude": "39.961346",
        "longitude": "-82.999069",
        "wiki_html": "[<p><b>Sherrod Campbell Brown</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"/ʃ/: 'sh' in 'shy'\">ʃ</span><span title=\"/ɛr/: 'err' in 'merry'\">ɛr</span><span title=\"/ə/: 'a' in 'about'\">ə</span><span title=\"'d' in 'dye'\">d</span></span>/</span></span>; born November 9, 1952) is an American politician and retired educator serving as the senior United States senator from Ohio, a seat which he has held since 2007. A member of the Democratic Party, he was the U.S. representative for Ohio's 13th congressional district from 1993 to 2007 and the 47th secretary of state of Ohio from 1983 to 1991. He started his political career in 1975 as an Ohio state representative.\n</p> <p>Brown defeated two-term Republican incumbent Mike DeWine in the 2006 U.S. Senate election and was reelected in 2012, defeating state treasurer Josh Mandel, and in 2018, defeating U.S. representative Jim Renacci. In the Senate, he was chair of the Agriculture Subcommittee on Hunger, Nutrition and Family Farms and the Banking Subcommittee on Economic Policy, and is also a member of the Committee on Finance, the Committee on Veterans' Affairs, and Select Committee on Ethics. At the start of the 114th Congress in January 2015, Brown became the ranking Democratic member on the Committee on Banking, Housing, and Urban Affairs.<sup class=\"reference\" id=\"cite_ref-thehill_2-0\">[2]</sup> In January 2021, Brown became chair of the committee and initiated an inquiry into the implosion of Archegos Capital Management, an investment firm that was accused of fraud and insider trading and lost billions of dollars.<sup class=\"reference\" id=\"cite_ref-lfft_3-0\">[3]</sup>\n</p> <p>Brown became the state's senior U.S. senator after the retirement of George Voinovich in 2011. Since then, Brown has been the only Democratic statewide elected official in Ohio, although some statewide-elected Ohio Supreme Court justices are members of the Democratic Party but elected in nonpartisan races.<sup class=\"reference\" id=\"cite_ref-4\">[4]</sup>\n</p>]",
        "capital_summary": "Columbus is the state capital and the most populous city in the U.S. state of Ohio. With a population of 905,748 for the 2020 census, it is the 14th-most populous city in the U.S., the second-most populous city in the Midwest after Chicago, and the third-most populous state capital. Columbus is the county seat of Franklin County; it also extends into Delaware and Fairfield counties. It is the core city of the Columbus, OH Metropolitan Statistical Area, which encompasses ten counties. The metropolitan area has a 2020 population of 2,138,926, making it the largest entirely in Ohio.\n",
        "full_name": "Sherrod Brown",
        "img": "https://upload.wikimedia.org/wikipedia/commons/3/38/Sherrod_Brown_117th_Congress_%281%29.jpg"
    },
    "Rob_Portman": {
        "handle": "SenRobPortman",
        "state": "Ohio",
        "capital_city": "Columbus",
        "latitude": "39.961346",
        "longitude": "-82.999069",
        "wiki_html": "[<p><b>Robert Jones Portman</b> (born December 19, 1955) is an American attorney and politician serving as the junior United States senator for Ohio. A Republican, Portman has served as a U.S. representative, the 14th United States trade representative, and the 35th director of the Office of Management and Budget (OMB).\n</p> <p>In 1993, Portman won a special election to represent <span data-sort-value=\"Ohio02 !\">Ohio's 2nd congressional district</span> in the United States House of Representatives. He was reelected six times before resigning upon his appointment by President George W. Bush as the U.S. trade representative in May 2005. As trade representative, Portman initiated trade agreements with other countries and pursued claims at the World Trade Organization. In May 2006, Bush appointed Portman the director of the Office of Management and Budget.\n</p> <p>In 2010, Portman announced his candidacy for the United States Senate seat being vacated by George Voinovich. He easily defeated then-Lieutenant Governor Lee Fisher and was reelected in 2016. On January 25, 2021, he announced that he would not seek a third term in 2022.<sup class=\"reference\" id=\"cite_ref-cincinnati_1-0\">[1]</sup>\n</p>]",
        "capital_summary": "Columbus is the state capital and the most populous city in the U.S. state of Ohio. With a population of 905,748 for the 2020 census, it is the 14th-most populous city in the U.S., the second-most populous city in the Midwest after Chicago, and the third-most populous state capital. Columbus is the county seat of Franklin County; it also extends into Delaware and Fairfield counties. It is the core city of the Columbus, OH Metropolitan Statistical Area, which encompasses ten counties. The metropolitan area has a 2020 population of 2,138,926, making it the largest entirely in Ohio.\n",
        "full_name": "Rob Portman",
        "img": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Rob_Portman_official_portrait.jpg"
    },
    "Jim_Inhofe": {
        "handle": "jiminhofe",
        "state": "Oklahoma",
        "capital_city": "Oklahoma City",
        "latitude": "35.492207",
        "longitude": "-97.503342",
        "wiki_html": "[<p><b>James Mountain Inhofe</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"/ɪ/: 'i' in 'kit'\">ɪ</span><span title=\"'n' in 'nigh'\">n</span><span title=\"'h' in 'hi'\">h</span><span title=\"/ɒ/: 'o' in 'body'\">ɒ</span><span title=\"'f' in 'find'\">f</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">INN</span>-hoff</i>; born November 17, 1934) is an American businessman, politician, and soldier serving as the senior United States senator from Oklahoma, a seat he was first elected to in 1994. A member of the Republican Party, he chaired the U.S. Senate Committee on Environment and Public Works (EPW) from 2003 to 2007 and again from 2015 to 2017. Inhofe served as the U.S. representative for <span data-sort-value=\"Oklahoma01 !\">Oklahoma's 1st congressional district</span> from 1987 to 1994 and as mayor of Tulsa from 1978 to 1984.\n</p> <p>Inhofe is known for his rejection of climate science.<sup class=\"reference\" id=\"cite_ref-OUP_Dryzek_4-0\">[2]</sup> He has supported a constitutional amendment to ban same-sex marriage<sup class=\"reference\" id=\"cite_ref-5\">[3]</sup> and has proposed the Inhofe Amendment to make English the national language of the United States.<sup class=\"reference\" id=\"cite_ref-6\">[4]</sup>\n</p> <p>Inhofe served as acting chairman of the Armed Services Committee while John McCain fought cancer in 2018. After McCain's death, he became chairman.<sup class=\"reference\" id=\"cite_ref-7\">[5]</sup> Since February 2021, he has served as Ranking Member of the Senate Armed Services Committee.\n</p> <p>On July 15, 2021, Inhofe told <i>Tulsa World</i> he planned to retire at the end of his current term, in 2027.<sup class=\"reference\" id=\"cite_ref-InhofeTulsaWorld2021_8-0\">[6]</sup> In February 2022, <i>The New York Times</i> reported that Inhofe was planning to resign at the end of the 117th United States Congress.<sup class=\"reference\" id=\"cite_ref-9\">[7]</sup>\n</p> <p><br/></p> <p class=\"mw-empty-elt\">\n</p>]",
        "capital_summary": "Oklahoma City, officially the City of Oklahoma City, and often shortened to OKC, is the capital and largest city of the U.S. state of Oklahoma. The county seat of Oklahoma County, it ranks 22nd among United States cities in population, and is the 11th largest city in the Southern United States. The population grew following the 2010 census and reached 681,054 in the 2020 census. The Oklahoma City metropolitan area had a population of 1,396,445, and the Oklahoma City–Shawnee Combined Statistical Area had a population of 1,469,124, making it Oklahoma's largest municipality and metropolitan area by population.\n",
        "full_name": "Jim Inhofe",
        "img": "https://upload.wikimedia.org/wikipedia/commons/9/92/Jim_Inhofe_official_portrait.jpg"
    },
    "James_Lankford": {
        "handle": "SenatorLankford",
        "state": "Oklahoma",
        "capital_city": "Oklahoma City",
        "latitude": "35.492207",
        "longitude": "-97.503342",
        "wiki_html": "[<p><b>James Paul Lankford</b> (born March 4, 1968) is an American politician serving as the junior United States senator for Oklahoma since 2015. A member of the Republican Party, he previously served as the U.S. representative for <span data-sort-value=\"Oklahoma05 !\">Oklahoma's 5th congressional district</span> from 2011 to 2015.\n</p> <p>From 1996 to 2009, Lankford was the student ministries and evangelism specialist for the Baptist General Convention of Oklahoma and director of the youth programming at the Falls Creek Baptist Conference Center in Davis, Oklahoma.\n</p> <p>In January 2014, Lankford announced he would run in the 2014 U.S. Senate special election following Tom Coburn's planned resignation from the Senate. He won the June 2014 primary with 57% of the vote, becoming the Republican nominee. He won the special election with nearly 68% of the vote and was elected to the balance of Coburn's term. He was reelected in 2016, again with nearly 68% of the vote.\n</p> <p>In January 2021, Lankford announced he would object to the counting of some swing states' electoral votes as part of an attempt to overturn the 2020 U.S. presidential election. He reversed his position after the 2021 United States Capitol attack.\n</p>]",
        "capital_summary": "Oklahoma City, officially the City of Oklahoma City, and often shortened to OKC, is the capital and largest city of the U.S. state of Oklahoma. The county seat of Oklahoma County, it ranks 22nd among United States cities in population, and is the 11th largest city in the Southern United States. The population grew following the 2010 census and reached 681,054 in the 2020 census. The Oklahoma City metropolitan area had a population of 1,396,445, and the Oklahoma City–Shawnee Combined Statistical Area had a population of 1,469,124, making it Oklahoma's largest municipality and metropolitan area by population.\n",
        "full_name": "James Lankford",
        "img": "https://upload.wikimedia.org/wikipedia/commons/4/4c/James_Lankford_official_Senate_photo.jpg"
    },
    "Ron_Wyden": {
        "handle": "RonWyden",
        "state": "Oregon",
        "capital_city": "Salem",
        "latitude": "44.938461",
        "longitude": "-123.030403",
        "wiki_html": "[<p><b>U.S. Senator from Oregon</b>\n</p> <p><b>Ronald Lee Wyden</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'w' in 'wind'\">w</span><span title=\"/aɪ/: 'i' in 'tide'\">aɪ</span><span title=\"'d' in 'dye'\">d</span><span title=\"/ə/: 'a' in 'about'\">ə</span><span title=\"'n' in 'nigh'\">n</span></span>/</span></span>; born May 3, 1949) is an American politician and retired educator serving as the senior United States senator from Oregon, a seat he has held since 1996. A member of the Democratic Party, he served in the United States House of Representatives from 1981 until 1996. He is the dean of Oregon's congressional delegation.\n</p> <p>Wyden chairs the Senate Finance Committee.\n</p>]",
        "capital_summary": "Salem is the capital of the U.S. state of Oregon, and the county seat of Marion County. It is located in the center of the Willamette Valley alongside the Willamette River, which runs north through the city. The river forms the boundary between Marion and Polk counties, and the city neighborhood of West Salem is in Polk County. Salem was founded in 1842, became the capital of the Oregon Territory in 1851, and was incorporated in 1857.\n",
        "full_name": "Ron Wyden",
        "img": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Ron_Wyden_117th_Congress.jpeg"
    },
    "Jeff_Merkley": {
        "handle": "SenJeffMerkley",
        "state": "Oregon",
        "capital_city": "Salem",
        "latitude": "44.938461",
        "longitude": "-123.030403",
        "wiki_html": "[<p><b>Jeffrey Alan Merkley</b> (born October 24, 1956) is an American politician serving as the junior United States senator from Oregon since 2009. A member of the Democratic Party, Merkley served as the 64th speaker of the Oregon House of Representatives from 2007 to 2009. \n</p> <p>Before his election to the Senate, Merkley was a five-term member of the Oregon House of Representatives, representing the 47th district in central Multnomah County at the eastern side of Portland. Merkley defeated two-term Republican incumbent Gordon Smith in 2008 and was reelected in 2014 and 2020, defeating Republican nominees Monica Wehby and Jo Rae Perkins. \n</p> <p>Merkley has been an advocate of progressivism in the Senate, and was the only U.S. senator to endorse Bernie Sanders in the 2016 Democratic presidential primaries.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> He was considered a potential candidate for president in 2020, but he chose to run for reelection to the Senate instead.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup>\n</p>]",
        "capital_summary": "Salem is the capital of the U.S. state of Oregon, and the county seat of Marion County. It is located in the center of the Willamette Valley alongside the Willamette River, which runs north through the city. The river forms the boundary between Marion and Polk counties, and the city neighborhood of West Salem is in Polk County. Salem was founded in 1842, became the capital of the Oregon Territory in 1851, and was incorporated in 1857.\n",
        "full_name": "Jeff Merkley",
        "img": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Jeff_Merkley%2C_115th_official_photo.jpg"
    },
    "Bob_Casey_Jr.": {
        "handle": "SenBobCasey",
        "state": "Pennsylvania",
        "capital_city": "Harrisburg",
        "latitude": "40.264378",
        "longitude": "-76.883598",
        "wiki_html": "[<p><b>Robert Patrick Casey Jr.</b> (born April 13, 1960) is an American lawyer and politician serving as the senior United States senator from Pennsylvania, a seat he has held since 2007. He previously served as Pennsylvania Auditor General from 1997 to 2005 and as Pennsylvania Treasurer from 2005 to 2007.\n</p> <p>Born in Scranton, Pennsylvania, Casey is the son of Bob Casey, a former governor of Pennsylvania. After graduating from Scranton Preparatory School in 1978, he attended the College of the Holy Cross. He received his J.D. degree from The Catholic University of America Columbus School of Law. Casey practiced law in Scranton, Pennsylvania, before beginning his political career as Pennsylvania's auditor general, a post to which he was elected in 1996 and re-elected in 2000.\n</p> <p>In 2002, Casey attempted to follow in his father's footsteps by running for governor of Pennsylvania, but was defeated in the Democratic primary by eventual general election victor Ed Rendell. After being term-limited out of his position as auditor general, Casey was elected treasurer in the 2004 election. Casey defeated two-term Republican incumbent Rick Santorum in the 2006 U.S. Senate election in Pennsylvania. He was reelected in 2012 and 2018, becoming Pennsylvania's first ever Democrat to win a third consecutive term in the Senate.\n</p>]",
        "capital_summary": "Harrisburg lies on the east bank of the Susquehanna River. It is 83 miles  miles southwest of Allentown, Pennsylvania's third largest city, and 107 miles  northwest of Philadelphia, Pennsylvania's largest city. It is the two largest of two anchor cities of the Harrisburg–Carlisle metropolitan statistical area, also known as the Susquehanna Valley, which had a 2020 population of 591,712, making it the fourth most populous metropolitan area in Pennsylvania after the Philadelphia, Pittsburgh and Lehigh Valley metropolitan areas.  \n",
        "full_name": "Bob Casey Jr.",
        "img": "https://upload.wikimedia.org/wikipedia/commons/3/30/Bob_Casey_Jr._official_photo.jpg"
    },
    "Pat_Toomey": {
        "handle": "SenToomey",
        "state": "Pennsylvania",
        "capital_city": "Harrisburg",
        "latitude": "40.264378",
        "longitude": "-76.883598",
        "wiki_html": "[<p><b>Patrick Joseph Toomey Jr.</b> (born November 17, 1961) is an American businessman and politician serving as the junior United States senator for Pennsylvania since 2011.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> A member of the Republican Party, he served three terms as the U.S. representative for <span data-sort-value=\"Pennsylvania15 !\">Pennsylvania's 15th congressional district</span>, from 1999 to 2005. Honoring a pledge he had made while running for office in 1998, he did not seek a fourth term.<sup class=\"reference\" id=\"cite_ref-houseelect_2-0\">[2]</sup>\n</p> <p>Toomey graduated from Harvard College. A former Wall Street banker,<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup> Toomey narrowly lost the Republican primary for United States Senate in 2004. From 2005 to 2009, he served as president of the Club for Growth.<sup class=\"reference\" id=\"cite_ref-4\">[4]</sup> Toomey won the Republican primary for the 2010 U.S. Senate election in Pennsylvania, and was elected to the seat after defeating the Democratic nominee, former U.S. Navy three-star admiral and congressman Joe Sestak, in the general election.<sup class=\"reference\" id=\"cite_ref-5\">[5]</sup> He was reelected to the Senate in 2016, defeating Democratic nominee Katie McGinty.<sup class=\"reference\" id=\"cite_ref-6\">[6]</sup>\n</p> <p>On October 5, 2020, Toomey announced that he would not run for reelection to a third term in 2022 or for governor.<sup class=\"reference\" id=\"cite_ref-7\">[7]</sup> On February 13, 2021, Toomey was one of seven Republican senators to vote to convict Donald Trump of incitement of insurrection in his second impeachment trial.\n</p>]",
        "capital_summary": "Harrisburg is the capital city of the Commonwealth of Pennsylvania in the United States, and the county seat of Dauphin County. With a population of 50,099 as of the 2020 census, Harrisburg is the 15th largest city in Pennsylvania.",
        "full_name": "Pat Toomey",
        "img": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Pat_Toomey_official_photo.jpg"
    },
    "Jack_Reed_(Rhode_Island_politician)": {
        "handle": "SenJackReed",
        "state": "Rhode Island",
        "capital_city": "Providence",
        "latitude": "41.830914",
        "longitude": "-71.414963",
        "wiki_html": "[<p><b>John Francis Reed</b> <span class=\"noexcerpt nowraplinks\" style=\"font-size:85%; font-weight:normal;\">GOIH</span> (born November 12, 1949) is an American lawyer and politician serving as the senior United States senator from Rhode Island, a seat he was first elected to in 1996. A member of the Democratic Party, he was the U.S. representative for <span data-sort-value=\"Rhode Island02 !\">Rhode Island's 2nd congressional district</span> from 1991 to 1997. Reed graduated from the United States Military Academy and Harvard University, serving in the U.S. Army as an active officer from 1971 to 1979. He is the dean of Rhode Island's congressional delegation.\n</p>]",
        "capital_summary": "Providence is the capital and most populous city of the U.S. state of Rhode Island. One of the oldest cities in the United States, it was founded in 1636 by Roger Williams, a Reformed Baptist theologian and religious exile from the Massachusetts Bay Colony. He named the area in honor of \"God's merciful Providence\" which he believed was responsible for revealing such a haven for him and his followers. The city is situated at the mouth of the Providence River at the head of Narragansett Bay.\n",
        "full_name": "Jack Reed (Rhode Island politician)",
        "img": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Senator_Jack_Reed_official_photo.jpg"
    },
    "Sheldon_Whitehouse": {
        "handle": "SenWhitehouse",
        "state": "Rhode Island",
        "capital_city": "Providence",
        "latitude": "41.830914",
        "longitude": "-71.414963",
        "wiki_html": "[<p><b>Sheldon Whitehouse</b> (born October 20, 1955) is an American lawyer and politician serving as the junior United States senator from Rhode Island since 2007. A member of the Democratic Party, he served as a United States Attorney from 1993 to 1998 and the 71st attorney general of Rhode Island from 1999 to 2003.\n</p>]",
        "capital_summary": "Providence is the capital and most populous city of the U.S. state of Rhode Island. One of the oldest cities in the United States, it was founded in 1636 by Roger Williams, a Reformed Baptist theologian and religious exile from the Massachusetts Bay Colony. He named the area in honor of \"God's merciful Providence\" which he believed was responsible for revealing such a haven for him and his followers. The city is situated at the mouth of the Providence River at the head of Narragansett Bay.\n",
        "full_name": "Sheldon Whitehouse",
        "img": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Sheldon_Whitehouse%2C_official_portrait%2C_116th_congress.jpg"
    },
    "Lindsey_Graham": {
        "handle": "GrahamBlog",
        "state": "South Carolina",
        "capital_city": "Columbia",
        "latitude": "34.000343",
        "longitude": "-81.033211",
        "wiki_html": "[<p><b>Lindsey Olin Graham</b> (born July 9, 1955) is an American lawyer and politician serving as the senior United States senator from South Carolina, a seat he has held since 2003. A member of the Republican Party, Graham chaired the Senate Committee on the Judiciary from 2019 to 2021.\n</p> <p>A native of Central, South Carolina, Graham received his Juris Doctor degree from the University of South Carolina School of Law in 1981. Most of his active duty during his military service happened from 1982 to 1988, when he served with the Judge Advocate General's Corps in the United States Air Force, as a defense attorney and then with the Air Force's chief prosecutor in Europe based in West Germany. Later his entire service in the U.S. Air Force Reserve ran concurrently with his congressional career. He was awarded a Bronze Star Medal for meritorious service in 2014 and held the rank of colonel.\n</p> <p>Graham worked as a lawyer in private practice before serving one term in the South Carolina House of Representatives from 1993 to 1995. He served four terms in the United States House of Representatives for South Carolina's 3rd congressional district from 1995 to 2003. In 2002, Graham won the U.S. Senate seat vacated by retiring Republican incumbent Strom Thurmond. He was reelected to a fourth term in 2020. In the Senate Graham advocates for strong national defense<sup class=\"reference\" id=\"cite_ref-npr2015_1-0\">[1]</sup> and aggressive interventionist foreign policy.<sup class=\"reference\" id=\"cite_ref-grahamend_2-0\">[2]</sup> Initially, he was known for his willingness to be bipartisan and work with Democrats on issues like campaign finance reform, a ban on waterboarding, cap and trade, immigration reform, and judicial nominees.<sup class=\"reference\" id=\"cite_ref-facesdown_3-0\">[3]</sup><sup class=\"reference\" id=\"cite_ref-countmore_4-0\">[4]</sup><sup class=\"reference\" id=\"cite_ref-primaried_5-0\">[5]</sup><sup class=\"reference\" id=\"cite_ref-vstp_6-0\">[6]</sup><sup class=\"reference\" id=\"cite_ref-uncantor_7-0\">[7]</sup><sup class=\"reference\" id=\"cite_ref-bipartisan_8-0\">[8]</sup> He has criticized the Tea Party movement, arguing for a more inclusive Republican Party.<sup class=\"reference\" id=\"cite_ref-uncantor_7-1\">[7]</sup><sup class=\"reference\" id=\"cite_ref-wrath_9-0\">[9]</sup><sup class=\"reference\" id=\"cite_ref-manoeuvre_10-0\">[10]</sup><sup class=\"reference\" id=\"cite_ref-maverick_11-0\">[11]</sup><sup class=\"reference\" id=\"cite_ref-stomped_12-0\">[12]</sup><sup class=\"reference\" id=\"cite_ref-teflon_13-0\">[13]</sup>\n</p> <p>Graham sought the Republican nomination for president between June and December 2015, dropping out before the 2016 Republican primaries began.<sup class=\"reference\" id=\"cite_ref-14\">[14]</sup><sup class=\"reference\" id=\"cite_ref-grahamend_2-1\">[2]</sup> He was an outspoken critic of Donald Trump's 2016 candidacy and repeatedly said he did not support Trump;<sup class=\"reference\" id=\"cite_ref-15\">[15]</sup> in particular, he took issue with Trump's comments on Graham's close friend, Senator John McCain.<sup class=\"reference\" id=\"cite_ref-miller2018_16-0\">[16]</sup> After a March 2017 meeting with Trump, Graham became a staunch ally of his, often issuing public statements in his defense. His reversal caught both parties by surprise and sparked media speculation.<sup class=\"reference\" id=\"cite_ref-miller2018_16-1\">[16]</sup><sup class=\"reference\" id=\"cite_ref-parker2019_17-0\">[17]</sup> He became chairman of the Senate Judiciary Committee in January 2019.<sup class=\"reference\" id=\"cite_ref-18\">[18]</sup> Graham led the U.S. Supreme Court confirmation hearings for Amy Coney Barrett, who was confirmed in October 2020.\n</p>]",
        "capital_summary": "Columbia is the capital of the U.S. state of South Carolina. With a population of 136,632 as of the 2020 U.S. Census, it is the second-largest city in South Carolina. The city serves as the county seat of Richland County, and a portion of the city extends into neighboring Lexington County. It is the center of the Columbia metropolitan statistical area, which had a population of 829,470 and is the 72nd-largest metropolitan statistical area in the nation. The name Columbia is a poetic term used for the United States, derived from the name of Christopher Columbus, who explored for the Spanish Crown. Columbia is often abbreviated as Cola, leading to its nickname as \"Soda City.\"\n",
        "full_name": "Lindsey Graham",
        "img": "https://upload.wikimedia.org/wikipedia/commons/8/8e/U.S._Senator_Lindsey_Graham%2C_Official_Photo%2C_113th_Congress.jpg"
    },
    "Tim_Scott": {
        "handle": "SenatorTimScott",
        "state": "South Carolina",
        "capital_city": "Columbia",
        "latitude": "34.000343",
        "longitude": "-81.033211",
        "wiki_html": "[<p><b>Timothy Eugene Scott</b> (born September 19, 1965) is an American politician and businessman. He has served as the junior United States senator for South Carolina since 2013. A Republican, Scott was appointed to the U.S. Senate by Governor Nikki Haley in 2013. He retained his seat after winning a special election in 2014 and was elected to a full term in 2016.\n</p> <p>In 2010, Scott was elected to the United States House of Representatives for <span data-sort-value=\"South Carolina01 !\">South Carolina's 1st congressional district</span>, where he served from 2011 to 2013.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> Scott served one term (from 2009 to 2011) in the South Carolina General Assembly and served on the Charleston County council from 1996 to 2008.<sup class=\"reference\" id=\"cite_ref-SC_elects_2-0\">[2]</sup><sup class=\"reference\" id=\"cite_ref-campaign_bio_3-0\">[3]</sup>\n</p> <p>Scott is one of eleven African-Americans to have served in the U.S. Senate, and the first to serve in both chambers of Congress.<sup class=\"reference\" id=\"cite_ref-4\">[4]</sup> He is the seventh African-American to have been elected to the Senate and the fourth from the Republican Party. He is the first African-American senator from South Carolina, the first African-American senator to be elected from the Southern United States since 1881 (four years after the end of Reconstruction), and the first African-American Republican to serve in the U.S. Senate since Edward Brooke departed in 1979.<sup class=\"reference\" id=\"cite_ref-5\">[5]</sup><sup class=\"reference\" id=\"cite_ref-6\">[6]</sup>\n</p>]",
        "capital_summary": "Columbia is the capital of the U.S. state of South Carolina. With a population of 136,632 as of the 2020 U.S. Census, it is the second-largest city in South Carolina. The city serves as the county seat of Richland County, and a portion of the city extends into neighboring Lexington County. It is the center of the Columbia metropolitan statistical area, which had a population of 829,470 and is the 72nd-largest metropolitan statistical area in the nation. The name Columbia is a poetic term used for the United States, derived from the name of Christopher Columbus, who explored for the Spanish Crown. Columbia is often abbreviated as Cola, leading to its nickname as \"Soda City.\"\n",
        "full_name": "Tim Scott",
        "img": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Tim_Scott%2C_official_portrait%2C_113th_Congress.jpg"
    },
    "John_Thune": {
        "handle": "SenJohnThune",
        "state": "South Dakota",
        "capital_city": "Pierre",
        "latitude": "44.367031",
        "longitude": "-100.346405",
        "wiki_html": "[<p><b>John Randolph Thune</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"/θ/: 'th' in 'thigh'\">θ</span><span title=\"/uː/: 'oo' in 'goose'\">uː</span><span title=\"'n' in 'nigh'\">n</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">THOON</span></i>; born January 7, 1961) is an American politician and businessman serving as the senior United States senator from South Dakota, a seat to which he was first elected in 2004. A member of the Republican Party, he serves as Senate minority whip. \n</p> <p>Thune has worked in politics and civic organizations since completing his MBA degree. He served in the U.S. House of Representatives for <span data-sort-value=\"South DakotaAL !\">South Dakota's at-large congressional district</span> from 1997 to 2003. Thune is known for his defeat of sitting Senate Democratic Leader Tom Daschle in 2004. In the United States Senate, Thune served as the Republican chief deputy whip from 2007 to 2009 and as chair of the Senate Republican Policy Committee from 2009 to 2012. He served as the Senate Republican Conference chair, the third-ranking position in the Senate, from 2012 to 2019. \n</p> <p>The Senate Republican Conference selected Thune as majority whip for the 116th Congress; he succeeded Senator John Cornyn of Texas, who was term-limited in the position. In 2020, he was chosen  as minority whip for the 117th Congress.\n</p>]",
        "capital_summary": "Pierre is the capital city of South Dakota and the seat of Hughes County. The population was 14,091 at the 2020 census, making it the second-least populous state capital in the United States, following Montpelier, Vermont. It is the eighth-most populous city in South Dakota. Founded in 1880, it was selected as the state capital when the territory was admitted as a state. Pierre is the principal city of the Pierre Micropolitan Statistical Area, which includes all of Hughes and Stanley counties.",
        "full_name": "John Thune",
        "img": "https://upload.wikimedia.org/wikipedia/commons/1/15/John_Thune_117th_Congress_portrait.jpg"
    },
    "Mike_Rounds": {
        "handle": "SenatorRounds",
        "state": "South Dakota",
        "capital_city": "Pierre",
        "latitude": "44.367031",
        "longitude": "-100.346405",
        "wiki_html": "[<p><b>Marion Michael Rounds</b> (born October 24, 1954) is an American businessman and politician serving as the junior United States senator from South Dakota since 2015. A member of the Republican Party, he served as the 31st governor of South Dakota from 2003 to 2011, and in the South Dakota Senate from 1991 to 2001. In 2014, Rounds was elected to the United States Senate, succeeding retiring Democrat Tim Johnson. He was reelected in 2020 over Democratic nominee Dan Ahlers.\n</p>]",
        "capital_summary": "Pierre is the capital city of South Dakota and the seat of Hughes County. The population was 14,091 at the 2020 census, making it the second-least populous state capital in the United States, following Montpelier, Vermont. It is the eighth-most populous city in South Dakota. Founded in 1880, it was selected as the state capital when the territory was admitted as a state. Pierre is the principal city of the Pierre Micropolitan Statistical Area, which includes all of Hughes and Stanley counties.",
        "full_name": "Mike Rounds",
        "img": "https://upload.wikimedia.org/wikipedia/commons/1/14/Mike_Rounds_official_Senate_portrait.jpg"
    },
    "Marsha_Blackburn": {
        "handle": "SenAlexander",
        "state": "Tennessee",
        "capital_city": "Nashville",
        "latitude": "36.16581",
        "longitude": "-86.784241",
        "wiki_html": "[<p><b>Mary Marsha Blackburn</b> (née <b>Wedgeworth</b>; born June 6, 1952) is an American politician and businesswoman serving as the senior United States senator from Tennessee, a seat she has held since 2019. She is a member of the Republican Party. Blackburn was a state senator from 1999 to 2003, and represented <span data-sort-value=\"Tennessee07 !\">Tennessee's 7th congressional district</span> in the U.S. House from 2003 to 2019.\n</p> <p>On November 6, 2018, she became the first woman to be elected to the U.S. Senate from Tennessee, defeating former Democratic Tennessee Governor Phil Bredesen. She took over as the state's senior senator in January 2021, when outgoing Senator Lamar Alexander retired. Blackburn, a supporter of the Tea Party movement,<sup class=\"reference\" id=\"cite_ref-:7_1-0\">[1]</sup> is a staunch conservative and backer of Donald Trump.<sup class=\"reference\" id=\"cite_ref-:8_2-0\">[2]</sup>\n</p>]",
        "capital_summary": "Named for Francis Nash, a general of the Continental Army during the American Revolutionary War, the city was founded in 1779. The city grew quickly due to its strategic location as a port on the Cumberland River and, in the 19th century, a railroad center. Nashville seceded with Tennessee during the American Civil War; in 1862 it was the first state capital in the Confederacy to fall to Union troops. After the war, the city reclaimed its position and developed a manufacturing base.\n",
        "full_name": "Marsha Blackburn",
        "img": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Marsha_Blackburn%2C_official_photo%2C_116th_Congress.jpg"
    },
    "Bill_Hagerty": {
        "handle": "BobCorker",
        "state": "Tennessee",
        "capital_city": "Nashville",
        "latitude": "36.16581",
        "longitude": "-86.784241",
        "wiki_html": "[<p><b>William Francis Hagerty IV</b> (born August 14, 1959) is an American politician, businessman, and diplomat serving as the junior United States senator from Tennessee since 2021. A member of the Republican Party, he served as the 30th U.S. ambassador to Japan from 2017 to 2019. \n</p> <p>Hagerty worked as an economic advisor and White House fellow under President George H. W. Bush. He then began a career in private equity. Hagerty is the co-founder of Hagerty Peterson &amp; Company, a private equity investment firm; he is a former managing director of the firm. From 2011 to 2014, Hagerty served as commissioner of the Tennessee Department of Economic and Community Development. He led a successful effort to bring a Major League Soccer franchise to Nashville. President Donald Trump nominated Hagerty to serve as U.S. ambassador to Japan on March 27, 2017; he was confirmed by the U.S. Senate on July 13, 2017 in an 86–12 vote. Hagerty was sworn in as the 30th United States ambassador to Japan on July 27, 2017; he resigned in July 2019 to run for the U.S. Senate.\n</p> <p>Hagerty ran in the 2020 election for the U.S. Senate seat being vacated by Lamar Alexander. He won the Republican primary and defeated Democratic nominee Marquita Bradshaw in the general election.\n</p>]",
        "capital_summary": "Named for Francis Nash, a general of the Continental Army during the American Revolutionary War, the city was founded in 1779. The city grew quickly due to its strategic location as a port on the Cumberland River and, in the 19th century, a railroad center. Nashville seceded with Tennessee during the American Civil War; in 1862 it was the first state capital in the Confederacy to fall to Union troops. After the war, the city reclaimed its position and developed a manufacturing base.\n",
        "full_name": "Bill Hagerty",
        "img": "https://upload.wikimedia.org/wikipedia/commons/d/de/Sen._Bill_Hagerty_official_Senate_portrait%2C_117th_Congress.jpg"
    },
    "John_Cornyn": {
        "handle": "JohnCornyn",
        "state": "Texas",
        "capital_city": "Austin",
        "latitude": "30.27467",
        "longitude": "-97.740349",
        "wiki_html": "[<p><b>John Cornyn III</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'k' in 'kind'\">k</span><span title=\"/ɔːr/: 'ar' in 'war'\">ɔːr</span><span title=\"'n' in 'nigh'\">n</span><span title=\"/ɪ/: 'i' in 'kit'\">ɪ</span><span title=\"'n' in 'nigh'\">n</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">CORN</span>-in</i>; born February 2, 1952) is an American politician and attorney serving as the senior United States senator for Texas, a seat he has held since 2002. He was the Republican Senate majority whip for the 114th and 115th Congresses.<sup class=\"reference\" id=\"cite_ref-Brett_1-0\">[1]</sup> Cornyn also previously served as chair of the National Republican Senatorial Committee from 2009 to 2013.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup>\n</p> <p>Born in Houston, Cornyn is a graduate of Trinity University and St. Mary's University School of Law, and received an LL.M. degree from the University of Virginia School of Law. He was a judge on Texas's 37th District Court from 1985 to 1991.<sup class=\"reference\" id=\"cite_ref-3\">[3]</sup><sup class=\"reference\" id=\"cite_ref-4\">[4]</sup> He was elected an associate justice of the Texas Supreme Court, where he served from 1991 to 1997. In 1998, Cornyn was elected Attorney General of Texas, serving one term until winning a seat in the U.S. Senate in 2002. He was reelected in 2008, 2014, and 2020.\n</p>]",
        "capital_summary": "Austin is the capital city of the U.S. state of Texas, as well as the seat and largest city of Travis County, with portions extending into Hays and Williamson counties. Incorporated on December 27, 1839, it is the 11th-most populous city in the United States, the fourth-most-populous city in Texas, the second-most-populous state capital city after Phoenix, Arizona, and the most populous state capital that is not also the most populous city in its state. It has been one of the fastest growing large cities in the United States since 2010. The Greater Austin and Greater San Antonio areas are separated from each other by approximately 80 miles  along Interstate 35. It is anticipated that both regions may form a new metroplex similar to Dallas and Fort Worth. Austin is the southernmost state capital in the contiguous United States and is considered a \"Beta −\" global city as categorized by the Globalization and World Cities Research Network.\n",
        "full_name": "John Cornyn",
        "img": "https://upload.wikimedia.org/wikipedia/commons/b/b2/John_Cornyn_official_senate_portrait.jpg"
    },
    "Ted_Cruz": {
        "handle": "SenTedCruz",
        "state": "Texas",
        "capital_city": "Austin",
        "latitude": "30.27467",
        "longitude": "-97.740349",
        "wiki_html": "[<p><b>Rafael Edward \"Ted\" Cruz</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"'k' in 'kind'\">k</span><span title=\"'r' in 'rye'\">r</span><span title=\"/uː/: 'oo' in 'goose'\">uː</span><span title=\"'z' in 'zoom'\">z</span></span>/</span></span>; born December 22, 1970) is an American politician and attorney serving as the junior United States senator for Texas since 2013. A member of the Republican Party, Cruz served as Solicitor General of Texas from 2003 to 2008.\n</p> <p>After graduating from Princeton University and Harvard Law School, Cruz pursued a career in politics. He worked as a policy advisor in the George W. Bush administration before serving as Solicitor General of Texas from 2003 to 2008. In 2012, Cruz was elected to the U.S. Senate, becoming the first Hispanic-American<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> to serve as a U.S. senator from Texas. In the Senate, Cruz has taken consistently conservative positions on economic and social policy; he played a leading role in the 2013 United States federal government shutdown, seeking to force Congress and President Barack Obama to defund the Affordable Care Act. He was reelected in a close Senate race in 2018 against Democratic candidate Beto O'Rourke.\n</p> <p>In 2016, Cruz ran for president of the United States, placing second behind Donald Trump in the Republican primaries. The competition for the Republican presidential nomination between Trump and Cruz was deeply acrimonious and characterized by a series of public personal attacks. While Cruz initially declined to endorse Trump's campaign once he won the nomination, he became a staunch Trump supporter during the latter's presidency. After the January 2021 Capitol attack, Cruz provoked widespread political and popular backlash for objecting to the certification of Joe Biden's victory in the 2020 presidential election and giving credence to the false claim that the election was stolen from Trump.<sup class=\"reference\" id=\"cite_ref-theguardian-riot_3-0\">[3]</sup>\n</p>]",
        "capital_summary": "Austin is the capital city of the U.S. state of Texas, as well as the seat and largest city of Travis County, with portions extending into Hays and Williamson counties. Incorporated on December 27, 1839, it is the 11th-most populous city in the United States, the fourth-most-populous city in Texas, the second-most-populous state capital city after Phoenix, Arizona, and the most populous state capital that is not also the most populous city in its state. It has been one of the fastest growing large cities in the United States since 2010. The Greater Austin and Greater San Antonio areas are separated from each other by approximately 80 miles  along Interstate 35. It is anticipated that both regions may form a new metroplex similar to Dallas and Fort Worth. Austin is the southernmost state capital in the contiguous United States and is considered a \"Beta −\" global city as categorized by the Globalization and World Cities Research Network.\n",
        "full_name": "Ted Cruz",
        "img": "https://upload.wikimedia.org/wikipedia/commons/9/95/Ted_Cruz_official_116th_portrait.jpg"
    },
    "Mike_Lee_(American_politician)": {
        "handle": "SenMikeLee",
        "state": "Utah",
        "capital_city": "Salt Lake City",
        "latitude": "40.777477",
        "longitude": "-111.888237",
        "wiki_html": "[<p><b>Michael Shumway Lee</b> (born June 4, 1971) is an American lawyer and politician serving as the senior United States senator from Utah. A Republican, Lee has been in the Senate since 2011.\n</p> <p>Lee began his career as a clerk for the U.S. District Court for the District of Utah before clerking for Samuel Alito, who was then a judge on the Third Circuit Court of Appeals. From 2002 to 2005, Lee was an Assistant United States Attorney for the District of Utah. He joined the administration of Utah Governor Jon Huntsman, serving as the general counsel in the governor's office from 2005 to 2006. Lee again clerked for Alito after he was appointed to the U.S. Supreme Court.\n</p> <p>In 2010, during the Tea Party movement, Lee entered the party caucus process to challenge incumbent three-term Republican senator Bob Bennett. He defeated Bennett and business owner Tim Bridgewater during the nominating process at the Utah Republican Party convention. Lee won the Republican primary, and defeated Democratic nominee Sam Granato in the general election. He was reelected in 2016 and became the dean of Utah's congressional delegation when Representative Rob Bishop retired in January 2021. Lee chaired the Joint Economic Committee from 2019 to 2021.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup>\n</p>]",
        "capital_summary": "Salt Lake City is the capital and most populous city of the U.S. state of Utah, as well as the seat of Salt Lake County, the most populous county in Utah. With a population of 199,723 in 2020, the city is the core of the Salt Lake City metropolitan area, which has a population of 1,257,936 . Salt Lake City is further situated within a larger metropolis known as the Salt Lake City–Ogden–Provo Combined Statistical Area, a corridor of contiguous urban and suburban development stretched along a 120-mile  segment of the Wasatch Front, comprising a population of 2,606,548 , making it the 22nd largest in the nation. It is also the central core of the larger of only two major urban areas located within the Great Basin .\n",
        "full_name": "Mike Lee (American politician)",
        "img": "https://upload.wikimedia.org/wikipedia/commons/8/87/Mike_Lee%2C_official_portrait.jpg"
    },
    "Mitt_Romney": {
        "handle": "SenOrrinHatch",
        "state": "Utah",
        "capital_city": "Salt Lake City",
        "latitude": "40.777477",
        "longitude": "-111.888237",
        "wiki_html": "[<p><img alt=\"Mitt Romney Signature.svg\" data-file-height=\"58\" data-file-width=\"189\" decoding=\"async\" height=\"46\" src=\"//upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Mitt_Romney_Signature.svg/150px-Mitt_Romney_Signature.svg.png\" srcset=\"//upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Mitt_Romney_Signature.svg/225px-Mitt_Romney_Signature.svg.png 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Mitt_Romney_Signature.svg/300px-Mitt_Romney_Signature.svg.png 2x\" width=\"150\"/>\n</p> <p><b>Willard Mitt Romney</b> (born March 12, 1947) is an American politician, lawyer, and businessman serving as the junior United States senator from Utah since January 2019, succeeding Orrin Hatch. He served as the 70th governor of Massachusetts from 2003 to 2007 and was the Republican Party's nominee for president of the United States in the 2012 election, losing to the then incumbent president, Barack Obama.\n</p> <p>Raised in Bloomfield Hills, Michigan by George and Lenore Romney, he spent over two years in France as a Mormon missionary. He married Ann Davies in 1969; they have five sons. Active in The Church of Jesus Christ of Latter-day Saints (LDS Church) throughout his adult life, Romney served as bishop of his ward and later as a stake president for an area covering Boston and many of its suburbs. By 1971, he had participated in the political campaigns of both his parents. In 1971 Romney graduated with a Bachelor of Arts in English from Brigham Young University (BYU) and in 1975 he received a JD–MBA degree from Harvard.<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> He became a management consultant and in 1977 joined Bain &amp; Company in Boston. As Bain's chief executive officer (CEO), he helped lead the company out of a financial crisis. In 1984, he co-founded and led the spin-off company Bain Capital, a private equity investment firm that became one of the largest of its kind in the nation.\n</p> <p>After stepping down from Bain Capital and his local leadership role in the LDS Church, Romney was the Republican nominee in the 1994 United States Senate election in Massachusetts. After losing to five-term incumbent Ted Kennedy, he resumed his position at Bain Capital. Years later, a successful stint as president and CEO of the then-struggling Salt Lake Organizing Committee for the 2002 Winter Olympics led to a relaunch of his political career. Elected governor of Massachusetts in 2002, Romney helped develop and later signed a health care reform law (commonly called \"Romneycare\") that provided near-universal health insurance access through state-level subsidies and individual mandates to purchase insurance. He also presided over the elimination of a projected $1.2–1.5 billion deficit through a combination of spending cuts, increased fees, and closing corporate tax loopholes. He did not seek reelection in 2006, focusing instead on his campaign for the Republican nomination in the 2008 U.S. presidential election. Though he won several primaries and caucuses, Romney ultimately lost the nomination to Senator John McCain. Romney's considerable net worth, estimated in 2012 at $190–250 million, helped finance his political campaigns before 2012, when he again ran for and won the Republican presidential nomination, becoming the first Mormon to be a major party's nominee. He lost the election to incumbent Democratic President Barack Obama, losing the Electoral College by a margin of 206–332 and the popular vote by 47%–51%, almost five million votes.\n</p> <p>After reestablishing residency in Utah, Romney announced his campaign for the U.S. Senate seat held by the retiring Orrin Hatch in the 2018 election; he defeated state representative Mike Kennedy in the Republican primary and Democratic nominee Jenny Wilson in the general election. In doing so, he became only the third person ever to be elected governor of one state and U.S. senator for another state (the others are Sam Houston and William Bibb).\n</p>]",
        "capital_summary": "Salt Lake City is the capital and most populous city of the U.S. state of Utah, as well as the seat of Salt Lake County, the most populous county in Utah. With a population of 199,723 in 2020, the city is the core of the Salt Lake City metropolitan area, which has a population of 1,257,936 . Salt Lake City is further situated within a larger metropolis known as the Salt Lake City–Ogden–Provo Combined Statistical Area, a corridor of contiguous urban and suburban development stretched along a 120-mile  segment of the Wasatch Front, comprising a population of 2,606,548 , making it the 22nd largest in the nation. It is also the central core of the larger of only two major urban areas located within the Great Basin .\n",
        "full_name": "Mitt Romney",
        "img": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Mitt_Romney_official_US_Senate_portrait.jpg"
    },
    "Patrick_Leahy": {
        "handle": "SenatorLeahy",
        "state": "Vermont",
        "capital_city": "Montpelier",
        "latitude": "44.262436",
        "longitude": "-72.580536",
        "wiki_html": "[<p><b>Patrick Joseph Leahy</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'l' in 'lie'\">l</span><span title=\"/eɪ/: 'a' in 'face'\">eɪ</span><span title=\"'h' in 'hi'\">h</span><span title=\"/i/: 'y' in 'happy'\">i</span></span>/</span></span>; born March 31, 1940) is an American politician and attorney who is the senior United States senator from Vermont and serves as the president pro tempore of the United States Senate. Leahy was first elected to the Senate in 1974, and previously served as president pro tempore from 2012 to 2015. He is the chair of the Senate Appropriations Committee.\n</p> <p>A member of the Democratic Party, Leahy is now in his eighth term of office. He is the most senior member of Congress, and the last of the Senate's \"Watergate Babies\"—Democrats first elected to Congress in the wave election of 1974 that followed President Richard Nixon's resignation over the Watergate scandal.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> As of 2022<sup class=\"plainlinks noexcerpt noprint asof-tag update\" style=\"display:none;\">[update]</sup>, Leahy is one of two members of Congress to have served during Gerald Ford's presidency,<sup class=\"reference\" id=\"cite_ref-2\">[a]</sup> and one of three to have served during Jimmy Carter's.<sup class=\"reference\" id=\"cite_ref-3\">[b]</sup>\n</p> <p>The dean of his state's congressional delegation, Leahy is Vermont's longest-serving U.S. senator, as well as the only Democrat ever elected to the U.S. Senate from Vermont.<sup class=\"reference\" id=\"cite_ref-4\">[c]</sup> He is the former chairman of the Agriculture and Judiciary committees. He served as the ranking member of the Appropriations Committee from 2017 to 2021, and became chairman in 2021. In 2001, Leahy was one of the two U.S. senators targeted by the anthrax attacks that killed five people. He was the presiding officer at Donald Trump's second impeachment trial, becoming the first senator to preside over a former president's impeachment trial.<sup class=\"reference\" id=\"cite_ref-5\">[2]</sup><sup class=\"reference\" id=\"cite_ref-6\">[3]</sup>\n</p> <p>On November 15, 2021, Leahy announced that he would not seek reelection in 2022.<sup class=\"reference\" id=\"cite_ref-7\">[4]</sup>\n</p> <p><br/></p> <p class=\"mw-empty-elt\">\n</p>]",
        "capital_summary": "Montpelier is the capital city of the U.S. state of Vermont and the seat of Washington County. The site of Vermont's state government, it is the least populous state capital in the United States. As of the 2020 census, the population was 8,074. However, the daytime population grows to about 21,000, due to the large number of jobs within city limits. The Vermont College of Fine Arts is located in the municipality. It was named after Montpellier, a city in the south of France.",
        "full_name": "Patrick Leahy",
        "img": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Leahy2009.jpg"
    },
    "Bernie_Sanders": {
        "handle": "SenatorSanders",
        "state": "Vermont",
        "capital_city": "Montpelier",
        "latitude": "44.262436",
        "longitude": "-72.580536",
        "wiki_html": "[<p><img alt=\"Bernie Sanders's signature\" data-file-height=\"291\" data-file-width=\"582\" decoding=\"async\" height=\"78\" src=\"//upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Bernie-signature.png/155px-Bernie-signature.png\" srcset=\"//upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Bernie-signature.png/233px-Bernie-signature.png 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Bernie-signature.png/310px-Bernie-signature.png 2x\" width=\"155\"/>\n</p> <p><b>Bernard  Sanders</b> (born September<span class=\"nowrap\"> </span>8, 1941) is an American politician and activist who has served as the junior United States senator from Vermont since 2007. He was the U.S. representative for the state's at-large congressional district from 1991 to 2007. He is expected to become Vermont's senior senator and dean of its congressional delegation in January 2023, upon the scheduled retirement of Senator Patrick Leahy. Sanders is the longest-serving independent in U.S. congressional history. He has a close relationship with the Democratic Party, having caucused with House and Senate Democrats for most of his congressional career.<sup class=\"reference\" id=\"cite_ref-wapo_4-0\">[1]</sup> Sanders unsuccessfully sought the Democratic Party nomination for president of the United States in 2016 and 2020, finishing in second place in both campaigns. Before his election to Congress, he was mayor of Burlington, Vermont.\n</p> <p>Sanders self-identifies as a democratic socialist and has been credited with influencing a leftward shift in the Democratic Party after his 2016 presidential campaign. An advocate of social democratic and progressive policies, he is known for his opposition to economic inequality and neoliberalism. On domestic policy, he supports labor rights, universal and single-payer healthcare, paid parental leave, tuition-free tertiary education, and an ambitious Green New Deal to create jobs addressing climate change. On foreign policy, he supports reducing military spending, pursuing more diplomacy and international cooperation, and putting greater emphasis on labor rights and environmental concerns when negotiating international trade agreements. Sanders supports workplace democracy, and has praised elements of the Nordic model.\n</p> <p>Born into a working-class Jewish family and raised in the Brooklyn borough of New York City, Sanders attended Brooklyn College before graduating from the University of Chicago in 1964. While a student, he was a protest organizer for the Congress of Racial Equality (CORE) and the Student Nonviolent Coordinating Committee (SNCC) during the civil rights movement. After settling in Vermont in 1968, he ran unsuccessful third-party political campaigns in the early to mid-1970s. He was elected mayor of Burlington in 1981 as an independent and was reelected three times. He won election to the U.S. House of Representatives in 1990, representing Vermont's at-large congressional district, later co-founding the Congressional Progressive Caucus. He served as a U.S. representative for 16 years before being elected to the U.S. Senate in 2006. Sanders was reelected to the Senate in 2012 and 2018. He chaired the Senate Veterans' Affairs Committee from 2013 to 2015. In January 2021, Sanders became chair of the Senate Budget Committee.\n</p> <p>Sanders was a major candidate for the Democratic presidential nomination in 2016 and 2020. Despite initially low expectations, his 2016 campaign generated significant grassroots enthusiasm and funding from small-dollar donors, carrying Sanders to victory against eventual nominee Hillary Clinton in 23 primaries and caucuses before he conceded in July.<sup class=\"reference\" id=\"cite_ref-auto4_5-0\">[2]</sup> In 2020, Sanders's strong showing in early primaries and caucuses made him the front-runner in a historically large field of Democratic candidates. In April 2020, he conceded the nomination to Joe Biden, who had won a series of decisive victories as the field narrowed. Sanders supported Clinton and Biden in their general election campaigns against Donald Trump.\n</p>]",
        "capital_summary": "Montpelier is the capital city of the U.S. state of Vermont and the seat of Washington County. The site of Vermont's state government, it is the least populous state capital in the United States. As of the 2020 census, the population was 8,074. However, the daytime population grows to about 21,000, due to the large number of jobs within city limits. The Vermont College of Fine Arts is located in the municipality. It was named after Montpellier, a city in the south of France.",
        "full_name": "Bernie Sanders",
        "img": "https://upload.wikimedia.org/wikipedia/commons/0/02/Bernie_Sanders_in_March_2020.jpg"
    },
    "Mark_Warner": {
        "handle": "MarkWarner",
        "state": "Virginia",
        "capital_city": "Richmond",
        "latitude": "37.538857",
        "longitude": "-77.43364",
        "wiki_html": "[<p><b>Mark Robert Warner</b> (born December 15, 1954) is an American businessman and politician serving as the senior United States senator from Virginia, first elected in 2008. He is a member of the Democratic Party, vice chair of the Senate Democratic Caucus, and chair of the Senate Intelligence Committee.\n</p> <p>Before his Senate career, Warner was the 69th governor of Virginia, holding the office from 2002 to 2006. He is the honorary chairman of the Forward Together PAC. Warner delivered the keynote address at the 2008 Democratic National Convention. Apart from politics, Warner is also known for his involvement in telecommunications-related venture capital during the 1980s; he founded the firm Columbia Capital.\n</p> <p>In 2006, Warner was widely expected to pursue the Democratic nomination in the 2008 U.S. presidential election, but he announced in October 2006 that he would not run, citing a desire not to disrupt his family life. Warner was considered to be a potential vice presidential candidate until he took himself out of consideration after winning the Democratic nomination for the U.S. Senate.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup>\n</p> <p>Running against his gubernatorial predecessor, Jim Gilmore, Warner won his first election to the Senate in 2008 with 65% of the vote. He was reelected in 2014, narrowly defeating Ed Gillespie,<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> and in 2020, defeating Republican nominee Daniel Gade by twelve percentage points.\n</p> <p>With a net worth of $214.1 million, Warner is the second wealthiest member of Congress.\n</p>]",
        "capital_summary": "Richmond, also called RVA, is the capital city of the Commonwealth of Virginia in the United States. It is the center of the Richmond Metropolitan Statistical Area  and the Greater Richmond Region. Richmond was incorporated in 1742 and has been an independent city since 1871. As of the 2010 census, the city's population was 204,214; in 2020, the population had grown to 226,610, making Richmond the fourth-most populous city in Virginia. The Richmond Metropolitan Area has a population of 1,260,029, the third-most populous metro in the state.\n",
        "full_name": "Mark Warner",
        "img": "https://upload.wikimedia.org/wikipedia/commons/1/14/Mark_Warner%2C_official_112th_Congress_Senate_portrait.jpg"
    },
    "Tim_Kaine": {
        "handle": "timkaine",
        "state": "Virginia",
        "capital_city": "Richmond",
        "latitude": "37.538857",
        "longitude": "-77.43364",
        "wiki_html": "[<p><img alt=\"Tim Kaine Signature.svg\" data-file-height=\"74\" data-file-width=\"163\" decoding=\"async\" height=\"45\" src=\"//upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Tim_Kaine_Signature.svg/100px-Tim_Kaine_Signature.svg.png\" srcset=\"//upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Tim_Kaine_Signature.svg/150px-Tim_Kaine_Signature.svg.png 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Tim_Kaine_Signature.svg/200px-Tim_Kaine_Signature.svg.png 2x\" width=\"100\"/>\n</p> <p><b>Timothy Michael Kaine</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"'k' in 'kind'\">k</span><span title=\"/eɪ/: 'a' in 'face'\">eɪ</span><span title=\"'n' in 'nigh'\">n</span></span>/</span></span>; born February 26, 1958) is an American lawyer and politician serving as the junior United States senator from Virginia since 2013. A member of the Democratic Party, he served as the 38th lieutenant governor of Virginia from 2002 to 2006 and 70th governor of Virginia from 2006 to 2010. Kaine was the Democratic nominee for vice president of the United States in the 2016 election as Hillary Clinton's running mate.\n</p> <p>Born in Saint Paul, Minnesota, Kaine grew up in Overland Park, Kansas, graduated from the University of Missouri in Columbia, Missouri, and earned a Juris Doctor degree from Harvard Law School before entering private practice and becoming a lecturer at the University of Richmond School of Law. He was first elected to public office in 1994, when he won a seat on the Richmond City Council. He was elected mayor of Richmond in 1998 and held that position until being elected lieutenant governor of Virginia in 2001. Kaine was elected governor of Virginia in 2005 and held that office from 2006 to 2010. He chaired the Democratic National Committee from 2009 to 2011.\n</p> <p>On July 22, 2016, Hillary Clinton introduced Kaine as her vice-presidential running mate. The 2016 Democratic National Convention nominated him on July 27. Despite winning a plurality of the national popular vote, the Clinton–Kaine ticket lost the Electoral College, and thus the election, to the Republican ticket of Donald Trump and Mike Pence on November 8, 2016. Kaine was reelected to a second Senate term in 2018, defeating Republican Corey Stewart.\n</p>]",
        "capital_summary": "Richmond, also called RVA, is the capital city of the Commonwealth of Virginia in the United States. It is the center of the Richmond Metropolitan Statistical Area  and the Greater Richmond Region. Richmond was incorporated in 1742 and has been an independent city since 1871. As of the 2010 census, the city's population was 204,214; in 2020, the population had grown to 226,610, making Richmond the fourth-most populous city in Virginia. The Richmond Metropolitan Area has a population of 1,260,029, the third-most populous metro in the state.\n",
        "full_name": "Tim Kaine",
        "img": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Tim_Kaine_116th_official_portrait.jpg"
    },
    "Patty_Murray": {
        "handle": "PattyMurray",
        "state": "Washington",
        "capital_city": "Olympia",
        "latitude": "47.035805",
        "longitude": "-122.905014",
        "wiki_html": "[<p><b>Patricia Lynn Murray</b> (née <b>Johns</b>; born October 11, 1950) is an American politician and retired educator serving as the senior United States senator from Washington, a seat she has held since 1993. A member of the Democratic Party, Murray previously served in the Washington State Senate and is Washington's first female U.S. senator.\n</p> <p>Born and raised in Bothell, Washington, Murray graduated from Washington State University with a degree in physical education. She worked as a pre-school teacher and, later, as a parenting teacher at Shoreline Community College. A long-time advocate for environmental and education issues, Murray ran for the Washington State Senate in 1988, and defeated two-term incumbent Bill Kiskaddon. She served one term in the state senate, before launching a successful campaign for the United States Senate in 1992. She has been re-elected four times, and is currently running for a sixth term in the 2022 election.\n</p> <p>As a senator, Murray has been a part of party leadership since 2001, having served as chair of the Democratic Senatorial Campaign Committee, Democratic Conference secretary, and assistant Democratic leader, among several committee chair positions. Murray garnered national attention in 2013, when she and Republican representative Paul Ryan announced that they had negotiated a two-year, bipartisan budget, known as the Bipartisan Budget Act of 2013. Murray is currently the sixth-most senior member of the Senate, the third-most senior Democrat, and the dean of Washington's congressional delegation.\n</p>]",
        "capital_summary": "Olympia is the capital of the U.S. state of Washington and the county seat and largest city of Thurston County. It is 60 miles (100 km) southwest of the state's most populous city, Seattle, and is a cultural center of the southern Puget Sound region.",
        "full_name": "Patty Murray",
        "img": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Patty_Murray%2C_official_portrait%2C_113th_Congress.jpg"
    },
    "Maria_Cantwell": {
        "handle": "SenatorCantwell",
        "state": "Washington",
        "capital_city": "Olympia",
        "latitude": "47.035805",
        "longitude": "-122.905014",
        "wiki_html": "[<p><b>Maria Ellen Cantwell</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'k' in 'kind'\">k</span><span title=\"/æ/: 'a' in 'bad'\">æ</span><span title=\"'n' in 'nigh'\">n</span><span title=\"'t' in 'tie'\">t</span><span title=\"/ˌ/: secondary stress follows\">ˌ</span><span title=\"'w' in 'wind'\">w</span><span title=\"/ɛ/: 'e' in 'dress'\">ɛ</span><span title=\"'l' in 'lie'\">l</span></span>/</span></span>; born October 13, 1958)<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> is an American politician and former businesswoman serving as the junior United States senator from Washington since 2001. A member of the Democratic Party, she previously served in the Washington House of Representatives from 1987 to 1993, and the United States House of Representatives from <span data-sort-value=\"Washington01 !\">Washington's 1st congressional district</span> from 1993 to 1995.\n</p> <p>Born and raised in Indianapolis, Indiana, Cantwell graduated from Miami University before moving to Seattle to work on Alan Cranston's 1984 presidential campaign. In 1986, she was elected to the state House of Representatives, where she served until her election to Congress in 1992. Cantwell served one term in Congress before losing her seat to Republican Rick White in the 1994 election. She then briefly worked in the private sector as vice president of marketing for RealNetworks.\n</p> <p>Despite having vowed to remain out of politics, Cantwell ran for the United States Senate in 2000. She defeated Republican incumbent Slade Gorton in one of the closest elections in the state's history. Cantwell was reelected in 2006, 2012, and 2018. Upon the February 2017 resignation of Jeff Sessions to become United States Attorney General, she became the most senior junior senator. She is the second female senator from Washington, after Patty Murray.\n</p>]",
        "capital_summary": "Olympia is the capital of the U.S. state of Washington and the county seat and largest city of Thurston County. It is 60 miles (100 km) southwest of the state's most populous city, Seattle, and is a cultural center of the southern Puget Sound region.",
        "full_name": "Maria Cantwell",
        "img": "https://upload.wikimedia.org/wikipedia/commons/2/24/Maria_Cantwell.jpg"
    },
    "Joe_Manchin": {
        "handle": "Sen_JoeManchin",
        "state": "West Virginia",
        "capital_city": "Charleston",
        "latitude": "38.336246",
        "longitude": "-81.612328",
        "wiki_html": "[<p><b>Joseph Manchin III</b><sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> (born August 24, 1947) is an American politician and businessman serving as the senior United States senator from West Virginia, a seat he has held since 2010. A member of the Democratic Party, he was the 34th governor of West Virginia from 2005 to 2010 and the 27th secretary of state of West Virginia from 2001 to 2005. Manchin became the state's senior U.S. senator when Jay Rockefeller retired in 2015. He has called himself a \"centrist, moderate, conservative Democrat\" and is generally cited as the most conservative Democrat in the Senate.<sup class=\"reference\" id=\"cite_ref-centristmoderateconservative_2-0\">[2]</sup> As a member of Congress, Manchin is known for his bipartisanship in working with Republicans on issues such as abortion, immigration, energy policy, and gun control.<sup class=\"reference\" id=\"cite_ref-:1_3-0\">[3]</sup><sup class=\"reference\" id=\"cite_ref-4\">[4]</sup><sup class=\"reference\" id=\"cite_ref-primary-challenge_5-0\">[5]</sup><sup class=\"reference\" id=\"cite_ref-:4_6-0\">[6]</sup><sup class=\"reference\" id=\"cite_ref-:5_7-0\">[7]</sup>\n</p> <p>Manchin won the 2004 West Virginia gubernatorial election by a large margin and was reelected by an even larger margin in 2008. Manchin won the 2010 special election to fill the Senate seat vacated by incumbent Democrat Robert Byrd's death with 54% of the vote. He was elected to a full term in 2012 with 61% of the vote and reelected in 2018 with just under 50% of the vote. Manchin won elections in West Virginia even as the state became heavily Republican, with Manchin being the only Democrat in West Virginia's congressional delegation or holding statewide office in 2021.<sup class=\"reference\" id=\"cite_ref-8\">[8]</sup>\n</p> <p>He opposed the energy policies of President Barack Obama, including reductions and restrictions on coal mining, voted against cloture for the Don't Ask, Don't Tell Repeal Act of 2010 (not voting on the bill itself), voted to remove federal funding for Planned Parenthood in 2015, supported President Donald Trump's border wall and immigration policies, and voted to confirm most of his cabinet and judicial appointees, including Associate Justice Brett Kavanaugh. Manchin opposes many progressive priorities, such as Medicare For All, the Green New Deal, abolishing the filibuster, expanding the Supreme Court, and defunding the police.<sup class=\"reference\" id=\"cite_ref-9\">[9]</sup> Manchin has also repeatedly voted against attempts to repeal the Affordable Care Act, voted to preserve funding for Planned Parenthood in 2017, and voted against the Tax Cuts and Jobs Act of 2017. In addition, he voted to convict Trump in both of his impeachment trials. He is among the more non-interventionist members of the Democratic caucus, having repeatedly called for the withdrawal of American troops from Afghanistan and opposed most military interventions in Syria.<sup class=\"reference\" id=\"cite_ref-WVMN1082018_10-0\">[10]</sup><sup class=\"reference\" id=\"cite_ref-CNN9142014_11-0\">[11]</sup>\n</p> <p>After the 2020 elections, Manchin became the \"most important swing vote\" in the Senate,<sup class=\"reference\" id=\"cite_ref-12\">[12]</sup> which is split 50–50 between Democrats and Republicans, but controlled by Democrats because Vice President Kamala Harris is the tiebreaker. Since passing legislation with only Democratic support requires Manchin's vote, he wields a large influence in the 117th Congress.<sup class=\"reference\" id=\"cite_ref-13\">[13]</sup>\n</p>]",
        "capital_summary": "Charleston is the capital and most populous city of West Virginia. Located at the confluence of the Elk and Kanawha rivers, the city had a population of 51,400 at the 2010 census and an estimated population of 46,536 in 2019. The Charleston metropolitan area as a whole had an estimated 208,089 residents in 2019.   Charleston is the center of government, commerce, and industry for Kanawha County, of which it is the county seat.\n",
        "full_name": "Joe Manchin",
        "img": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Senator_Manchin.jpg"
    },
    "Shelley_Moore_Capito": {
        "handle": "SenCapito",
        "state": "West Virginia",
        "capital_city": "Charleston",
        "latitude": "38.336246",
        "longitude": "-81.612328",
        "wiki_html": "[<p><b>Shelley Wellons Moore Capito</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'k' in 'kind'\">k</span><span title=\"/æ/: 'a' in 'bad'\">æ</span><span title=\"'p' in 'pie'\">p</span><span title=\"/ɪ/: 'i' in 'kit'\">ɪ</span><span title=\"'t' in 'tie'\">t</span><span title=\"/oʊ/: 'o' in 'code'\">oʊ</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">KAP</span>-i-toh</i>; born November 26, 1953) is an American politician and retired educator serving as the junior United States senator for West Virginia since 2015. A Republican, she is the daughter of three-term West Virginia governor Arch Alfred Moore Jr.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> Capito was the U.S. representative for <span data-sort-value=\"West Virginia02 !\">West Virginia's 2nd congressional district</span> from 2001 until her 2014 election to the Senate. She is the dean of West Virginia's congressional delegation, serving since 2001.\n</p> <p>Capito was the only Republican in West Virginia's congressional delegation until 2011, and the first Republican woman elected to Congress from West Virginia. She was the first woman elected to the U.S. Senate from West Virginia<sup class=\"reference\" id=\"cite_ref-2\">[2]</sup> and the first Republican to win a full term in the Senate from West Virginia since 1942. She was reelected in 2020, defeating Democratic nominee Paula Jean Swearengin.\n</p> <p>Since 2021, she has served as the ranking member of the Senate Environment Committee.\n</p>]",
        "capital_summary": "Charleston is the capital and most populous city of West Virginia. Located at the confluence of the Elk and Kanawha rivers, the city had a population of 51,400 at the 2010 census and an estimated population of 46,536 in 2019. The Charleston metropolitan area as a whole had an estimated 208,089 residents in 2019.   Charleston is the center of government, commerce, and industry for Kanawha County, of which it is the county seat.\n",
        "full_name": "Shelley Moore Capito",
        "img": "https://upload.wikimedia.org/wikipedia/commons/7/75/Shelley_Moore_Capito_official_Senate_photo.jpg"
    },
    "Ron_Johnson_(Wisconsin_politician)": {
        "handle": "SenRonJohnson",
        "state": "Wisconsin",
        "capital_city": "Madison",
        "latitude": "43.074684",
        "longitude": "-89.384445",
        "wiki_html": "[<p><b>Ronald Harold Johnson</b> (born April 8, 1955) is an American accountant, businessman, and politician serving as the senior United States senator from Wisconsin. A Republican, Johnson was first elected to the U.S. Senate in 2010, defeating Democratic incumbent Russ Feingold. He was reelected in 2016, defeating Feingold in a rematch. Before entering politics, Johnson was chief executive officer of a polyester and plastics manufacturer founded by his brother-in-law.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup>\n</p> <p>A staunch ally of President Donald Trump, Johnson voted for Trump's Tax Cuts and Jobs Act in 2017, supported Trump's decision to end Deferred Action for Childhood Arrivals (DACA), launched investigations into his political opponents and promoted false claims of fraud in relation to Trump's defeat in the 2020 presidential election. He has rejected the scientific consensus on climate change. During the COVID-19 pandemic, Johnson voted for the CARES Act, resisted stay at home orders, used his chairmanship of the Senate Homeland Security Committee to invite witnesses to push fringe theories about COVID-19, and spread misinformation about COVID-19 vaccinations.\n</p>]",
        "capital_summary": "Madison is the capital of the U.S. state of Wisconsin and the seat of Dane County. As of the 2020 census the population was 269,840 which made it the second-largest city in Wisconsin by population, after Milwaukee, and the 80th-largest in the United States. The city forms the core of the Madison Metropolitan Area which includes Dane County and neighboring Iowa, Green, and Columbia counties for a population of 680,796. Madison is named for American Founding Father and President James Madison. The city is located on the traditional land of the Ho-Chunk, and the Madison area is known as Dejope, meaning \"four lakes\", or Taychopera, meaning \"land of the four lakes\", in the Ho-Chunk language.\n",
        "full_name": "Ron Johnson (Wisconsin politician)",
        "img": "https://upload.wikimedia.org/wikipedia/commons/7/79/Ron_Johnson_portrait_117th_Congress.jpg"
    },
    "Tammy_Baldwin": {
        "handle": "SenatorBaldwin",
        "state": "Wisconsin",
        "capital_city": "Madison",
        "latitude": "43.074684",
        "longitude": "-89.384445",
        "wiki_html": "[<p><b>Tammy Suzanne Green Baldwin</b> (born February 11, 1962) is an American lawyer and politician serving as the junior United States senator from Wisconsin since January 2013. A member of the Democratic Party, she served three terms in the Wisconsin State Assembly, representing the 78th district, and from 1999 to 2013 represented Wisconsin's 2nd congressional district in the United States House of Representatives.\n</p> <p>In 2012, Baldwin was elected to the United States Senate, defeating Republican nominee Tommy Thompson. In 2018, Baldwin was reelected, defeating Republican nominee Leah Vukmir.\n</p> <p>Baldwin, who is a lesbian, became the first openly LGBT woman elected to the House of Representatives and to the Senate in 1999 and 2013, respectively.<sup class=\"reference\" id=\"cite_ref-Grinberg_2-0\">[2]</sup><sup class=\"reference\" id=\"cite_ref-Cogan_3-0\">[3]</sup><sup class=\"reference\" id=\"cite_ref-Gay1_4-0\">[4]</sup> She also was the first woman to be elected to either chamber from Wisconsin.<sup class=\"reference\" id=\"cite_ref-Grinberg_2-1\">[2]</sup><sup class=\"reference\" id=\"cite_ref-Cogan_3-1\">[3]</sup> Baldwin identifies as a progressive,<sup class=\"reference\" id=\"cite_ref-proud_5-0\">[5]</sup><sup class=\"reference\" id=\"cite_ref-6\">[6]</sup> and she has a consistently progressive voting record.<sup class=\"reference\" id=\"cite_ref-:1_7-0\">[7]</sup><sup class=\"reference\" id=\"cite_ref-:2_8-0\">[8]</sup> She supports Medicare for All,<sup class=\"reference\" id=\"cite_ref-:3_9-0\">[9]</sup> LGBTQ rights,<sup class=\"reference\" id=\"cite_ref-:4_10-0\">[10]</sup> and gun control,<sup class=\"reference\" id=\"cite_ref-:5_11-0\">[11]</sup> and opposed the Iraq War.<sup class=\"reference\" id=\"cite_ref-usatoday_12-0\">[12]</sup>\n</p>]",
        "capital_summary": "Madison is the capital of the U.S. state of Wisconsin and the seat of Dane County. As of the 2020 census the population was 269,840 which made it the second-largest city in Wisconsin by population, after Milwaukee, and the 80th-largest in the United States. The city forms the core of the Madison Metropolitan Area which includes Dane County and neighboring Iowa, Green, and Columbia counties for a population of 680,796. Madison is named for American Founding Father and President James Madison. The city is located on the traditional land of the Ho-Chunk, and the Madison area is known as Dejope, meaning \"four lakes\", or Taychopera, meaning \"land of the four lakes\", in the Ho-Chunk language.\n",
        "full_name": "Tammy Baldwin",
        "img": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Tammy_Baldwin%2C_official_portrait%2C_113th_Congress.jpg"
    },
    "John_Barrasso": {
        "handle": "SenJohnBarrasso",
        "state": "Wyoming",
        "capital_city": "Cheyenne",
        "latitude": "41.140259",
        "longitude": "-104.820236",
        "wiki_html": "[<p><b>John Anthony Barrasso III</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"'b' in 'buy'\">b</span><span title=\"/ə/: 'a' in 'about'\">ə</span><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'r' in 'rye'\">r</span><span title=\"/ɑː/: 'a' in 'father'\">ɑː</span><span title=\"'s' in 'sigh'\">s</span><span title=\"/oʊ/: 'o' in 'code'\">oʊ</span></span>/</span></span> <i title=\"English pronunciation respelling\">bə-<span style=\"font-size:90%\">RAH</span>-soh</i>; born July 21, 1952) is an American physician and politician serving as the senior United States senator from Wyoming. A member of the Republican Party, he previously served in the Wyoming State Senate.\n</p> <p>Born and raised in Reading, Pennsylvania, Barrasso graduated from Georgetown University, where he received his B.S. and M.D. He conducted his medical residency at Yale University before moving to Wyoming and beginning a private orthopedics practice in Casper. Barrasso was active in various medical societies and associations.\n</p> <p>Barrasso first ran for U.S. Senate in 1996, narrowly losing the Republican primary to Mike Enzi. In 2002, he was elected to the state Senate, where he stayed until his appointment to the U.S. Senate after the 2007 death of incumbent Craig L. Thomas. He was elected to finish Thomas's term in 2008 and reelected in 2012 and 2018. In 2018, Barrasso was selected as chair of the Senate Republican Conference.<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> He is the dean of Wyoming's congressional delegation.\n</p>]",
        "capital_summary": "Cheyenne is the capital and most populous city of the U.S. state of Wyoming, with 65,132 residents. It is the principal city of the Cheyenne metropolitan statistical area which encompasses all of Laramie County and has about 100,000 residents. Local residents named the town for the Cheyenne Native American people in 1867 when it was founded in the Dakota Territory.\n",
        "full_name": "John Barrasso",
        "img": "https://upload.wikimedia.org/wikipedia/commons/f/fb/John_Barrasso_official_portrait_112th_Congress.jpg"
    },
    "Cynthia_Lummis": {
        "handle": "SenatorEnzi",
        "state": "Wyoming",
        "capital_city": "Cheyenne",
        "latitude": "41.140259",
        "longitude": "-104.820236",
        "wiki_html": "[<p><b>Cynthia Marie Lummis Wiederspahn</b> (<span class=\"rt-commentedText nowrap\"><span class=\"IPA nopopups noexcerpt\">/<span style=\"border-bottom:1px dotted\"><span title=\"/ˈ/: primary stress follows\">ˈ</span><span title=\"'l' in 'lie'\">l</span><span title=\"/ʌ/: 'u' in 'cut'\">ʌ</span><span title=\"'m' in 'my'\">m</span><span title=\"/ɪ/: 'i' in 'kit'\">ɪ</span><span title=\"'s' in 'sigh'\">s</span></span>/</span></span> <i title=\"English pronunciation respelling\"><span style=\"font-size:90%\">LUMM</span>-iss</i>;<sup class=\"reference\" id=\"cite_ref-1\">[1]</sup> born September 10, 1954) is an American politician serving as the junior United States senator from Wyoming. Before her tenure in the Senate, she served in the Wyoming House of Representatives from Laramie County, Wyoming Senate from the 5th district, as treasurer of Wyoming, and in the United States House of Representatives from Wyoming's at-large congressional district.\n</p> <p>Lummis was born in Cheyenne, Wyoming, and educated at Cheyenne East High School and the University of Wyoming. She was elected to the Wyoming House of Representatives in 1978 and reelected in 1980, becoming the youngest woman to serve in the state legislature. Despite choosing not to seek another term in 1982, Lummis returned to the state House and served there until being elected to the state Senate in 1992, defeating incumbent Senator Harriet Elizabeth Byrd. After serving one term in the state senate, she served on Governor Jim Geringer's transition team and as his general counsel.\n</p> <p>In 1998, Lummis was elected treasurer of Wyoming, and she was reelected in 2002 without opposition. She served as the chair of Mary Mead's gubernatorial campaign in 1990 and Ray Hunkins's gubernatorial campaign in 2006. She also served on Bob Dole's presidential steering committee in Wyoming and chaired Mitt Romney's 2012 presidential campaign in Wyoming.\n</p> <p>Lummis was elected to succeed Barbara Cubin in the U.S. House of Representatives in the 2008 election after defeating Democratic nominee Gary Trauner. During her tenure in the House she was the first Wyoming representative to serve on the Agriculture committee since 1941, chair of the Science Subcommittee on Energy, served as co-chair of the Congressional Caucus for Women's Issues, and was active in the Congressional Western Caucus and Freedom Caucus. She served until her retirement in 2017, and was succeeded by Liz Cheney. Following her tenure in the House she sought a position in President Donald Trump's cabinet as the United States Secretary of the Interior, but was not appointed. Lummis unsuccessfully sought to be appointed to replace Senator Craig L. Thomas in 2007. She was elected to the United States Senate in the 2020 election, becoming the first woman to represent Wyoming in the U.S. Senate. She voted to reject the certification of Pennsylvania's electoral votes in the 2020 presidential election, which were narrowly won by Joe Biden, amid Trump's false claims of fraud.\n</p>]",
        "capital_summary": "Cheyenne is the capital and most populous city of the U.S. state of Wyoming, with 65,132 residents. It is the principal city of the Cheyenne metropolitan statistical area which encompasses all of Laramie County and has about 100,000 residents. Local residents named the town for the Cheyenne Native American people in 1867 when it was founded in the Dakota Territory.\n",
        "full_name": "Cynthia Lummis",
        "img": "https://upload.wikimedia.org/wikipedia/commons/6/69/Cynthia_Lummis_U.S._Senator.jpg"
    }
}